[
  {
    "review_id": "TVqe-MA9Lm2KK3mU0rsiIQ",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "w0lcP2ngFaUpBGi5yzlYDw",
    "stars": 5.0,
    "useful": 12,
    "funny": 4,
    "cool": 7,
    "text": "I would said this restaurant is unique in many ways. The cuisine, the setting of the restaurant, the attention of owner make the place great to eat. There are gluten free item and grass feed beef as their advertisements of the material of the food. \n\nI like to mention a little about their sound system. It is front row seat to the concert. The restaurant invest a very good sound system that is pleasure to the ear. They also hide their speaker very well. Imagine they play the Star Wars music. May the force be with you. \n\nWe have order the taste of the islands and the blacken mango salmon. The taste of the island include curry goat, Ox tail and jerk chicken. The goat is a bit heavy smell. The jerk chicken is great with the seasoning they have. The best is the Ox Tail. The Ox tail with Caribbean spice make this dish special.\n\nThe blacken salmon is prepare with Caribbean blacken spice. It is very nice. It serves over cook pineapple sauce. The fish is tasty. This dish accompanied with a side salad. The desert we have is the coconut cake. The coconut cake has layers of coconut cream. It is guilty pleasure. \n\nThe greeting of the owner from the restaurant make this place special. The decorations is modern and it is gear up for upper class power lunch or dinner. Nice touch. Service is great and the cook is the owner wife. It is family run with attention to the details.",
    "date": "2016-01-07 03:00:44"
  },
  {
    "review_id": "VrB_aaXf8uTQ5p0s543cFQ",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "Mha77MN_BYGB-w7DONZ5YA",
    "stars": 5.0,
    "useful": 7,
    "funny": 3,
    "cool": 7,
    "text": "Base on the affordable price, great food, and good service, this is considering 5 stars restaurant. \n\nWe have yelp group enjoy our time and food here. Since we have 7 in the group, we have ordered the Family Dinner. It is a whole chicken with salad, fried yuca, and cilantro rice. The salad is fresh with vinaigrette dressing. I like the cilantro rice with spice in rice. The chicken is marinated and slowly roasted with the skin is crispy outside. We have added the tostones - the flatten fried green plantain for other member to experience the food. \n\nWe also ordered the Cuenellis Special - Palomilla Steak with fried egg. The steak is well season and tasty, however, the steak may need to be tenderizing for better chewing. The dish also come with fried yuca, 1/4 chicken and fried sweet plantain. A lot food for affordable meal.",
    "date": "2015-07-25 00:13:47"
  },
  {
    "review_id": "uVlK38hJUdEZe8w1sx12bA",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "fw2E3GYpoJ2rq1YmzoBSmQ",
    "stars": 5.0,
    "useful": 3,
    "funny": 2,
    "cool": 2,
    "text": "This is my special review for a single vender in the French Market. The reason that they need special attention is due to the unique food that they are prepared. If you visit the French Market, do not miss up the opportunity to try their food. Their vender stand is located at the last vender stand of the food venders at first open air structure. It is very much at the middle of two open air structures. \n\nThey occupied three vender stands and a front open air stand. You will not miss it. The front vender stand offers the roast cone and broil peanut. They roasted their corn in the enclose smoker. Once they receive the order, they will peel off the skin and show the ear. Then they will dip the corn to the hot butter, and season with salt, parmesan cheese (yum), Cajun spice (wow). My wife loves this corn. The inner vender stand serves the deep fried corn, crab cake, gator bites, and frog leg. They also serve different type of fruit drink and icy. We were curious the deep fry corn did not turn to pop corn. The vender owner assures us it will not happen. Evidently, it does not and coated with thin cajun coating. I have concluded the deep fried corn is a boy food and the roast corn is girl food base on the preference.\n\nWe also order the home made crab cake. The surprise is not the crab cake; it is the side dish that comes with it. The deep fried kale. I have the deep fried kale at the Cool Bean restaurant in Tallahasse FL. I did not expect they are as good as the restaurant grade. The Kale is deep fried for 30 second then season. The best thing is when you put on the tongue and the kale melt like cotton candy. The vender did a very good job.",
    "date": "2015-02-12 19:38:22"
  },
  {
    "review_id": "UjJMQxNtWmvzabavsl9qhg",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "jMZ56S8Y1t7cA1Ob-d-qeA",
    "stars": 5.0,
    "useful": 3,
    "funny": 3,
    "cool": 3,
    "text": "I am using this restaurant to mark my 100 review. This will be the restaurant I will likely repeat when I come back to New Orleans. This is one of my favorite restaurants in New Orleans. Each reservation or walk in is allowed for 1.5 hours dining in the prime evening by the restaurant. The restaurant offer blue music while eating. The musician is very good and talented. They can kick into high gear or take it slow like Big Easy. \n\nThis restaurant located Marigny area. This is a hypies area. Many people around this area are care free. But the restaurant is considered a high end even though they are located in this area. We love the performance by the musician. The guitar and harmonica have their solo highlight display the talented tune. The singer also great and the song is about the daily life. \n\nTonight we have order the Two Run Farms Lamb Sliders, Beer Braised Kurobuta Pork Belly, Bleu Cheese Stuffed Dates, Seared Scallops, Crab Dra Diavolo Cannolloni and Deviled Yard Egg. Most of the dishes have a choice of small or large quantity. Our first dish is the Deviled Yard Egg. The egg filling include seasoned egg yolk. It garnish with seasoned chop vege and top with deep fry broccoli flower. You will experience with crispy, sweet vege, and salty paste taste. The second dish Bleu Cheese Stuffed Dates. The Dates wrap in bacon and drizzle with sweet vanilla balsamic vinaigrette. The Bleu Cheese is stuff in the Dates and the combination allow for salty first then sweet (bacon to sweet dates). The third dish is  pork belly. This is my favorite dish in the restaurant. The pork belly is slice in rectangular cube. They pork belly is actually braise to soft the texture then slightly sear at the outside. It place on Chinese flat bread and garnish in the pickle cucumber. When you place the pork belly at your tongue, you can feel the pork belly fat actually melt away. This is actually a Chinese technique to cook the pork belly in pressure cooker and braise in slow fire. This is a dish should not miss. The fourth dish is the Crab Dra Diavolo Cannolloni. This is fresh pasta with spicy crab meat filling. It is cook with tomato sauce with caper.  The pasta is refreshing. The fifth dish is the Lamb Slider. The lamb meat is grounded and seasoned. It cooks over the open flame and top with tomato creamy sauce. The last dish is the seared scallop. The scallop is seared and serve with charizo, red lentils and bok chai. \n\nOverall we enjoy the great music over the meal. I have order the local brewer beer - southern pecan beer. It is great to go with the meal. The service is great. I am award this restaurant with five star to start my 3 digit review.",
    "date": "2015-02-11 04:10:01"
  },
  {
    "review_id": "kcy_ksZbBjbkuHzu95YOIQ",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "CSRbFLgUDO1cvr3OlRMLHA",
    "stars": 5.0,
    "useful": 23,
    "funny": 5,
    "cool": 16,
    "text": "It is good start for the poke work. They are ready on first day. The entire crew able to serve customers at the first day. Method and ingredients are correct. Pokeworks located at the mall near the food court. \n\nI did take advantage on their grand opening special but one get one free. We have free samples of the sorbet ice while we wait on the line. I like their choices on the base, ingredients, topping. At the base they have a choice that no poke place has it yet - the kale noodle. It is delicious. On the topping, they have and item like fried slice lotus root. That is unique at it on way. \n\nIn addition, they mix the ingredients separately with sauce or flavor. Their worker are well train and costume to your order. They ask you you want light, medium or heavy sauce. It give you adjustment for not too sweet or salty of your food. Great choice. I am a fan for this poke. Many other poke store need to learn from them.",
    "date": "2019-07-15 19:28:38"
  },
  {
    "review_id": "TpKbk_XJWJJCZqiB4wtUdg",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "MWrSqr3VmBcSKT4Uhk695g",
    "stars": 5.0,
    "useful": 20,
    "funny": 5,
    "cool": 19,
    "text": "Great bakery at the Hillsborough Ave and Sheldon. This bakery is kind hidden at the corner and very difficult to find. It is on the south east corner or the plaza. It has an outdoor red umbrella and Columbia flag in front of the store. \n\nIf you are here, got to try their ice coffee. They use whole milk or 2% milk to stir up with mocha coffee. It use food processor to grind the ice and coffee and milk. Very delicious. \n\nThe pastry is another best. Got to try their sweet corn and cheese item. The pastry includes beef and chicken fluffy pastry. Other than it. It has many pastry to select. Some thing sweet or salty. \n\nPrice are affordable. Many Columbian has done here. The store server know a little English only. So point you finger. Don't worry about price. You will love and they are affordable.",
    "date": "2019-09-13 11:42:33"
  },
  {
    "review_id": "Orj6b2kCwHkLq_ZT3rU9Cw",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "LnQRfj3pPz0369stRnwUWw",
    "stars": 5.0,
    "useful": 11,
    "funny": 2,
    "cool": 2,
    "text": "I have seen one of the elite member friend review this restaurant and want to come here to check it out. The restaurant is far away from any interstate. However, it is worth a trip for taste and unique of the food. \n\nThis restaurant only has three elite members review including me. This restaurant needs to make know. I would say this is a very creative on taste and combination of the ingredient. \n\nWe have Ahi Poke, Out of Control Roll, Tampa Roll, and Spicy Tuna Roll. The Ahi Poke is Ahi tuna seared with shichimi pepper and tossed w. hot sesame oil, sriracha sauce, scallions, and masago. Served on crispy wonton chips, and avocado. It is a bit spicy but the preparation of the roll requires time in cooking, chopping, assembling, and decorating. It top with eel sauce and set on the fried wonton skin and make a beautiful presentation. \n\nThe out of control roll is never out of control. The flavor is well control and sophisticate. This roll is tuna, salmon, kani & avocado inside, tuna, salmon & yellow- tail w. mayo & seared across, caviar on top w. eel sauce and scallion. This roll require dear across the roll top with eel sauce and masago. This is another creation of the chef. \n\nI would recommend order from the Uchi special roll section if you are here. The service is good. This place is a bit pricy but worth the money to try special roll.",
    "date": "2015-07-05 11:39:31"
  },
  {
    "review_id": "iAqqj-4vHJsi2CS4dDPpMA",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "aDd5-AAWriJscf2dTdGOCA",
    "stars": 5.0,
    "useful": 18,
    "funny": 5,
    "cool": 19,
    "text": "Authentic cuisine number 59. Philippine cuisine. \n\nThis restaurant is close to low side of 4.5 stars. I see many potential potential for this restaurant. They have many good things going on this food truck. I round them to 5 stars. \n\nIf you come here, you got to try their halo halo. Their halo halo is different than most Philippino cuisine. The bean and jelly are home made. The juice is jackfruit juice. Very special. Best halo halo in town. \n\nThis food truck is popular here. A lot of customers. They do have the seating area. But I rather take it to go during pandemic. The menu changes every day. When they sold out they will not continue make it until next day. \n\nWe got the Bistek. It is sirloin beef steak simmering in soy sauce. The serve with rice and lumpia. I would only give them an average on this dish. The second dish is much better choice. It is the sautéed mung bean. It serve with the fried scad fish. The bean is one of the kind. I would recommend this dish. Fish is good. You have to chose tail or head section.",
    "date": "2020-07-10 20:04:55"
  },
  {
    "review_id": "QqO8UViaHcwRwHEYSz7Y6A",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "GApqfwJMxg4t2tk3K2PpMw",
    "stars": 5.0,
    "useful": 17,
    "funny": 5,
    "cool": 11,
    "text": "I am glad they finally think about northern Tampa. Zoe's new location definitely will bring a lot revenue to the company. Because Dale Mabry Carrollwood area is definitely a restaurant pocket. With that said, I think will be a good contributor to the community with great food with easy selection. \n\nI like the new restaurant with outside seating that allow many dog owners gladly visit the restaurant. This is a plus in many way just by sacrificing a few parking space with outside seating. \n\nThe restaurant Mediterranean cuisine has a lot to offer. You can have kabob, bowl, sandwich, pita, salad, and piadinas. We got the salmon bowl with Mediterranean Salad Trio. I am good with that. The best is salmon kabob with roasted veggies and quinoa. This is very good dish. The salmon is fresh and grilled very well. I like roasted veggies with a lot flavor. I would go for double roasted veggies incomparable to quinoa. \n\nThe manager did make around our table to see how is our food. I also like to suggest the Mediterranean Lamb Kafka as starter if you happen to visit them.",
    "date": "2018-05-13 03:08:51"
  },
  {
    "review_id": "GppMT_klYqWe13-gNE2DDw",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "ymy2ykGH2kjcPIitZQkkUg",
    "stars": 5.0,
    "useful": 17,
    "funny": 4,
    "cool": 13,
    "text": "They actually do not have the buffet. We were there thinking they have the buffet. But they have the tali plate. Which is better to my opinion. \n\nWe got the meat tali. It has a lot of chamber to fill the plate. I like it because the appetizers also meat. My two entrees is the mutton curry and the fish curry. These two curry were very good. Especially the mutton curry Kat fresh out the kitchen. Tasty. I also like the fried chicken curry. It has a lot character. The rice has biryanis rice and good chicken in it. \n\nNot much of service. When yo finish the plate, they ask you dump it your self. By food is excellent.",
    "date": "2020-10-27 18:25:47"
  },
  {
    "review_id": "wuVHSv72gJTFmPNCVuB0-g",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "QNxXsVPYcecUuhGRG-88OQ",
    "stars": 5.0,
    "useful": 18,
    "funny": 5,
    "cool": 16,
    "text": "Yelping No. 2500. \nThis one go to local restaurant Harvest Bowl. I believe they have very good potential. The place is great to to visit since they converted fro paint store to restaurant with huge space. This place includes eatery and food market. I like the concept. The only down side is not much of seating area. Very limited due to space fill with groceries items. \n\nI got the Asian fusion bowl with grilled salmon. The salmon was excellent. The sauce in the bowl is tasty. I like mixture of ingredients. My wife got the building your own bowl with BBQ chicken and pull chicken. She like her bowl. She like the Brussels sprouts. We also got meat pie. I recommend you get that if they have it. We also got the cheese cake. They have many selections of cheese cake. The cheese taste light which is the way I love.",
    "date": "2020-04-06 16:17:46"
  },
  {
    "review_id": "jOiYW0uA5TLqQHpVlDSjVg",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "UGebrYgNZrMzbGbcI01JWA",
    "stars": 5.0,
    "useful": 41,
    "funny": 19,
    "cool": 35,
    "text": "My first visit is five stars and my second visit is 4 stars. They should be around 4.5 stars. Not a try 5 stars restaurant. They restaurant seating capacity is a little to less. They do have back door outside seating area and front outdoor seating area. This is a chain restaurant originated from California. It combine many cuisine street food and on display in single restaurants. \n\nWho thought changing the shape of the churro and add topping bring may like customers. We have chocolate sprinkles churro. It was interesting. I like the popcorn chicken. The five spice coating is really nice. We got our entree as garlic noodle shaken beef. The beef is really shaken for the first time visit. Bit repetitive second time visit they over cook it. The fillet mignon pho is more torn down from Vietnamese version. But still good. Pad see ew is good but it in Thai standard. Overall food is good. \n\nThe fruity booty slush is highly recommended. The other drink pink flamingo is good too. Overall service is good.",
    "date": "2021-01-27 03:24:44"
  },
  {
    "review_id": "JH9f8BV0P8VxDpSMDJp_RQ",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "rdiB9Aye9-gkwd2hnckWHQ",
    "stars": 5.0,
    "useful": 8,
    "funny": 2,
    "cool": 8,
    "text": "This review has five stars only because of their lunch special. It is actually an 4.5 stars. It is good value on weekday lunch special. Most roll is about $5. Even they are $5, each roll come with 8 pieces. The lunch special is from Monday to Friday. During lunch time, they have quite number of customers. \n\nI got the vegetable roll, Cougar roll, Lava roll, Mexican roll and eel cucumber roll. The best is cougar roll. It is spicy tuna with sweet seaweed and top with smelt roe. The tuna grade is excellent. The next one I like is lava roll with spicy crab on California roll top with shiracha sauce. \n\nThey may be not five star if I come at night time and pay more because I expect better. Obviously the dinner is still needed to be evaluated. The service is just right. Did not make me jump up my seat. But the quality of the food is good.",
    "date": "2017-09-22 02:20:15"
  },
  {
    "review_id": "IlQQrinBaiCg6gSz6c9CKA",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "3yI-7C8JzbG-ZaSqAGHMAQ",
    "stars": 5.0,
    "useful": 4,
    "funny": 4,
    "cool": 3,
    "text": "In search of Taco in the Bay Area. Taco is thriving in this restaurant. The name really attract many people to be here. I just wonder who will be the taco father. I like the name of the restaurant reflect their food of serving. \n\nTonight we did not try other combination but just taco. Since tonight is week night, we order the taco on the board. The steak, grilled pork, cow tongue, pork in green salsa. I like the steak taco. You know they have good taco because the steak is not pre-cook and re-cook when people order (the meat will be too dry). As a result the meat is tender and juicy. I heard they have the shrimp taco special on Friday. I will be back to try that. \n\nThey are about 4.5 stars restaurant in my opinion. I award them to five stars due to a lot of meat is pack to one taco, juicy, great taste, nice garnish. I like the meat is likely season not over power and still can taste the steak is the important key factor. This review only for their taco not other combination dish. I would try their quesadilla next time I am here.",
    "date": "2016-04-09 09:04:27"
  },
  {
    "review_id": "fkf35qdLIGqokRcrGH5-sg",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "EP2jFD3aGoSBCWb7irY5-w",
    "stars": 5.0,
    "useful": 19,
    "funny": 4,
    "cool": 18,
    "text": "Rare Ethnic Food #73. Ethiopian Cuisine. \n\nQueen of Sheba is the best African restaurant you can find in Tampa Bay. Love it. The mixture of the spice and taste is very harmonious good. Expect waiting for the food because is popular. The owner is very friendly. Treat you like her family.\n\nWe got the sampler to share and add a lamb tip. The sampler has three meats and three veggies. The three meats including two chicken and one beef. We add Queen Lamb Tip. All the meat is cook with different flavor. I like all of them. The lamb is good. I also like the veggies. Very good use of spice in each veggies to create the dish. Love the creativity of the veggies. You also can ask the share plate to be all veggies. \n\nThe best way to eat it is by hand. Use the injera to pick up the food. My cheated with requested folk and knife. Which is not normally done.",
    "date": "2021-08-01 11:47:18"
  },
  {
    "review_id": "ms2w6nWrd2naNtt7yRZUXA",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "_uQEKHH0R5fxrYkLrUI9pQ",
    "stars": 5.0,
    "useful": 20,
    "funny": 6,
    "cool": 15,
    "text": "Rare Authentic Cuisine 63, Xi'an Cuisine \n\nFinally, I can say there is a great hand pull noodle in Tampa. And!! It is at my neighborhood. Finally the wait is over, and I was able to eat in the restaurant. The restaurant name in Chinese is \"Old Taste\". I believe it old method long pass through generations and come to US. Xi'an cuisine is famous on flat noodle, beef rougamo , or hand pull noodle. Love it. \n\nWe start with the beef rougamo - beef pita. The beef is slice beef shank with spicy marinated. I've the beef. I may not necessarily like the pita. We also got the Yummy chicken nuggets. The coating is panko crispy with a bit of Cummings. \n\nOur main dish is braise beef hand pull noodle. This is the one I recommend. The beef was well marinated and keep the juicy meat taste. The hand pull noodle has very good texture. By the way, it is spicy. The final dish is the chicken with dry chili. It has good high BTU wok technique. Next time, we will order the broil fish with bean sprouts. \n\nI can say the restaurant is 4.5 stars. Items can improve is provide the menu to read instead scan bar code and find the menu in the phone. I rather have real menu. They are still on try out. The speed of the food delivery to the table may need to be faster.",
    "date": "2020-07-30 23:17:09"
  },
  {
    "review_id": "yh1QY6di6T8rdJeSKrHI2Q",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "CtMEJxpVMlNzFpB4PtFjfA",
    "stars": 5.0,
    "useful": 22,
    "funny": 7,
    "cool": 21,
    "text": "For fast food, this is a good model. In term of food, kitchen, and customer relations. This criteria was use to rate their quality and value. They are about 4.5 stars to my experience. It is good fast food model. I have been to their sister restaurant in the mall, and now the independent building, it is a lot better setting compared to the mall. \n\nFood- I think they have good high end food with medium price. The choices also better than other location. Food is tasty. We got the shrimp poboy. Good number of shrimp. One thing surprised me is their fried chicken strips have very good coating. \nKitchen- it bigger kitchen than mall food court. Output of the food was in good rate. Food come out quick. Chef also better. Please keep up the good work. \nCustomer relations- the have good service. Very friendly from order to food delivery to table and check on customer need. \n\nOne thing strikes me is they have a hand wash station. I like that feature if you need to wash your hand without going to the restroom. It is convenient. They host movies night on the lawn for family which is a plus.",
    "date": "2020-12-14 17:03:53"
  },
  {
    "review_id": "f39VZozxYZw_9hhZTawYTA",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "J9NNalwKpdErVaKSqm9BmQ",
    "stars": 5.0,
    "useful": 8,
    "funny": 5,
    "cool": 7,
    "text": "Rare Ethic Food No. 17\n\nI have come to here often because they have oriental bakery. Oriental bakery is different than French or American bakery. Material and ingredients is a lot different. The sweetness is really tone down compared to Latin bakery. \n\nFortune Star is famous fruit sponge cake. It is definitely different than traditional sponge cake. It is fluffy and very lightly sweet. In between the cake layer is the fruit filling. Cool whip topping with very nice and beautiful design. The basic 10\" sponge cake is $25. Need minimum one day before order. Average they make 20 cake a day. So call early to order. The different filling such taro filling is extra. \n\nOther than their famous cake. They sell cut off pieces if you like to try. The also have Chinese bake bun. They include BBQ pork bun, curry bun, egg custard bun. Other than the bun, they have wife bean cake, sun cake and red bean cake. Go check them out.",
    "date": "2016-11-10 01:51:25"
  },
  {
    "review_id": "zHllDgGMu9o2ly-AAJAQ-A",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "urp71wTOT5uVuw0RsJE3MA",
    "stars": 5.0,
    "useful": 6,
    "funny": 1,
    "cool": 5,
    "text": "Rare Authentic Food No. 23\n\nI Ai Sushi is authentic Japanese street food. Of course the sushi is available. But there are other dish available. Since this is mom and pop shop. The owners are the waitress. I saw some reviews in the past. I think they have changed their system a lot since then. \n\nBefore it they have menu in Japanese and customers take a lot of time try to understand what they eat. Now they just have pictures at the entrance and you order and paid at the entrance. Easier and cut down the time try to explain and make the process slow. \n\nWe have order the Ramen and grilled squid. The squid was slice after grilled and go with their home made sauce. The ramen is close to what we have eat in Japan. As a result we like their authenticity.",
    "date": "2017-01-28 14:31:35"
  },
  {
    "review_id": "gRXsuJkS3dp5EOsQhm00sA",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "HuawlT4tXzCXL8ftyvCZ0Q",
    "stars": 5.0,
    "useful": 5,
    "funny": 5,
    "cool": 6,
    "text": "Top Golf is top of the world at third level bay. It is gorgeous beautiful golf outing. Thanks to yelp friends invite, we have experienced firsthand 3D golf with games system. This is one of the golf courses you can know about your driving golf ball distance. \n\nIt doesn't matter it rain or shine, this place can handle both conditions. We were there when Tampa has been rain for a week. I actually like to play when it rain in summer time. Summer in Tampa for outdoor is brutal even with the sun down. Rain actually cools it down for this cover open air activities. \n\nWe like the food there with bite can be share with many people. We have steak flat bread, Mushi, and buffalo chicken slider. The Mushi is chicken roll in jalapeño tortilla. They have many pieces to share. I would consider they have many selection of the party food. \n\nMy friend shows me the games system of the golf. I am just a recreation golfer may be golf 1 time every three years. You will know I am not the skill golfer. My friend indicate to me that is better for me since I am not the serious golfer and I will enjoy more in Top Golf games. Serious golfers loose the fun of this place since they ask for their perfection of their skill. \n\nThey also have games indoor with pool table, games console with motion and more. The games are free inside.  However, the price of golf is double after 6 pm.",
    "date": "2015-08-02 12:55:10"
  },
  {
    "review_id": "DthV_MYgkFXnEt-_J-58FQ",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "wbwDE3g8j4w-TGy_E6dMSw",
    "stars": 5.0,
    "useful": 5,
    "funny": 4,
    "cool": 4,
    "text": "I like to thank Nick S. for the notice to this restaurant. It located at Temple Terrace northwest corner of Whiteway Drive and 56 street the Temple Terrace Village Plaza. This is Peruvian restaurant. The restaurant owner are Elizabeth and her husband. Her husband is the cook. The restaurant just started December 26 2014. Elizabeth is from Columbia and her husband is from Peru. Peruvian grilled meat is very tasty. \n\nThe lunch and dinner menu seem like the same. We have order the Falda and Lomo de Cerdo - grilled skirt steak and grilled pork chop tenderloin. The Falda is equivalent to Churrasco in Argentine dish. The meat should be at the low section of cow a long flat cut of skirt steak from the \"plate\" of the cow. The skirt steak is actually diaphragm muscle of the cow but in low section. Some one may serve you the skirt steak on the upper section which not as good as the low section. This restaurant also serve the upper section skirt steak dish call Vacio. Which is internal flank plate. Today the Falda came with the home made chimichurri sauce. You also allow to select one side. I have select the sweet plantain. All dish came with salad in the plate. To eat Falda, cut along the meat to the direction of the meat grain with small strip. You will enjoy more with cut since the Falda come in strip against the meat grain. I can finally said I found a reasonable price churrasco that comparable to Cuban churrasco that serve in Miami ($18.95) at Tampa. My wife dish is the grill pork chop. Seem like the preparation is first fried then grilled. The pork chop is marinate with rosemary, salt and pepper. This chop is good since they are sealing meat juice when they prepare it. \n\nOverall the restaurant is not busy and you get the service from the owner. A few thing they may be able to improve is have the lunch menu price that can attract more customer. Adding the pre-meal item such as bread or soup. The decoration of the restaurant display the mozaic of the local Peruvian art and painting. The restaurant back door is open to ventilating the food smell. So pick the seat close to the front to avoid food smoke.",
    "date": "2015-01-09 18:39:59"
  },
  {
    "review_id": "Xxt8Bvydxo9WW9NFsabOEw",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "z_7TZeTXsDH6MmkPHQN8nQ",
    "stars": 5.0,
    "useful": 1,
    "funny": 0,
    "cool": 2,
    "text": "Interesting setting of the restaurant that show the picture of musician. They have live music on Thursday, Friday and Sunday. We were very lucky that we have a seat immediately. We were here when Genghis Flan playing here. Parking is challenge since the restaurant have a lot of traffic. If you come after 7:00 pm, you can park at the value pawn shop after they close. \n\nTonight dinner we have begin with crab stuffed butternut squash. Butternut squash is a very difficult cooking material to be use, however, the chef did a very good job to prepare it with crab meat and citrus hollandaise source. The squash filled with crab meat area is extremely soft and sweet to eat. \n\nOur main course is chicken mole and beef tenderloin. The chicken is very juicy in curry source top over comb read arepa. Who can think about the combination of the dish. It is getting better with the preparation on the beef tenderloin. The dish come with 2 pieces of 4 oz tenderloin in port wine source. It grilled to perfect with beef juice seal inside. This dish also come with bacon wrap asparagus. Bacon is good with any food but who can think the combination of crispy bacon wrap with bacon juice drip into the asparagus. It also come with mash potato cake. The mash is well season and the top is bake to crispy. \n\nI am usually not given out 5 star. The cooking and the mixture of the material and taste is well balance. The food give me a wow and unique factor.",
    "date": "2014-10-19 02:01:25"
  },
  {
    "review_id": "Iy_OWoqgK1n6Eu7ZWpXS9g",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "DbARcEuX6NvWN_hSQKHMJg",
    "stars": 5.0,
    "useful": 10,
    "funny": 5,
    "cool": 10,
    "text": "Cool temple. Very colorful. I remember when I was at the Chiangmai, the Buddha is plated with actual sheet of gold paper. I wonder they do it here. \n\nWe were here many time for the Sunday morning Thai market and eateries. I like this place because it serve my home country neighbor country food. It is very similar to my country. The food here very similar to the vendors of Friday night market in my home country. Only different is you have to wait on line to order. \n\nAlways come here with two people or more. You need to divide and conquer. The noodle line is long. Here one person in line while the other person go to buy other food. Always put your name down on the coconut ball and it will be ready before you leave the market. Once you got some of the food, feed the person in line for noodle then go get the drink for Thai tea, longan drink or coconut drink. Once got the drink go back to the noodle line to help the bowl of soup noodle. This is always our strategy for this market.  \n\nThe soup noodle is the best. It is very light food. They have thin, medium or widest noodle size to chose. You can chose beef or pork base noodle. \n\nI also like their dessert. Many to chose from. Grill chicken, steak or pork stick is grilled on the spot. The also have wok cook food like the curry, pad Thai and more. \n\nThe best time is November to December and March to May. When it is not too hot. The weather is pleasant. At special event, they perform the Thai traditional dance.",
    "date": "2015-11-24 22:07:44"
  },
  {
    "review_id": "Vh40jhvXEW6-MJqvxwm7CQ",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "JOU22FJLIZNsYRymOMnfkg",
    "stars": 5.0,
    "useful": 10,
    "funny": 3,
    "cool": 10,
    "text": "My first visit is about 4 stars but my second visit is 5 stars. This make this restaurant is about 4.5 stars. The first visit with spicy tuna and salmon is grind meat. I really not a fan of it. I like many choices of the ingredients to be add on. Only a few need additional money. Which is I can skip. \n\nMy last visit is the restaurant did give me freedom to separate the rice from the ingredients and sauce. Allow me just to mixed the ingredients only. I also like just select the Ahi tuna and salmon without add into premixed spiciness. This is much better quality because the tuna is dice close to a inch cube. Big size for mixed your on poke. I give them an A in this matter. By separating the ingredients from rice make this mixed more flavorful. Now I can combine many sauces with the raw fish and ingredients. Some of the ingredients included crab salad, corn, mango, red cabbage, cucumber, edamame, masago and more. These are the ingredients included part of the bowl price. \n\nI would love to have the sweet eel sauce, ponzu sauce and poke sauce to add together. This is my favorite mixed sauce. At the end you add the fried onion and fried garlic to add the crunchy and extra taste. \n\nOverall experience is great. We have party of eight and enjoy our moments of poke. This place also has hibachi and sushi burrito.",
    "date": "2018-02-04 05:11:36"
  },
  {
    "review_id": "4IVP8A7ActHQ43x8gI0WAw",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "HgPTy_OGoaxllb2EXkC1sQ",
    "stars": 5.0,
    "useful": 6,
    "funny": 4,
    "cool": 6,
    "text": "This is interesting Peruvian restaurant. They serve a special dish of the beef heart. It is a delicacy item that slice into pieces and grilled. Ana M is kind to let me try this dish. Be brave and order this appetizer. It tastes like regular beef meat. Thank to Steve to organize the UYE Latin Crawler to get to know this restaurant the first time. \n\nThe ambient is nice and the restaurant is pack with people during lunch time. We have the free sample on the appetizer with potato or fried yucca in cream cheese sauce. I like the yucca with cream cheese. \n\nMy entree is fried fish top with shrimp, mussel, and squid in fish broth. The restaurant did a good job on the on the fish broth. If you use the can fish broth, you need to be careful on the saltiness in the mix. This restaurant is balance their broth with a good technique not to overpower the taste and maintain light level of salty. The squid is well prepared with the softness of the texture. The shrimp count may be in the range of 10 to 15 counts a pound which means larger shrimp. When the restaurant prepares seafood you are looking for the fresh material. The seafood is really fresh and keeps in the quality. \n\nThis is a restaurant serve a lot ceviche, Peruvian stir fried or deep fried. I would said they are definite are very good on this end. I have not tried their grilled meat dish and that is yet to come. Service is a bit headache since we have a group of 30. They may be able to improve at in this end when they facing busy condition.",
    "date": "2015-02-22 22:23:47"
  },
  {
    "review_id": "Z-RE4SkUaz59Hn3qGUWAkw",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "rzA1L0RoV-qUKLTSvo5Skw",
    "stars": 5.0,
    "useful": 17,
    "funny": 4,
    "cool": 14,
    "text": "It is about 4.5 stars. Not yet truly 5 stars. It is one of the best BBQ in Bay Area. This food truck hold it place of many BBQ I had. It has very interesting side order. The selection is very special. \n\nThe order I got is a three meats combo. This dinner come with sides. The two we have is the blue crab yellow rice with shrimp and collard green. Other side that in menu choices are truffles Mac n Cheese, Yukon potatoes, baked bean, smoked candies yum, dirty yellow rice. All the choices is great selection. The three meats are the smoke rib, pull pork, and corn beef brisket. The corn beef brisket is moist and tender. \n\nThe food truck is popular, many customers. It is popular place for the local.",
    "date": "2020-08-09 22:50:58"
  },
  {
    "review_id": "_csTQx33aLGd32UWqDl4Xg",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "9cu2p2Z925hHkWHVyrp1JQ",
    "stars": 5.0,
    "useful": 16,
    "funny": 5,
    "cool": 17,
    "text": "Rare Ethnic Food 4 - Malaysian Cuisine. \n\nFinally we have some restaurant actually represent my country well in Tampa. There are three claiming Malaysian restaurants in Bay Area. This one may be the best representing. Although the restaurant introduce a lot of pan Asia food, but predominantly is Malaysian street food. The Chinese has immigrated to Malaysia long time ago. A mix marriage with local Malay people and create a generation call Nyonya. This people combine the Chinese cuisine and Malay cuisine and ultimately have this mix cultural food. \n\nLaksa is one of the good example. This spicy soup base rice noodle dish is created of the combination of the Chinese rice noodle in the use of Malay lemon grass material. The Prawn Mee is another example. The soup base is spicy Malay spice from shrimp shell and head. The noodle, pork, slice of shrimp are Chinese touch. \n\nChar Kway Teow is stir fry flat rice noodle. In Malaysia you can ask them to add the sambal - spicy shrimp paste in the noodle. It make more interesting. Have you try the Roti Canai. In Malaysia, this item is a hand craft. The chef actually has to stretch this dough to thin piece and pan fried on the hot plate grill. In Malaysia you can ask them to add egg, goat meat, onion. Can you feel the gulai (Malay for curry) of the Roti is different then any curry. It is different from Indian or Thai curry. The spice for Malaysian curry is sophisticate because they use wet curry powder. \n\nI would encourage you step out from your comfort zone to try this Malaysian dish including the mee goreng, Hokkkien mee. Unfortunately the satay here is still not close enough per Malaysian standard. I was able to give them 5 stars is to make sure the Orlando kitchen crews have left and they can stand their own ground to support this store. They did not disappoint me. They are quite good. Food came out in amazing speed.",
    "date": "2016-04-17 00:21:03"
  },
  {
    "review_id": "LyKodvQyxj0vlgpiQw0Bmg",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "FBr-VFAumJUoZs9LIaxhVQ",
    "stars": 5.0,
    "useful": 14,
    "funny": 5,
    "cool": 18,
    "text": "This is food truck turn restaurant. I am applauded for their success transformation. They have a big menu for selection. The restaurant has big table shareable. The order is at the counter and bring to your table. \n\nThe menu selection includes classic sushi roll, sushi and sashimi, special sushi roll, and appetizers. This is our second stop, so we only go for the appetizers. We got the Flaming Escolar and the Baked Green Mussels. The flaming escolar is torch with open flame and top with avocado. I like burn taste of the escolar. The sauce is excellent to go with it. The baked green mussels is chop and mixed with imitation crab meat. It is delicious after the baked. I like to pick up the small pieces and eat it slowly. \n\nThe price is not cheap for the appetizers. But the experience rewards the outcome. I would said about 4.5 stars. Their sushi doesn't need any wasabi or soy sauce. It is already prepared to your likeness.",
    "date": "2018-12-10 23:57:59"
  },
  {
    "review_id": "P7YMwiAR0Bpk5jxbFRbMYQ",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "RqqCs9epqlZYAWEMXXuWtA",
    "stars": 5.0,
    "useful": 5,
    "funny": 4,
    "cool": 10,
    "text": "Yelping #1200\n\nOne word Excellent-Chef. You can't said two words. But food that good you said in one word. \n\nLure was in my target for some time. One of my non Yelp friend told me about this place. Plus when you have priority list of the restaurant in you book mark with added distance to travel here, we take me 7 month to hit this book mark. But no regrets and I will return. Blame on Todd and Melissa hidden this place very well :) Can believe I bum to them while I visit. \n\nNow about the restaurant. I like the concept of tapas and open garage. The tapas is very close to small plate. For two people 3 dish is enough but it does not stop you to order more. Instead of spending money for two dish at most restaurant, here you can try one more dish. I also like the open garage drink area with pool table. It make this place lively. \n\nThe skill of the chef. We have order the Miller, Kevin and Destin. We started with The Kevin with Blacken Redfish. The fish was handle well. Most chef either charcoal or not blacken enough. This chef make it just right. Blacken spice burn but not charcoal. The accompanying black-eyes pea and grit is good match. The Destin mixer of seared fillet tip, spice shrimp and sausage (soppressata) make this dish over the top. The many step preparation make this dish great to taste and put in the creamy pasta. My favorite is the miller. You can kill for this dish. The duck breast was marinated and blacken. A good duck breast need to cook roughly at medium rare to medium. The reason is medium rare is too chewy and the medium is to well done. This one just right. It has meaty bite but not chewy. Good technique. I am not going elaborate the accompanying side. Go find out yourself. \n\nService is good. Love the atmosphere and food. Can't wait to return.",
    "date": "2017-05-29 01:55:45"
  },
  {
    "review_id": "A7n8g6wn-8Xe5X-oyxbvCg",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "YaOdVL6-xE-pYwv3z9rWQQ",
    "stars": 5.0,
    "useful": 14,
    "funny": 5,
    "cool": 14,
    "text": "Rare Ethnic Food #34\n\nThis Mediterranean Cuisine but specialty on Syrian food. Syrian Cuisine is a bit different than Lebanese. They are similarity but alway minor differences. The Syrian has more heavy spice that I like. It actually marinated into the meat. \n\nThe special item we had is not the so call \"Babaghanoush\", it call Mtable. It is grilled eggplant, tahini sauce, yogurt and garlic. It drizzle with olive oil. I love this dish. We have the mixed grill with Shish Tawook (chicken cube), Shish Kefta (grilled ground beef) and Shish Kabab ( Beef or Lamb cube) I like the marinated, it went deep into the meat. They have the best chicken cube in town. We also have the grilled fish sandwich which is less than $6. Great value. Fish fillet is big. Love it. \n\nThis restaurant own by husband and wife. Please give them a visit, you will like it.",
    "date": "2017-08-16 03:28:41"
  },
  {
    "review_id": "NSoDX5ygBO2EXYDHanhmFg",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "gjHB6p19V_bS-R5lUZux4A",
    "stars": 5.0,
    "useful": 8,
    "funny": 2,
    "cool": 5,
    "text": "Mother of all food truck. The best ever. The owner is smart to create the good Hawaiian cuisine selection. I concur they deserve to be Yelp top 100 list. I will vote for them again for next year. \n\nI have seen many of friend great review on this food truck. I finally located them and paid them a visit. My favorite is the huli huli chicken. The chicken is well marinated and grilled perfectly. I like their side with ginger slaw, Mac slaw, kimchi rice, and coconut rice. All in good flavor. \n\nI learn that you can call ahead for your order and pick it up. The food truck in rotation everyday. Please check their face book page for location. I also order the mix plate and the short rib. The food are excellent. If you have not paid them a visit, you are missing it out.",
    "date": "2016-03-19 02:07:53"
  },
  {
    "review_id": "EHH85v7B8Fh_aGECvpL3oQ",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "rbazT4HNABCj_CeEG7IpNw",
    "stars": 5.0,
    "useful": 13,
    "funny": 1,
    "cool": 12,
    "text": "4.5 stars in my book. Not yet fully 5 stars. This Italian restaurant is frequently visit by movie stars who is Italian descendants. This tell their Italian food is close to Italian taste. It almost can said \"it is like my mom cooking\". For for Asian like me I cannot tell what is truly Italian food. I only can judge what is good on the table. \n\nWe order the Fratelli Special pizza. It has pepperoni, sausage, meatball, mushroom, onion and black olives. We got the  12\" pizza. The pizza was delicious and the ingredients is nice not like typical pizza. We also got the garlic knots. It is dry at the bottom with good garlic and cheese sprinkled all over. We also got the  finger food an old bay wings. The owner was nice enough to give us extra three wings to make up the size is too small. \n\nIf you have budget, or just one a slice of pizza ( they by slice too), or good Italian food. You may found your choice.",
    "date": "2020-01-25 12:45:53"
  },
  {
    "review_id": "Ey77X0vvNLIbyR4f51YrjQ",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "h0tUOsL3sRYVqSQlxWjW5g",
    "stars": 5.0,
    "useful": 14,
    "funny": 3,
    "cool": 8,
    "text": "Just to open this review. This is a 4.5 stars Indian restaurant. It has good use of spice, good enough spiciness, good enough meat dish, great choice of dishes. Since there is no 1/2 stars, I given them five stars. \n\nIt is good to see somethings different along the Bruce B Down. This restaurant come in to replace typical restaurants along this street. Price is reasonable on the lunch buffet. The food is fresh and cook very well. We have the goat curry. They do not have heavy goat smell which is perfect. The chicken masala is good curry to go with rice or the nan. Their nan is not at the buffet tray which is I agree, they bring fresh from their kitchen which is a smart move. Somethings different from the other Indian food buffet is they provide the dosa to the table. It is good. \n\nService is good and attentive. So far not many people know about it yet. But the crowd is coming soon.",
    "date": "2016-07-22 20:07:50"
  },
  {
    "review_id": "MAS3hqmgrxC8OwNJv-G9Ag",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "F-c7uFx2dsncXXJrgMXKyw",
    "stars": 5.0,
    "useful": 16,
    "funny": 2,
    "cool": 18,
    "text": "About 4.5 stars. Not yet true 5stars. Love the smiling face of store owner. The waitress may need some training. Our order was corrected by the owner of the restaurant while the waitress took the inconsistent order. This is local popular place to be. Many come here to dine in. If not the take out is a lot and busy. \n\nWe started with yellow tail roll. It is simple and good. The best is the special of the day. They have high grade yellow and salmon crudo. The dish have 4 slice of yellowtail and 4 slice of salmon. It top with different masago and bed with seaweed salad. It was delicious. \n\nWe also has the tempura udon. The tempura was big by it own with fried shrimp. The udon also good. The food experience win us there. I would suggest look for the special at the wall. That will be your best choice.",
    "date": "2020-10-07 19:21:28"
  },
  {
    "review_id": "s3VwS1EOxygZPZ_zF6vXJQ",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "aAjOFpX5SBSoDkAsBSZeZw",
    "stars": 5.0,
    "useful": 27,
    "funny": 1,
    "cool": 23,
    "text": "This restaurant was open just before the stay home order during pandemic. I was thinking very much to visit and finally they open for take out. We need to support our local business during this time. Especially good food. Michi is the first ramen near my area (new Tampa). \n\nWe got the miso and Tonkutsu black garlic ramen. You can have two other choices such as regular or spicy oil and paste. The soup base is great. The porch egg is well prepared. The charshu pork are thick enough and well braise. \n\nWe also got the pork bun and ikamaru grilled squid. The charshu pork bun is a bit pricy. Bun is good not the best in Tampa bay but close enough. The ikamaru probably is the best I have. The squid is a bit small in compare to many place. \n\nThis is about 4.25 stars in my book. But I like to support our local ramen and I round up to 5 stars.",
    "date": "2020-05-17 13:20:20"
  },
  {
    "review_id": "NX1ao_i68EBceYiNLzBWfA",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "RqqCs9epqlZYAWEMXXuWtA",
    "stars": 5.0,
    "useful": 4,
    "funny": 3,
    "cool": 4,
    "text": "Mistaken update. See first review",
    "date": "2017-05-31 12:15:54"
  },
  {
    "review_id": "DkED3MScrGd2ey3_zQWZ8w",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "PXDLSN8Fg-YQmwGprVrRyA",
    "stars": 5.0,
    "useful": 13,
    "funny": 2,
    "cool": 12,
    "text": "It's about 4.5 stars restaurant. This restaurant located in Community cannel dock. All seat is outdoor. The restaurant allow dog to accompany their owner in the restaurant. This convenience attract a lot of dog owner bring your dog to the restaurant. It is dog friendly restaurant.\n\nWe brought our dog and my family to enjoy the view and food. Since the restaurant is very close to the water, they has a fresh seafood that you can choose. We got the blackened grouper, fried oyster, burger, and fish taco. They did the blacken very well with the flavor that I like. The coating of the fried oysters was very nice. The oysters are also  bigger size compared to many oyster we have eaten. \n\nThe restaurant provide a bowl of water for the dog. The only thing that they can improve on is to make the shade and umbrella a little bigger.",
    "date": "2022-01-16 12:14:05"
  },
  {
    "review_id": "NqdZ5WD0ILy2kxMnOUJwHw",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "wbwDE3g8j4w-TGy_E6dMSw",
    "stars": 5.0,
    "useful": 8,
    "funny": 3,
    "cool": 5,
    "text": "I have revisited this restaurant 4 times. I have decided to give the update. This definitely the Peruvian restaurant that is expert with grilled meat. The dishes I like are the Falda, Picanha, Lomo de Cerdo. Several people of my friend have tried their ribs and they like it. \n\nIf you come with a group of three, you can order the mix grill platter to share and you will have a chance for each type of meat. The Picanha is a bit salty but the marinated spice is well done into the meat. The best dish is still the Falda. \n\nThey have the lunch special now use 10 to 12 dollars. I like the full portion better. \n\nThe Chicha Morada is improving from my previous visit. The trick is telling them not to put too much ice in the cup before they pour it. The taste will be more Peruvian bean taste when they did that.",
    "date": "2015-04-25 12:27:13"
  },
  {
    "review_id": "6SVG8R4-GYNTpiY3bZDgKg",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "ySn36gFeTJ0fR8CG-Q2DuA",
    "stars": 5.0,
    "useful": 11,
    "funny": 3,
    "cool": 8,
    "text": "Movie night at the citrus park mall. It close at 2 am in the morning. It offer late night snack and beer. They all day beer special and after 10 pm special. At certain day they have all you can eat wings or tacos. \n\nThe night we have visit they have combo special 2 people for $30. Very good deal. In the combo plater, it has 5 types of grilled meat. Pork rib, petite sirloin, smoke wings, grilled chicken breast and sausage. It also come with grilled onion and wedge potatoes. This item serves over the fire grill that keep the food warm. The grille has center plate to heat up the food. I like this way because many BBQ place has combo. At the of combo, the remaining food get cold. However, the device they have in this restaurant keep warm and heat up in the middle of grill. \n\nI would give them 5 stars for the food taste, keep warm on the combo, good service, nice open dinning hall, great price on the alcohol. I got 22oz Miller lite for $5.5.",
    "date": "2018-02-25 21:05:35"
  },
  {
    "review_id": "X7fskGlfhqDY-3rpNABGmw",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "6_Gsn1ZxSosWb6mZusap0Q",
    "stars": 5.0,
    "useful": 16,
    "funny": 5,
    "cool": 12,
    "text": "Yelping 1700. Rare Specialty Food no. 44. \n\nSweet Soul is new and coming special dessert shop that have variety of great item to offer in South Tampa. I am glad that make good use of that space. Have you heard about bee pollen, goji berry, hemp seed. This is the healthy food that serve in food conscious store. \n\nThey have ACAI bowl, frozen yogurt. We were here for the frozen yogurt. Before we come, our friend already recommended this place. I am joining their train to recommend other to try their food. Their yogurt flavor is interesting. They have charcoal vanilla, chocolate, and some time mocha. I was never try charcoal vanilla. It is black color in very good way. I would recommend to go for the bowl instead of cup. Because the give 2 bases, 3 toppings, and one dusting. \n\nGuess what we have charcoal vanilla and. Chocolate swirl. The base is raspberry and dragon fruit. The toppings is bee pollen, ginger sugar, and mocha cookie. The dusting is agave sweet syrup. This combination is exquisite. The moment you taste it, you love it immediately.",
    "date": "2018-06-24 18:29:33"
  },
  {
    "review_id": "hOwUw1fz3aB4ZhgqCetGTw",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "RewAum_fQ0lXdFoUX18J0g",
    "stars": 5.0,
    "useful": 17,
    "funny": 4,
    "cool": 13,
    "text": "It is 4.5 stars. Not yet 5 stars. Mel has a good BBQ and they they located at good spot not too far from the I-275. A lot people here for the ribs and turkey leg. The selection is not much but it does enough for the menu. The main reason they are good rating is they are generous on the meat quantity. \n\nThe meat selections are Rib, chicken, thin end, turkey leg, brisket, sausage and pull pork. We got the three meat combo. Although their price is the most expensive in along the I-275, but they make up the quantity of the meat. I got the brisket, sausage and rib. I think their rib is the best. I also like their brisket with good marinated BBQ sauce. I saw some one order the turkey leg sandwich, it was looking good. They will chop up the rib to bite size for easy handling. \n\nOverall my experience with them is great. Sometimes you need to wait for the meat because it is still in the smoker.",
    "date": "2020-08-18 19:09:46"
  },
  {
    "review_id": "WzIlBjx0hcVM_2XMKSYyxA",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "r6dvcGaTEcvN4nUIeS15nA",
    "stars": 5.0,
    "useful": 6,
    "funny": 4,
    "cool": 3,
    "text": "What's up Tampa Bay. Do you know there is new kid in the block that serve endless sushi. It has all the vibe to attract young and old. Definitely good for hungry teenager. \n\nThis new sushi place has different signature rolls that are very good in my book. I would said this sushi place is the best in Tampa now for endless sushi. I can tell you there are several favorite sushi in my list. The Hawaiian roll is unique and gooooood. The salmon skin roll made the mouth watering. The spicy \"white\" tuna hand roll is definitely a try item. Don't forget BBQ Salmon hand roll. It is tasty. \n\nThe interior designer design has automated color changing lights. They are beautiful to look at. You have a choice sit on the sushi bar or regular alcohol bar. These bars have fancy lighting system. The service is good. No slow down period.",
    "date": "2016-03-04 21:03:20"
  },
  {
    "review_id": "5KGZqVwU8k4qYCHOH0BPtQ",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "sPy8XUOJ0ax5Zh2yEsl4cA",
    "stars": 5.0,
    "useful": 6,
    "funny": 5,
    "cool": 7,
    "text": "#500 Review\n\nI have been saving this review for some time. I chose Nico's Arepas Grill not just for the good food. It has successful Cinderella story that many small businesses can learn about it. \n\nMany yelper know about them for the food truck they have operated. The Arepa that they have served using the imported Venezuela cheese. This cheese is almost like mozzarella cheese. When it melt, you can pull like small string. Thousands yard long. May be not. May be you can make it to Guinness record by single pull cheese string. Good Luck:)\n\nThis is a small guy that make it to the big stage. Now they open the restaurant to serve this food. It is truest Cinderella story make it to the big stage. What make them successful is the first impact that make the customer want to comeback after one visit. The success reason are:\n1. Nice restaurant interior design to attract young and old crowd\n2. Great service that make you feel welcome\n3. Vibrant atmosphere created by the people who work there feel the Latino warm feeling \n4. Good food for the reason to come back \n\nThis was our second stop of restaurant night and we have ordered the Nico Sampler and Sopa de Res. In the sampler, every items are great especially the cachapas. The cachapas is made from sweet corn and they are good. The Sopa de Res is the beef soup and it is very good too. They told me the weekend special is their tripe soup and it usually sold out in the morning. \n\nOur waiter Rafael make our trip special and welcome. I am glad they hire the good personality and vibrant waiter. If you feel hungry at night when all restaurants have closed, they are the few open restaurant in the Bay Area. They open till 4 am in the week end. Go checkout and give them a shout if you like.",
    "date": "2015-12-04 04:20:00"
  },
  {
    "review_id": "P3eNJZTDHD68IvggzP8zpQ",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "R8CIWGd0SADUQI0X_bydFg",
    "stars": 5.0,
    "useful": 11,
    "funny": 5,
    "cool": 6,
    "text": "Rare Ethnic food 2 - African cuisine. If you heard about fufu, this place serve this items. It is a starch items that can be commonly found I Africa. This material is pound into flour. The texture is like dough. Very healthy. \n\nThe first course we have is the coconut rice with assorted meat. We have the goat, beef and chicken. The meat is cooked in similar to curry paste but is not curry. The meat was cook for a long time and they separated from the bone. Good dish to have. \n\nOur second course is the Egusi Soup. It is a mix of ingredient that I not even know. But it is go well with the fufu. It also has a selection of meat of your choice. \n\nWe added puff-puff and moin-moin. Puff- puffins a unique fried dough. Very puffy. The moin- moin is the puréed bean. It is lightly glaze on the outside.\n\nWhat a experience. This is a 4.5 stars restaurant. Since my wife gave 4 stars, I can give 5 stars to make it 4.5 stars.",
    "date": "2016-04-16 04:17:59"
  },
  {
    "review_id": "0g65SKaBSeXVdje0Ox6UlQ",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "uwVsjotoIE21G78LKwLXDA",
    "stars": 5.0,
    "useful": 19,
    "funny": 3,
    "cool": 15,
    "text": "Definitely good fast food restaurant. In compare to many fast food, this restaurant is may be top of the list. Right their bowl is my top of the list for bowl under $10 list. I glad someone do it right. I hope they still keep the quality and quantity after one year. Then they are truly 5 stars. \n\nIt is order on tablet at the entrance. You can add meat if you like. We got the pesto pasta with grilled chicken. It grilled and chop chicken. The pesto sauce is good and high class restaurant quality. We also got the forza bowl. It is power bowl has a lot of grain. We got the manzo. Most importantly is the cube steak. Medium well steak cook very well. The grain included roast corn, garbanzo, farro, veggies and more. I definitely recommend this bowl. Best value and best taste. \n\nThe appetizers is Nutella Piatto. Is thin crush Nutella quesadilla. It is delicious. We like the crispy and the good test. Not much of service. Order is by tablet then they notified you with text message to your cell to be pickup at the counter. There is a curb side pickup.",
    "date": "2020-07-12 06:15:09"
  },
  {
    "review_id": "HE5vggRQyxY0wiskdbp7_A",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "GwfLqn_jOeYMvmgcL4om1w",
    "stars": 5.0,
    "useful": 10,
    "funny": 2,
    "cool": 6,
    "text": "This is a truly five star restaurant. They deserve to be Yelp top 100 list. I think they should be top10. The restaurant is small. If you come in weekend, please reserve before you go. We were doing the spontaneous restaurant hopping. We were lucky to have the last two seats of the restaurant. \n\nWhen you walk into the restaurant, you will feel the festival atmosphere of Octoberfest.  The accordion music make it nice and pleasant. He play the familiar tune. I wish the whole restaurant can hold hand like we are in Munich and sing along with the beer on one side. The waitress is very beautiful and very nice. Love the super service here. They are from Munich. \n\nThis restaurant serves the Bavarian region food of Germany and very similar to the food that we have visit in Black Forrest of Germany.  We have the Veal Schnitzel with mushroom sauce. It is delicious!!!! It come with two side. We have the handmade noodle Spaetzle and the hot potato salad. The potato salad has some ham crump to go with it. Hmmmmmm. Are you hungry now? Go enjoy a dish a meal here. I also have the import beer - Paulaner Octoberfest. It is good beer.",
    "date": "2015-10-11 12:32:46"
  },
  {
    "review_id": "Z2o0PTfg312_-LdfiV431w",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "xh7mQ46QUMswpugKJFmppQ",
    "stars": 5.0,
    "useful": 21,
    "funny": 5,
    "cool": 17,
    "text": "I am glad that a just newly opened restaurant reopen for the take out. This restaurant open just before the pandemic. During the pandemic, I was not able to call them for they are open for take out because they not able to reach through the phone. Until recently they announced in Yelp they open for take out. \n\nAlthough we could not try their in store BBQ on the Korean BBQ, but one day we will be there. In the mean time, we appreciate they proceed with take out menu for us to try their food. We got the bulgogi and galbi plate. This dish come with white rice and four side dish. I like Korean side dish such as the tasty beans sprouts and the Korean fish cake. \n\nThe Galbi has great marinated sauce. Well grilled, good meat quality, good enough quantity. The food is good for me to",
    "date": "2020-05-04 03:15:47"
  },
  {
    "review_id": "ZgRGG0QCVUMNATvZsjdTmQ",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "2Lxh3hkp_7j8-OEFDV6nVg",
    "stars": 5.0,
    "useful": 11,
    "funny": 3,
    "cool": 13,
    "text": "It is a 5 stars performance. Price, taste, quantity, and quality is reach it perfect condition. I would recommend this restaurant to a friend. Thanks to Brigitte's review and notice this restaurant six months ago. Finally we have a chance to visit. Love it. \n\nI got a fruit juice in water. It was delicious to start. Today they have tripe soup with beef. It is cook till everything is soft. The spice was marinated into the tripe. Our main dish is Breaded steak with rice and fried cassava. The breaded coating has some seasoning spice. It the best Colombian breaded steak I have. It is big piece. \n\nOur next dish is Bandeja di Mi Tierra. It has skirt steak, chicharron, chorizo, sweet plantain, creole potatoes. This is big combination dish. It has great churrasco. The the steak is well seasoning. The chicharron is very crispy and is not tough to bite. I like this dish have a lot to offer. \n\nServer are very friendly. They also serve breakfast.",
    "date": "2019-08-10 12:37:07"
  },
  {
    "review_id": "rndYMpUBGn5rVauXBK36cw",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "yui1n1JawiW9g7RR62a_wA",
    "stars": 5.0,
    "useful": 23,
    "funny": 6,
    "cool": 20,
    "text": "We know about this Japanese restaurant for long time. We did not make it there until now. I have seen friend celebrate her birthday there. Now I know why she choose this place. \n\nThis restaurant seem like mom and pop shop and may be a generation restaurant. We were here for lunch. We start with 3 rolls combo sushi lunch special. This dish has volcano roll, California roll, and fried fish roll. All pieces is delicious. It come with great ginger salad. I like the ginger dressing. The second dish is the Tempura udon. The udon and Tempura are separated. Each one can be a meal by its own. The Tempura has the shrimp and fried veggies. The udon has a bit fried bit root in the soup. Make it good dipping sauce for the Tempura. This is my first order combination Tempura and udon in single one dish. Love it. \n\nOverall they are 4.5 stars in my book. Good service. Finish lunch less than 40 minutes. It is make for office hour limit.",
    "date": "2019-05-17 01:44:08"
  },
  {
    "review_id": "GszK5iFddKsZI1izqFHaiw",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "WUCm48LSSxeN3mZknFK7Wg",
    "stars": 5.0,
    "useful": 13,
    "funny": 2,
    "cool": 13,
    "text": "If you have a dairy problem and love ice cream, you will love this place. It is dairy free ice cream place. It is also the vegan ice cream place. It is a mystery to see what in it and what kind of flavor they serve. We were here walk by and decided to explore. Love the concept with dairy free. I was wondering how it taste without dairy. \n\nWe got the matcha latte and the divine chocolate. It proof itself without dairy ingredients, the taste still can be achieved. The matcha latte has good taste with coconut flakes in it. It is delicious. The divine chocolate has good chocolate taste with rich in flavor. Both scoop are delicious. No taste try. But definitely worth the ice cream in every flavor.",
    "date": "2021-05-17 12:41:53"
  },
  {
    "review_id": "ZZQiRm1YW9LNE2RbMFGM0Q",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "m5d4iR2mbz_W7Y19-xSW5Q",
    "stars": 5.0,
    "useful": 13,
    "funny": 1,
    "cool": 12,
    "text": "Great sandwiches shop at Wesley Chapel / Lutz area. It is hidden gem in this location. Very close to 4.75 stars. Definitely worth the try and return for more. The restaurant clerk is very friendly. They did give us try on their squeeze juice. \n\nWe got the Serranito sandwich. This sandwich come with prosciutto ham on the egg. It also has grilled green pepper which is delicious. This almost like breakfast item but it is eye pleasing. We also got some item from seafood section. The Lobster on Cuban. I have Cuban sandwich before, but a lobster Cuban is the first time. The sandwich did pack with lobster. Then it is press like Cuban sandwich. Highly recommended. The sweet chili sauce accompanied well. \n\nOverall we like this place. It has seafood sandwich, pork, poultry, beef sandwich. Got to try them all. Kid menu also available. Try their fresh squeezed juice. Side item includes conch fritters, cod fritters, empanadas, stuffed potatoes ball are also delicious.",
    "date": "2021-07-15 17:53:51"
  },
  {
    "review_id": "Zp9PPaa2qrTZ56CzxMR1Zw",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "ZpQs6ICV63NwLrTO9kNHAA",
    "stars": 5.0,
    "useful": 6,
    "funny": 2,
    "cool": 7,
    "text": "Grille One Nine may be the best happy hour sushi. They also has the $1,$2,$3 item during the happy hour before 7 pm. The sushi rice is better than three other sushi happy hour place I have been to. \n\nTonight we have to pick up our car at dealer and pass by this place. I have seen Stacy visited this place before and book mark it for some time. We have ordered the spicy tuna roll, gator roll, Florida roll, and eel roll from the happy hour and order a surf and turf roll from the specialty menu. The gator roll is the is the yellowtail, tuna, atomic aioli, scallions, smelt, and tempura chip. This is a good roll. I also like their eel roll that serve a good eel. \n\nThe specialty surf and turf roll is fried lobster top with seared steak. Mmmm I like this roll. We also added the nigiri smoke salmon and freshwater eel. The service is great. Please call ahead since many come to happy hours.",
    "date": "2015-11-20 05:08:33"
  },
  {
    "review_id": "y7TNQi1f2nuT1pjN5qEwHw",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "5XsC0tB8chKjTIW7mU6TnQ",
    "stars": 5.0,
    "useful": 9,
    "funny": 0,
    "cool": 6,
    "text": "This an update from the previous take up to current dine in experience. There is no doubt eat at the shop is the best option. The food just prepared and they are good to go. I am considered they are top store for devil crab in tampa. \n\nWe order one devil crab and they are huge. The whole ball is stuff with crab meat. They definitely worth for the money. It come with chip and drink. Do you know the breakfast special is only $5.99 and they give a lot. It includes sausage, ham, scrambled egg, and more. Big breakfast to share. \n\nAfter a true sit down visit, I feel they are one of the best in Tampa. It can be easily one of the most like in the bay. If you visit Tampa, this is one you should try. Sandwiches is famous here too but the devil crab is the jewel of the store.",
    "date": "2016-11-02 20:01:00"
  },
  {
    "review_id": "AdN_lC8bMChptt9X_-1iGg",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "TMQT3p3jSFOs4-yzUHWBAQ",
    "stars": 5.0,
    "useful": 19,
    "funny": 5,
    "cool": 16,
    "text": "Rare ethnic food # 64. Thai Street Food\n\nThis is noodle restaurant has a lot to boast about. It is first Thai street food in the Bay Area. Their menu concentrated on noodle with many different choices. It is a true 5 stars restaurant to my book. I once been to a street vendor in Singapore that received the Michelin Star. This restaurant will be our Tampa Bay Street Food That has Michelin star quality. \n\nWe started with Namtok Moo. It is the grilled slice pork with Namtok sauce with roasted rice powder. The marinated was good. The slice beef is great. Our fist entree is the Ba Mee Moo Dang. It is the BBQ pork with egg noodle. It is a dry both noodle dish. Very similar to Malaysia dry wonton noodle dish except they use BBQ pork. I like the sauce at bottom of the dish. So you need to mixed before you eat will help the flavor. The second entree is the Tew Pad Toon. It is the duck noodle soup. The duck is deboned. The duck is cook in the broil herbal soup. The soup base also from that. I think this dish win my heart. \n\nWe have a lot love for this restaurant. Although it is too far for me to visit but I will make the effort to revisit. I highly recommend this restaurant.",
    "date": "2020-09-27 11:24:48"
  },
  {
    "review_id": "WBhiE5hqPSXTybuDPvIALw",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "K74RHoIbJG_kIi9RsxQQcw",
    "stars": 5.0,
    "useful": 5,
    "funny": 0,
    "cool": 5,
    "text": "East Bistro offer stone oven food that is delicious. Under $10 you can filled you stomach with great food. This is small businesses we need to support. I think they are better alternatives than the fast food such as McDonald. \n\nI pass by here a lot but never go into the restaurant. This restaurant has some sit down place. This is almost like cafeteria order at the counter and pick up the food. However, they have good food. I have order to go. I have order the Kibbeh, beef kabab and atayef. The kibbeh is ground beef in cracked wheat shell. It is delicious. The kabab are the kofta with season ground beef and grilled over the open flame. It come with rice, baba Ghanoush and tabouleh. Mmmm good. I also have the dessert that is not in the menu. The Atayef-Arabic pancake stuff with walnut. They fried and dip in honey syrup before it serve. \n\nI gave 5 star for good pricing, good food, fresh ingredients, cook on the spot, and attentive service.",
    "date": "2015-11-29 16:36:31"
  },
  {
    "review_id": "F_Ul46TsVmRO3Y7_amcNMg",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "weIYxWpFp1TLoaX6XE4Elw",
    "stars": 5.0,
    "useful": 7,
    "funny": 4,
    "cool": 7,
    "text": "Gourmet or Craft bread. You decide. Either way, they have good bread. This bakery with the name 20 shekels is equal $5.06 USD. I believe the loaf of their bread more than 20 shekels ($7). \n\nWe got a loaf of chocolate blackberry bread. They are delicious. It was interesting how they make it. They use sprouts dough. It is compact, jam, dense. Fill you up quick. \n\nOther item they have sold include sprouted brioche fruit tart, sprout lemon cake, sprouted banana muffin and many more. Come to check them out for fresh loaf. \n\nThe store sale people are very friendly. They are knowledgeable to answer any questions. I would give them an \"A\" on the bakery item. Go enjoy yourself a loaf of bread. 20 shekels is very reasonable for the price of the loaf.",
    "date": "2016-02-03 14:13:47"
  },
  {
    "review_id": "I299fzdiCF-1MHGGTnWWrw",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "RLlOK2fL6xU1sfIPiP2QBw",
    "stars": 5.0,
    "useful": 2,
    "funny": 0,
    "cool": 1,
    "text": "The line for dinner is 45 minutes wait. Fortunately they are only one block away from the Canal Street where we can wait and watch the parade. They will assign you a buzzer. And the buzzer range is about 1 block. \n\nThis restaurant is recommended by our taxi driver. He has indicated the local love this place. Tonight we have order Crawfish étouffée and Seafood combo. The seafood combo is the fried shrimp, catfish and oyster. The coating is Louisiana bread coating with dry coat. The cat fish and the oyster is killer in this dish. The cat fish is fresh that do not smell fishy. The fish is soft and tender. The oyster in New Orleans is different and soft after fried. The chef did a very good job. Normal fried oyster is a bit rubbery but the chef here make it almost like raw oyster soft. \n\nThe pre-meal items came with the broil potatoes. The potatoes are inch in diameter. They broiled and coated with spicy salt spice that I could not guess what spice. It is good. The crawfish came with salad with sweet vinaigrette dressing. A bit sweet for me but is good. \n\nThe Crawfish étouffée is one of the New Orleans must try item other than Gumbo and Jambalaya. This is a gumbo soup base material with rice and crawfish. This crawfish is broil alive and the shell is removed. The crawfish then added to the soup base with rice. The dish has more than 30 crawfish tail. This is a good dish.",
    "date": "2015-02-07 17:40:41"
  },
  {
    "review_id": "bunjDXnBBj598zgh45AmMA",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "qsLVHCPvRkDX2sQdQM-RDQ",
    "stars": 5.0,
    "useful": 18,
    "funny": 7,
    "cool": 20,
    "text": "I was here to have a take out. I have this restaurant bookmark since my friends in yelp M&M has been here. The restaurant is well decorated with Bob Marley picture. They also has salt water fish tank. \n\nI got the their two best saler in the menu. The oxtail and the jerk chicken. The oxtail was well sauce marinated into the bone. The tail is braised till the meat fall off the bone. The jerk chicken is marinated till enter the meat. Then it grilled to perfection. When you use your finger to eat the chicken, you still can smell the marinated sauce at your finger after you have finished the chicken. Each dish come with rice, stir fry veggies. \n\nI also got their conch soup. It is a bit fishy but it is good. Love all the food here. Portion is big to feed the hungry person. Price is above the average Jamaican restaurant but the the portion measured up the price.",
    "date": "2019-10-17 01:09:25"
  },
  {
    "review_id": "Onnq0uc92vECAqxEQo3qVQ",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "j4KA-BujEH7xmG6bD5E-gQ",
    "stars": 5.0,
    "useful": 21,
    "funny": 11,
    "cool": 23,
    "text": "My revisit was the best. We have a chance to take a photo with the executive chef of the restaurant. We like to thanks Jessica Boyd for setting up our company holiday party here. Definitely have a good time here. Service was excellent. And thanks to Chad Bash to allow us enter the reserved room earlier before our set time. Their special room can can seat 50 people easily and good for smaller wedding party too. \n\nTonight I try their different cocktail. Each one has their unique taste. My first one is the salted caramel martini, it is sweet with foam above. Second is the tall and sexy, definitely this tall glass attractive with beautiful waist look glass. If you are thirsty, this is the drink to go. The next is the Bourbon Barrel Aged Spice Sangria, this special make sangria which is great for accompanying the meat dish. The next is I believe scofflaw but not sure. The last is the Midnight Martini to wake me up with coffee drinks. It has good coffee in it. My friend enjoy the Black Widow and the Sacred Margarita. They even pull out a virgin Black Widow for a non alcohol soft drink. It was good for them. The margarita was the best among my friends because it come with fruit press for the drinks before pour. Unique. Some of my friends order the virgin pina colada and Daiquiri. They enjoy it. \n\nOverall the good are great love the appetizers and main dish.",
    "date": "2019-12-08 12:11:52"
  },
  {
    "review_id": "38F0sCGQ1ynrLgLE_9DK4w",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "AvT60oEgrncToOSrETmkLg",
    "stars": 5.0,
    "useful": 4,
    "funny": 3,
    "cool": 4,
    "text": "We love our restaurant street at old height. This restaurant I have bookmark for some time. I love the creative chef went out their own and have their independent restaurant. This business owner did a good job for themselves. We were here on Friday night late after 8 pm. There were seats in this restaurant. The seating area is limited. Very nice clean bathroom. \n\nTonight we order three small plate. The escargot, the sear blue fin tuna, and the mussel. The escargot is seat on the bread and pour in wine sauce. It make it perfect when they are soak. The escargot is in good size and they about 10 pieces. Sauce is about the right touch for the escargot. The mussel come with creamy sauce. It is a good dish to pickup not over power the material. \n\nI like the tuna the best. This a blue fin tuna in belly section. It is a bit fatter and rich in taste. They are likely seared top with a bit soy sauce with fragrant  taste and lay over a special chili sauce. \n\nThe price for the small plate is good. The price of the large plate in about the medium to high side. Not much of seating area but good enough for the night.",
    "date": "2016-04-09 09:27:36"
  },
  {
    "review_id": "affjgsNJYVAnCfxod1f30w",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "41b1cZSlkIBA_87-jCcXlw",
    "stars": 5.0,
    "useful": 11,
    "funny": 5,
    "cool": 11,
    "text": "Yelping #1300. This one go to the local restaurant that has very good potential. \n\nEbisu is new and up coming Sushi restaurant. 8/5 will be their anniversary. They have special for the night. The celebration included live band, special dish, freebies and discount. \n\nWe arrived one day before their anniversary. We got here a little after 5 pm. We were the second group of the day. This place is popular after we have sit down. Many have followed. The menu did not has an spectacular wording to attract you. We have order the early bird special. The special is classic roll buy one get one half off. We have order the spicy tuna, negihama yellow tail, unakyu eel cucumber, Mexican fried shrimp avocado. This roll are fresh and well prepared. \n\nWe also order the Salmon Oyako Don - salmon sashimi with salmon roe and rice. The salmon was very fatty and good. We also got the special of the day, the fatty tuna sashimi. Wow. What a good piece of tuna. Very rich and nice. \n\nThe reason they are true 5 stars is because their quality of the fish is top grade in compare to many Japanese restaurant. It definitely worth the money.",
    "date": "2017-08-04 23:30:04"
  },
  {
    "review_id": "zm3X9wROs3rzmR4knVCOcg",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "j4KA-BujEH7xmG6bD5E-gQ",
    "stars": 5.0,
    "useful": 15,
    "funny": 4,
    "cool": 16,
    "text": "Yelping #1800. This go to the local restaurant has great interior. \n\nI was here for a solo dinner. I found a place at the bar with great atmosphere. Almost every spots are occupied. The bar has a nice decoration hanging on a T cross beam. I know the owner did not mean it to be sacred flowers on the cross but I think is perfect. \n\nI start with their signature cocktails. The black widow. It is a silver tequila, agave nectar, blackberry, lime juice and a leave of fresh basil. It do have enough alcohol for the tequila. The blackberry accompanied well. It is a good drink. \n\nThe entree is the Hawaii Delmonico. It is angus ribeye marinated in the pineapple and sweet soy. It is Hawaiian thing. I ask the steak to be medium rare. I was hoping they glaze without over burn because it is sweet. The chef did a good job not just prepared to the order, it caramelized the entire steak. It is great to have it. \n\nMy night is perfect. The bar service is very attentive. I like pre-meal item. The bread with chili bell oil sauce is well balanced. If you think about special occasions with manageable budget, this is a great place to celebrate your occasion.",
    "date": "2018-09-03 12:11:51"
  },
  {
    "review_id": "nld9WLJSNg-AfdDrkVAMpw",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "QdfEux5qFUDDbnxUzGJR4Q",
    "stars": 5.0,
    "useful": 17,
    "funny": 6,
    "cool": 15,
    "text": "Authentic Cuisine #60. Mexican dessert. \n\nThis dessert store is one of the kind. I was surprised to bump into it when I shop at this plaza. It has minimum 50 different dessert items that you can choose. The make up of the dessert is eye pleasing. \n\nI started with cucumber soft drinks to quench my thirst. The cucumber water was fresh and nice. We got esquite as salty dessert. It is the corn and cheese. It is warm and nice. I got the strawberry Fresada. It has chili powder, strawberry slice, some kind Mexican candy. The drink has strawberry smoothie. It is typical interesting drink. \n\nWe also got the popsicle. It has fresh food. Many choices of popsicle. They also has churros ice cream. They also carry tapas like shrimp cocktail in Mexican style. One thing for sure. Your experience here will be one of the kind. It is not like your typical dessert that you normally have.",
    "date": "2020-07-13 03:16:29"
  },
  {
    "review_id": "1jmfh2RApwz3aSvam6h4Dg",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "I7tuRXZyKCB8SWaq3tQVqA",
    "stars": 5.0,
    "useful": 10,
    "funny": 5,
    "cool": 7,
    "text": "We think we had been to La Pequena until a friend told me that it not their main restaurant. We actually went to the express. The one that have water mill at the front is the express.  The actual restaurant is actually on the right of the plaza in the same location. This time we get to the right main restaurant. The menu here is definitely different and plentiful to select. \n\nWe have order the salmon special and their beef soup. The food portions are huge. Material is well prepared. Value is definitely there. The salmon is grilled and top with mango sauce. The accompanying sides are rice tostone and fried yucca. The fish is grilled to the way I like it. The beef soup is one of the best. This time we are asking the soup with grilled palomino steak. It has yucca and beef meat in tiny pieces. \n\nWhen we eat there the next door has salsa music. We saw a lot waiter in and out. We walk across the building door and found the dancing room is part of the restaurant. Very nice. Fern need to be here. Now you eat, drink and play in one place.",
    "date": "2015-09-06 12:50:43"
  },
  {
    "review_id": "2EibA_8CYhfInnAHwA1sbQ",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "IcJn455jAVb9HWfobnNEmA",
    "stars": 5.0,
    "useful": 6,
    "funny": 4,
    "cool": 4,
    "text": "If need home cooking, this is your place. The restaurant chef prepare the meal from beginning. A lot of work. The dish that I have need a lot of time to prepare. I have the OX tail that was cook for long time to make it soft. It cook in the Caribbean spice and has a lot of Indian influence. The tail must be slow cook to make it separate from the bone. This dish accompanied with cabbage and the bean rice. You can have the choice of white rice. \n\nI also have the flower drink - Sorrel. They prepared it and put in the cup and store in their refrigerators. Sweet treat. They have some other food please check it out. They also have fried fish. You can call ahead to have your fish prepare before you arrive. It will take some time to fried. The owner of the restaurant is very friendly. I like about this mom and pop shop.",
    "date": "2016-04-13 11:54:28"
  },
  {
    "review_id": "0wsaiOe3Ou4ByIRslBK64Q",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "2jRrqwGjgHgJ9rn0Ptaxuw",
    "stars": 5.0,
    "useful": 34,
    "funny": 9,
    "cool": 24,
    "text": "Great food and good price. This is very much sum up the entire review. It is easy to give this restaurant a good review. The new restaurant do bring a lot good to the neighborhood especially for blue collar workers. If you need a good box food, I recommend this is the place. For me, I prefer to eat there because they just prepare fresh. \n\nWe started with the pork spring roll and chicken egg roll. These rolls are the complimentary from the restaurant. We added the charshu Bao. The spring and egg roll is freshly fried. Very good. The Bao has good steam bun. The price come with three Bao which has a lot of meat. Love the Bao and sauce on it. \n\nWe got the bulgogi and grilled pork noodle bowl. The bulgogi is the best. The steak of the bulgogi is soft and tender. Good to bite. The grilled pork has good seasoning. It is a bit different then most Vietnamese food but I like this way. \n\nI like restaurants set the food in right price. This restaurant make it to the list. It is convenient to have the box during pandemic. If you cannot finished, you can carry it home.",
    "date": "2021-01-01 16:33:32"
  },
  {
    "review_id": "qq5Hs8L-w9mTg8GBXnh-1Q",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "oO_g1nb30W2or1swQAe3nQ",
    "stars": 5.0,
    "useful": 13,
    "funny": 2,
    "cool": 13,
    "text": "The first Bubba in Florida. It is sister company of Texas Roadhouse. But I think they are better than Texas Roadhouse and is a improvement. The best thing is affordable cocktails. $4 not bad at all. I got the midnight train and the Frozen All American Margarita. The midnight train is ok. But the Frozen American is wonderful. Next time I will try Long Island ice tea. \n\nWe have the Rib-Eye steak 12oz and Signature Ribeye Steak 14 oz. the regular ribeye just grilled but the signature is marinated. Both are really good because good quality meat. The signature ribeye is marinated in sweet sauce. It is excellent. We also good 12\" pepperoni pizza and the raspberry chipotle wing. The pizza is ok but the wing is really good.  \n\nThe only thing that need improvement is the reception. It need some work. When the table is available, they need to hurry up shorten the wait line. It just too much for reception to take phone order and lead to table. The service for the table is really good. They have enough people to handle the food delivery and tablE service.",
    "date": "2020-01-18 19:27:44"
  },
  {
    "review_id": "uyqCbcotnmLk6OXQBJ5OFQ",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "R4NUjB9RLfaZr2OcFfxB2Q",
    "stars": 5.0,
    "useful": 4,
    "funny": 0,
    "cool": 2,
    "text": "4.5 stars restaurant is correct. This restaurant has been here for sometime. It has great Venezuela cuisine. This restaurant also has great acoustic sound system for the music they play.  \n\nThe food here is in good portion. May be enough for second meal. We have the Parilla Mar Y Tierra (mix grilled) and Churrasco. The churrasco have the selection of two side. We have the bacon and chorizo. This side is big. The churrasco is also big size. The seasoning is good. I like my wife entrée better. She has the mix grilled. This is a value dish. You can try different marinated meat. \n\nThey serve different juices. I have the lulo. The service is good. The restaurant is not too busy after 8 pm. But they close at 9 pm. They are well hidden in the corner of the plaza. If you travel southbound Dale Mabry, start looking for it after the village inn.",
    "date": "2016-02-09 12:39:18"
  },
  {
    "review_id": "mnqVEReCpjL_i0XnvmB1gw",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "6vl3AScsgSNIeuM8woSGSg",
    "stars": 5.0,
    "useful": 14,
    "funny": 6,
    "cool": 16,
    "text": "This Thai restaurant you may not know about it until you have traveled to Seminole, Florida. They hide away in the plaza corner. My experience with them is not yet 5 stars. It is about 4.5 stats. \n\nThe restaurant has good Thai food. I was here with a friend. He got the dish not in the menu and not serve to the public. This dish is call Kapoon. It is noodle dish with intestinal, pig stomach, and many other ingredients. This is actually a Laos dish. You only have to be lucky enough to enjoy it. \n\nI got a dish from the menu. I have shrimp in garlic sauce. It is a good sauce. The shrimp come in 7 total quantity. They are large. The entire dish is only $11 for the dinner price. Not bad at all. I also got a dish to go. The drunken noodles with shrimp. Again, the chef has a very good wok technique. Burn on the edge and maintain the wok high BTU oil burn technique. Love it. \n\nMy friend got the sticky rice with mango. This dish top with sesame seed and coconut milk. Look very good. I would give them the credit for good dish in reasonable price. Come and enjoy them.",
    "date": "2018-08-10 16:12:39"
  },
  {
    "review_id": "Fw-Lql8tb0Hg9WtiWaWr0A",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "TlVR0GNI6MsJyS0e74OhnA",
    "stars": 5.0,
    "useful": 19,
    "funny": 6,
    "cool": 17,
    "text": "This is 4.5 stars in my book. When I was first here for the next door restaurant and notice them. That time they still working on the building interior. Now seeing them doing well, it is encouraging business in Brandon. There will be wait if you are not there early. I was there on Sunday ahead the church crowd. There is already 20 minutes wait. We take the breakfast bar without wait. \n\nWe have the Dakota - it is flat iron steak with bread, toast and a side. I got the grit. The steak is delicious with the right seasoning. Steak was cook well and compliment to the chef skill. We also got the churro waffle. This dish come with 4 quarter pieces waffle with whip cream and caramel syrup. The waffle is crispy. A bit oily but is tasty. Very unique dish. \n\nI saw many dish fly out the serving window. The quantity of the food and presentation of the food was really nice. Service is attentive. It is step of right direction for the new restaurant.",
    "date": "2019-08-25 16:10:24"
  },
  {
    "review_id": "Cs1NxVqsh0mQPJ7q4VLpLg",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "KAksgCMLkJyEbrB6hfuVew",
    "stars": 5.0,
    "useful": 23,
    "funny": 9,
    "cool": 22,
    "text": "It is about 4.5 stars. Not yet 5 stars. This restaurant in my bookmark for a while. We finally make it here to try the restaurant. This restaurant is kind east meet west. They have Laos food, southeast Asian, Asian, Italian, Americans cuisine. I like the ideal of variety. \n\nMy wife have the grilled chicken with pasta. The chicken is marinated in satay sauce. It is a interesting combination with the Italian pasta. The chicken is well marinated into the meat. Great flavors. \n\nMy dish is the New Zealand Lamb chop with red wine mushroom sauce. It serve over asparagus fried rice. Another west meet east cuisine. The lamb chop is well cook and soft to bite. Mushroom sauce is nice to be add on. \n\nThe service is perfect, waiter is well train. Know the customer need and respond quickly. We have great time here.",
    "date": "2019-02-13 05:15:45"
  },
  {
    "review_id": "ztfLJfMS6wvhmWS7Dg70rA",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "fLocWv0cO_IaW9es8o_6PA",
    "stars": 5.0,
    "useful": 16,
    "funny": 8,
    "cool": 20,
    "text": "Authentic Cuisine No 66. Mexican cuisine. \n\nIt you don't mind hole in the wall setting, this can be your place. This restaurant is driven by good pricing and authentic Mexican food. If you want Street food, this may be your place. The restaurant is located at gas station plaza. It has limited seating. The food is delicious.\n\nWe have the Birria Taco. It is overnight taco meat. Sound not attractive. But after the meat cook overnight, the marinated spice in it. Add the cheese, it is good to have. Very fulfilling. It come with a soup that I have never have before. I wonder what is that. Before the meal, they have the flautas chip with salsa. It is delicious. We also got the ceviche taco, buche and campacheno taco. The buche is pig stomach and the campacheno is the mixed of steak, chicken and pork taco. Very interesting. \n\nService is ok. The Mangonadas is great. It is a interesting street food.",
    "date": "2021-01-30 16:53:18"
  },
  {
    "review_id": "n0Dovde_g4i6xM4gcKyEXA",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "PQ0QbT5I6V8JvOm0NRFlFw",
    "stars": 5.0,
    "useful": 19,
    "funny": 12,
    "cool": 21,
    "text": "#600th review\n\nI choose Thuy Cafe because it is a small business with cool food. I would said Pinellas Park area have too many good Vietnamese food. This is one of the unique noodles soup area. It is tiny not too many seats. But we were able to get a seat at the weekend after the Love of Tango. \n\nI try their Bun Rieu Cua - Crab Cake Noodle Soup. This noodle soup have white crab cake, fried crab cake. Very nice soup base. The accompanying veggie is very well decorated with arrangement. This is my first time to have this soup. I have empty the whole bowl. \n\nWe also have other items such as the lemongrass grilled beef sandwich, wonton noodle soup, shrimp chip. By the way, they have 20 different sandwich to try. Some include vegetarian ham. Ham for vegetarians???!!!\n\nPinellas, you don't know you have pearl in your area. Please check them up.",
    "date": "2016-02-20 13:59:57"
  },
  {
    "review_id": "QcytOGFLtYzyd71Jt9NIIA",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "ds60IfUbhaQCPKpQhVITtA",
    "stars": 5.0,
    "useful": 15,
    "funny": 5,
    "cool": 12,
    "text": "Finally New Tampa has it own assembly chain open up. To me it is 4.5 stars. Not yet 5 stars. They 4.5 stars due to their creativity of sauce. We have try their vinaigrette cilantros sauce and we like it. We also try their ginger citrus and coconut sweet potatoes sauce. I can said the sauce went through good R&D. \n\nA few thing they can improve are the BBQ chicken and steak. I feel their steak do not worth for the upgrade unless I can order the medium rare steak and chop up. Steak is over done. However I have to tip my hat to the teriyaki chicken and spicy tuna. Their Brussels sprouts, mushroom and broccoli are favorable to add on. The base I would recommend the forbidden rice, noodle and cauliflower rice. \n\nOne other thing can improve on is to fill up the bowl. Don't let it 80% full.",
    "date": "2020-02-21 02:42:40"
  },
  {
    "review_id": "StGc5rPRwTJt61Ojc2wH-A",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "pTYYvaidkQxPVtKg6MP9FA",
    "stars": 5.0,
    "useful": 18,
    "funny": 6,
    "cool": 18,
    "text": "This is memorable night from The International Culinary School at The Art Institute of Tampa. This dinner no doubt is one of the best in the Bay now. The cost is low, the food is great, and we even get Chef Treatment. Tonight dinner is one that closer to my heart. The restaurant or the institute is naming as Tutored Chef and they only serves dinner on Thursday and Friday night from 6 pm to 8 pm. Please call 813-393-5395 for reservation.\n\nThe menu has ten items to select. Each item not more than $6.95. You also can try their special combination of the ten items from the menu with three to five course meals. The three courses is $13.95, four courses is $15.95, and five courses is $17.95. This is a steal and price buzzer. They are currently serving the spring menu. The summer menu will be start at July. I would encourage the patron go to support them. However, if you want to get the best cooking skill, come after four to six week later when they are familiar with their menu. That is when the food is goooooood. The food and the tip are going to the school. You can tip extra with cash and mention it is for the people who serve you. It is good for the student who serves you. \n\nTonight we have everything in the menu. The restaurant starts with crouton with herb dip and enhance flavor butter. Then follow by baked empanada with passion fruit and Cajun Spice for opening. We started with grilled asparagus in asparagus puree and bacon bit. This is a well presented dish and it is elegantly presented. The asparagus is well cook and go well with the Canadian type bacon. The second initial entrée is the Egg - it is soft broil fried egg serve over the Mushroom Ragout. When the egg is cut, the egg yolk is spilled over the mushroom. The mushroom is cook with wine sauce. When it mixed with the egg yolk, it has added the flavor. The egg is fried with crust and tasty to eat. The third initial dish is the soup du Jour. The soup is one of the student creations. Creamy soup is served with smoke bacon. \n\nThe main dish starts with the lamb - Chilled Grilled Leg of Lamb serve over the Israeli Couscous. It also has the touch of the Chimichurri sauce that makes the grilled lamb more desirable. The second main dish is shrimp - The shrimp is cook with Tarragon Tomato Relish and Chive Oil. It serves over the risotto. The taste is like old bay seasoning for the Maryland Crab. It goes well with the risotto. The third main dish is pork - They are two type pork is served here. Braise Smoked Pork Shanks and Sautéed Pork Tenderloin.  These are two different type of preparation. And both are good. It also serves with Potato Gratin, Baby Carrot, and snow peas. It is a balance meal. The fourth main dish is the beef - Slice Grilled Beef is place on top of the crouton and place on top of sweet Onion Marmalade. The onion is sautéed to soft and good for the mixed with the beef.\n\nWe close the night with Blueberry financier on blueberry sorbet and blueberry compote. It is pretty muffin cake over blue berry ice cream and syrup. We also have the Chocolate Marquis top with Ice Cream and roasted pistachios. Chocolate is same as mousse. \n\nI was going to post this review for my 200 hundred reviews. But restaurant this good needs to be shared. I am thinking do a UYE on the end of July or begin of the august when the student chefs get familiar with the summer menu.",
    "date": "2015-04-24 03:37:00"
  },
  {
    "review_id": "Y17nW-FN8kdeCruYofV1XQ",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "_P0-D02F_0SgFUuJLtHK1A",
    "stars": 5.0,
    "useful": 18,
    "funny": 2,
    "cool": 14,
    "text": "It is a cute restaurant serving lunch and breakfast. Parking can be challenging if there is studio sessions next door. Even at regular weekends, the parking is full. They do have outdoor seating area if you bring the pet. \n\nThere is must try drink in restaurant. The horchata iced coffee is a must have. I like it for cooling summer hot day. We got two different flans. The salted caramel and the butterscotch flan. Both flans are delicious. We also got the Timba with guava dipping. The Timba is the fried cheese - Queso Blanco. This fried cheese and great to have. \n\nThe restaurant have many sandwiches. We were here after lunch for dessert. Food ordering was easy.",
    "date": "2021-05-14 14:45:49"
  },
  {
    "review_id": "20arE-8ucAAxNjNjIqA8qA",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "zWkabha6AGOGGIcKMqACXg",
    "stars": 5.0,
    "useful": 3,
    "funny": 1,
    "cool": 4,
    "text": "Rare Ethnic Food 7\n\nThis is an annual get together Ramadan experience at a restaurant of choosing. This will be our second annual Ramadan buffet with the Yelp friends. Usually the buffet start at sundown which is 8:30 pm. Petra was choose for this year Ramadan buffet of the night. If the Yelper want to actually experience it just fast for one day and join the dinner buffet is more meaningful. \n\nPetra put out a good feast. Total cost with tip and tax is about $20. It includes the drink, the buffet and the desserts. Yummy. Tonight we have the Lamb, grill chicken, fried fish, pita, three type of hummus, falafel, grape leave, lentil soup, Greek salad, and more. The lamb display is awesome. Feel like eating a horse, this will be the feast. The desert is great. Plenty to go around.\n\nIn this holy month, many has come to enjoy the buffet. The food is very good and a lot of choices. The drink include mint lemonade that very unique. I would join their buffet before is over. The feast is 4.5 stars.",
    "date": "2016-07-02 16:48:03"
  },
  {
    "review_id": "oDU24foh-Q6IESeIa-FhEA",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "4qYJCNgJ1s1gseD6YP840g",
    "stars": 5.0,
    "useful": 14,
    "funny": 2,
    "cool": 10,
    "text": "It is about 4.5 stars. Not yet 5 stars. This is the third revolution ice cream I been to. This one have a lot of space. They always carry good ice cream. Sometimes I think they are too creative on the name that I could not figure out what is the really the ice cream flavor. \n\nToday I have the porky and the banana pudding. The porky is the vanilla ice cream with bacon. The ice cream is great. The bacon is good. The banana pudding is the one I like among the two. \n\nThey do have taste try. My wife always ask me why you buy the one that I did not try. I said to her I already try all other flavor definitely buy the one I did not try.",
    "date": "2020-09-04 23:43:59"
  },
  {
    "review_id": "_zN2-7zxU72RLqEyal5EvQ",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "GBtCFp9EU0Ti86ftGewZZg",
    "stars": 5.0,
    "useful": 12,
    "funny": 1,
    "cool": 10,
    "text": "I like the new concept of this place. This is a place I going to revisit. This first pick your own ingredients pizza place. It is build your own. First choose the dough. You can have white, wheat, gluten free or Keto friendly crust. I am going for the wheat dough. The guy who made it very skill. He stretched and throws to the air spinning with further stretching to thin crust. It is a show. \n\nThen you chose your sauce. You don't need to choose one sauce. I got the extra virgin olive oil then ask them to add the basil pesto. This is the first time I see pizza using basil pesto sauce. Unique. Next step is type of cheese. I am going to mozzarellas. Then the veggies, I pick the mushroom, sundry tomatoes, minced garlic, basil leaves, jalapeño and olive. First time also I see pizza add garlic. Then the meat. I got the sausage, pepperoni, meat ball, salami. That complete my master piece. \n\nI also ask them to top with balsamic drizzle. Love it. I don't eat a lot of pizza. But I would recommend this pizza. You can add the combo with drink and chip of gelato or salad.",
    "date": "2020-02-23 00:38:38"
  },
  {
    "review_id": "YuzdEfzlRBknfDkBkpsy9A",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "1bzQnwSL3EsGqADWiPDF6A",
    "stars": 5.0,
    "useful": 7,
    "funny": 5,
    "cool": 5,
    "text": "The remote restaurant is rest at the middle of the rural area. Who can think this place is good and affordable in price. We were attract to the recent post in the talk by Nick S. for the highly decorate 5 star restaurant. We have to check this out tonight. The whole street is dark at that area except this restaurant. People line out at this place before their turn to order. The store front is small and we have a suspicious this is good?\n\nThe restaurant look like a hipster place. The setup is efficient  allow the patron to order and they give you a code to pick up the food. The sitting area is limited. They have some table at the outside of the building. Today we have the Austinite taco, west coast taco, and the Texas flood taco. This is translated as Carne Asada Beef, grilled shrimp, and beef brisket. All meat is grilled to perfection. The Austinite came with caramelized onion and avocado. The Texas Flood has the chipotle BBQ sauce. The meat is grilled and have a lot flavor. The beef and shrimp is marinated. \n\nAll taco is $4.25, the burrito is $9.50, wet buritto is $10.25 and bowl is $9.25. You can order each combination at above package. The salsa of the chip is great. This place is affordable for the price, good quality food, perfect seasoning and flavor. As a result I have give them 5 star for the so little price we pay. The biggest price is to pay the gas to get there.",
    "date": "2015-01-19 03:38:51"
  },
  {
    "review_id": "NIJSgVk_KHZiZCC2kDTcUA",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "lUftjPrSYDd5KrGVV0HrFw",
    "stars": 5.0,
    "useful": 7,
    "funny": 6,
    "cool": 9,
    "text": "This food truck was at my eye sight for some time. I drove pass it for many time at that location and saw bright light next to the gas station. I have been here one late night but they close. Today was the perfect day to try. \n\nI would say they are the best taco in USF area. It is number two best in my list. We have order the lengua, tripa, asada, al pastor. I love the lengua and tripa. They are good flavor. The steak (Asada) was well seasoning, I like their way burn the steak a bit to bring out the aroma of the steak. The pastor has deep seasoning. Most of the taco place only lightly seasoning not bring out the good of the taco. Here did a good job. \n\nOn my next return, I will surely try the Cabeza, chorizo, chicharon, and carnitas. Food is reasonable price. You can call the number to place your order ahead and pickup without waiting. They are fluent in English. Since it is affordable, I am not paid your taco.",
    "date": "2017-06-07 03:50:28"
  },
  {
    "review_id": "af6KYhs44yP7J_UHhQ_rKg",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "k79ygmdDxEDXtLlR_rPrmQ",
    "stars": 5.0,
    "useful": 18,
    "funny": 4,
    "cool": 20,
    "text": "For weekday lunch. The selection is great. You also can make your own pasta. Choose the pasta type, choose the protein, and choose the sauce. I can said that they have great chef technique. It won't be able to go wrong. \n\nThe lunch special is less than half of the dinner price. It great for the business people have lunch here with quick order and get out in 40 minutes. Food is extremely good. You are paid more than value, great food and great flavor. \n\nWe have chef Complimentary tomato sauce over toasted bread. Our entree are Grouper Rosso and Prosciutto Linguine. Both dishes are excellent. The Grouper Rosso grouper is blackened over fettuccine. The fettuccine is serve on creamy basil tomato sauce. It includes the mushroom and scallions. Great combination. \n\nThe best dish is the Prosciutto Linguine. The Prosciutto and the fried garlic make great combination. The Prosciutto release the cure meat flavor into the dish make this dish desirable. Lovely dish.",
    "date": "2019-02-10 18:47:30"
  },
  {
    "review_id": "s_wwzf5KGE6my9zyoNIGQg",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "MQivsxEWhhdL8ARzO3jA8Q",
    "stars": 5.0,
    "useful": 24,
    "funny": 8,
    "cool": 26,
    "text": "Review # 2700, this review milestone go to Local Italian Restaurant to recognize their new efforts during pandemic. \n\nThe restaurant take over previous Italian restaurant which has been here for some time. The new owner creates the attractive menu. What you need to ask is their special. They do have separate chef special seafood items of the night other than the menu. I also like the bigger dining room with compare to old restaurants. The ventilation also improved from old setup. \n\nWe start the night with the fried calamari. The coating has a special flavor with seasoning. The dipping marinara sauce is fresh and different. I love it. Ingredients must be good condition to have the good sauce. \n\nMy wife have the chicken parmigiana with spaghettini with pink sauce. The chicken is breaded with marinated coating. It was crispy and tasty with cheese and marinara sauce. The pink sauce also interesting. My dish is a signature of the restaurant. I have the sacchettini with added grilled shrimp. This is the first time I try sacchettini. It is dumping stuff with pear and mozzarella. Then it cook in Gorgonzola Sauce. It is heavenly good. Highly recommend this dish if you have never have this Italian dish before. \n\nOverall the service and food is good. A VERY excellent Italian Restaurant. Please ask if you can bring your own wine.",
    "date": "2020-12-30 19:29:03"
  },
  {
    "review_id": "LpqrVqWYw51Q6zoveIWo1w",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "TwvVz3fJnKp_enydM9PrXw",
    "stars": 5.0,
    "useful": 15,
    "funny": 4,
    "cool": 15,
    "text": "Rene is one of the great food truck in Tampa. For the Taco Truck, they are at top of my list. Great food and creative. Now they are located next to across Southern brewery empty lot area. You may want to call ahead before your visit to see if they open. They were at Dale Mabry before. The current location is more permanent. \n\nWe have three different taco to try. We have the Chile Relleno, Carne Asada, Pork Barbacoa. The one taco that very interesting and recommended is the Chile Relleno. This jalapeño stuffed ground beef and fried. This is the first time I have taco this way. The carne Asada was delicious compared to many steak taco.\n\nOverall the taco are excellent. Flavor is definitely good. They also have other type like grilled butter squash, pork belly, steak bacon, spicy shrimp and oyster mushroom. These menu is great and think out of box.",
    "date": "2020-09-23 00:01:29"
  },
  {
    "review_id": "BsKcnAHJBO92mChBqaQ_pA",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "mi63FnVXGeGgasWxUSeRsA",
    "stars": 5.0,
    "useful": 10,
    "funny": 0,
    "cool": 4,
    "text": "Excellent service, food and good atmosphere. This Noble Crust was strategic located in Carrollwood area. The selection of the plaza for this restaurant is perfect. In this plaza, they are the only restaurant. Which mean perfect for parking spot since no other restaurant compete for car parking during the night. I can easily find a space to park in compare to many other restaurant which I have circular the area for parking. \n\nThe place in trendy. I like the modern decoration. \n\nService: the waitress know how to compliment the dress or shoes of the customers make lady customers feel they did the right thing. This added pleasures does go a long way. \n\nQC: I have observed the kitchen head chef QC every dish come out. This make the consistency of the food. I would said that is a big step to make sure the food come out correctly. \n\nKitchen: the new Noble Crust does have full equip big kitchen. It make all the food fly out without too much to wait. This is the reason why they are successful in this location. \n\nFood: we have the bistro steak, FGBLT, and the PEI mussel. The steak is cook to the temperature we have asked. It is good size of steak. It top over collars green with southern twist. The accompanying mash potato top with drizzle balsamic vinegar and green aioli. I like the steak top with green apple chimichuri. Very unique. The FGBLT is lay the fried green tomato as a base and layer with pimento cheese. Final touch top with glazed pork belly. The presentation is very nice. However the pork belly harmony is not there. I would said they need to work on the skin fat and meat combination. It need to be melt at your tongue instead a very chewy piece. I like the PEI mussel. It is cook with saffron broth. Most of the mussel I have either butter wine sauce or tomato red sauce. I like the way they have it with the southern twist with added andouille sausage. \n\nOverall, they are very good job with competitive price. It make me to revisit. Truly 5 stars restaurant with the right price. Not perfect. But close enough.",
    "date": "2018-02-20 05:54:18"
  },
  {
    "review_id": "J0Yde1zr2yTpfgUZl6B4LA",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "M0ArJYhR9GLiIeLo-O4Vcw",
    "stars": 5.0,
    "useful": 17,
    "funny": 6,
    "cool": 13,
    "text": "I like the different style of food is being served in Tampa. This fruit juice bar is one of the kind. It is part of Columbian daily street fruit juice. There two Columbia Mango I know off. This is one of them. I like this one better because they able to customize the drinks and fruit you want. In compare to boba drinks, this mango mix fruit juice combo is more naturally done. It is healthy. \n\nI got mango mixed and custom myself. I have mango noodle, mango leche, condensed milk and ice cream. Very nice. I ask them to prepare in the sweeten side. You can ask for sour drinks. The mango leche is from green mango frozen into drinks. Very refreshing. I also ask them pick the sweet mango which is great combo. \n\nThe service is great here. The people who do mixer are very friendly. I will be back to experience their other fruit combo.",
    "date": "2019-09-21 17:36:17"
  },
  {
    "review_id": "ll9lyKpuoGX2Dy-S7YEK2Q",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "wnaSIsTY4IDAP-kQ440fcw",
    "stars": 5.0,
    "useful": 17,
    "funny": 3,
    "cool": 16,
    "text": "It is actually 4.5 stars rating. Since no half stars round up to 5. Shave ice with flavor is originated from Taiwan. I like the store did create some new and it is their own way. The shaved ice is smooth with nice design. Love the interior with dine in partition separation. \n\nWe start with charcoal waffle with two choices of topping. I like this one to try. The charcoal waffle is unique. Our topping is the ice cream and the egg pudding. It is item to share. We also got the Lilac Lily shaved ice. The choices we have is taro flavor shaved ice. This item come with the chewy boba, grass jelly, red bean, gram crackers, condensed milk. It is sweet with sweet. The quantity is good to share. \n\nOverall our experience is great. Shave ice have good combination. Love the waffle.",
    "date": "2021-03-12 15:33:42"
  },
  {
    "review_id": "cJvLiTL7lbS964g6CfmI7A",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "VZuHW1Q5gETMI_fUZvtoSA",
    "stars": 5.0,
    "useful": 20,
    "funny": 6,
    "cool": 18,
    "text": "Umu is 4.5 stars restaurant in my book. Not yet 5 stars. Their food is good enough to attract more customers to repeat. The decoration is contemporary with dining and sushi bar seating arrangement. I usually go for the sushi bar because I like to see what they made for sushi. \n\nThis restaurant did serve omakase and Umukase. The omakase is $75. Six courses. The umukase is unlimited until you say stop. These two need reservations for the chef to prepare the and obtain the ingredients. \n\nI got the lunch special since I am in the neighborhood. I got the salmon misoyaki. This is Bento box with salmon prepare in miso topping. Salmon was cook to caramelize outwardly. I like the side. The stir fry veggies with slightly burn outside. They also goyaza in ponzu sauce. It also come with two pieces of sweet tamago. Great box for lunch. \n\nThe lunch special has two roll for $10. It is good. I got the spider and yellowtail scallions roll. I like they prepare the soft shell crab has a lot of crab meat. Services is good.",
    "date": "2019-01-21 13:45:20"
  },
  {
    "review_id": "ly5Q2sqHy8AucWU7U1l_fw",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "hV0rmTB2S2fYzjQKlHtKuw",
    "stars": 5.0,
    "useful": 19,
    "funny": 5,
    "cool": 22,
    "text": "Haven has been in my bookmark for sometime. Most of my friends been here has good time here. Mainly wine and cheese. But the happy hour is the most attractive. They have two parking area. If not street parking nearby is good too. \n\nThe happy hour has great deal. People come early during this time to enjoy couple of wine or cocktails. The line is already build at entrance to be open during Friday night. Happy hour is for bar, lounge, and outside. \n\nWe started with the Duck Confit Taco. The skins is different for the taco. Good enough. The second dish is the chargrills oyster. I like this dish. Somehow the oil in the oyster make this dish taste very good. The third dish is the grilled Shishito Pepper. With a bit sea salt oil and grilled over open flame is great for the wine and cocktails. Our board dish is charcuterie board with different ham. This is perfect dish with the slide cure ham. Our last dish is the chorizo fritter. Great ball fried with chorizo inside. \n\nService is great at the bar. The server is very alert. I have cocktails. Both cocktails is welcoming.",
    "date": "2019-04-22 12:46:09"
  },
  {
    "review_id": "ouCEilseG-IhzJN-m-j2ow",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "RMYjaB5krFGCtlOLf5TBwQ",
    "stars": 5.0,
    "useful": 22,
    "funny": 8,
    "cool": 18,
    "text": "If you want something prepared when you just order, this is the place. Many ingredients is original. Food are cook fresh on the spot. This restaurant is about 4.5 stars not yet 5 stars. \n\nThis is a cute German restaurant. I like the decoration. You will notice the front is German like different from all other store front. We got the schnitzel. Since we did the progressive lunch. We only order this dish. For the price you paid, it is will worth the food. It come with two pieces of schnitzel. Top with mushroom sauce on top. The crust coating was crispy. I think mAy need a seasoning coating. Other than that. They are good. \n\nThe service is excellent. You got the up close personal service. They also serve the German beer to wash the food down. It is good restaurant to try.",
    "date": "2019-09-29 12:11:39"
  },
  {
    "review_id": "zu3WAmiJua8KNwOucjygoA",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "q7gXzkWI-70rv2qdHXupQg",
    "stars": 5.0,
    "useful": 14,
    "funny": 3,
    "cool": 13,
    "text": "Somehow Lutz area has a lot of good BBQ. Recently station house has move to this plaza. It attracts a lot of local including us. Their store front is not ready yet but soon. I would said so many BBQ place and this one is top of my list in this area. A true 5 star. Wait until they fully open, they will be more famous. So far, they only serve take out. \n\nThey have three giant smoker. It is impressive. The converted old fire truck to one of the Mobile smoke house. You got to try their smoke rib and chicken. The smoke taste deep into the meat. The marinated of the rib has some fruity taste. Very good fall off the bone. Easy to eat. Must be cook for long time. I hope they maintain this quality. The chicken is juicy and nice. The best part are their creative sides. Their cowboys potatoes salad or cole slaw is very interesting. They are not your typical normal side. They have good mixed and taste.",
    "date": "2020-06-09 03:49:10"
  },
  {
    "review_id": "ukEpfZFuaw-jNPsXq1iP8w",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "R8t9g5nvi7VFyS8zsgmj8Q",
    "stars": 5.0,
    "useful": 17,
    "funny": 5,
    "cool": 17,
    "text": "Great restaurant in St. Louis. If you looking for local dry rub BBQ, this is the place. It is located at famous St. Louis The Loop neighborhood. Very close to Washington University. \n\nThe restaurant labeled themselves as Bourbon, Beer and BBQ. Definitely try the bourbon and BBQ. They have many selection on bourbon. I went for the local favorite. The Bird Dog. Great sense of smell. \n\nFor the BBQ. We have the Bestie Combo. It allows to choose 4 different meat. We got the rib, brisket, wings and pull pork. The rib is half slab. Dry rub seasoning with meat fall off the bone. The wing is the best. Don't misses it. Great slow smoke wings. Brisket and pull pork also well receipted. The combo come with two side and a mushroom shape bread call cheddar popover. Very interesting. \n\nOur time here was great. Pricing is definitely better than Tampa. It is must visit restaurant.",
    "date": "2019-04-05 12:09:37"
  },
  {
    "review_id": "iwZd2kckA7sfYADUf8mC2w",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "gBKe8wH1TnSmBBpLfHRKbw",
    "stars": 5.0,
    "useful": 23,
    "funny": 7,
    "cool": 22,
    "text": "It is 4.5 stars in my book. The take out and bowl are good. There is not much market for what I see. They do have some items for sell but to classify as market is bit stretch. I do like their cook food. It was delicious. \n\nI have miso salmon bowl and my wife have the Crispy Tori Katsu bowl. The miso salmon has large piece of grilled salmon. The technique for Grill was good. I like the edge with concentrate sauce. The miso is the sauce. This dish come with crispy Brussels sprouts, sweet potatoes and broccoli. The dish is well balanced. The crispy chicken katsu is coated with breading. It come with roasted carrots, sweet potatoes and broccoli. It serve with their house bull sauce. \n\nOverall the taste is there, price is right for the bowl. Many people have take out. I would try their bull bowl next time with beef tip. Food was well prepared.",
    "date": "2021-01-04 18:17:29"
  },
  {
    "review_id": "Xhc8zpCfxzCAfWEppeIr7w",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "ZZQzt65614oon6yfokjRIA",
    "stars": 5.0,
    "useful": 25,
    "funny": 6,
    "cool": 23,
    "text": "Rare Ethnic Food #53. Haitian cuisine. \n\nI was hesitating about come here because the mixed reviews. After visited the restaurant, I found out the reason why. 50% of the food is fried here, it will be not great to have the take out. Eat there is the key. Because when you brought the food home, these food turn tougher. Especially the pork. \n\nWe started out appetizers as Salty Fish Pate. The pastry skin is very flaky and the salty fish is great. Our next appetizer is the Akra. This is malanga fritter with great coating with nice seasoning. Malanga is root veggies. It is interesting to be fried with coating. \n\nWe order the griot. It similar to chicharon in Spanish food. But the pork is seasoning before fried. Better than chicharon. It come with rice and bean and tostone. It also serve with spicy coleslaw and spicy red curry. This dish really need to be eat there. If not, the pork skin will be to tough to bite after you order to go and eat at home. You need to experience the crispy of just fried pork. \n\nI also got the Tassot Kabrit. It is marinated fried goat. The bone in chop meat is delicious and soft. It was not tough. May be just fry or the chef have good technique. \n\nOverall we like our food. A lot people order take out. Tip don't wear good clothes. Because you smell like fried food after eating. They need to improve the ventilation system.",
    "date": "2019-02-02 05:19:38"
  },
  {
    "review_id": "iVvbvfOJMLCUoU2xsVdXIA",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "5wGADsAswlIYb1dl0fnfeQ",
    "stars": 5.0,
    "useful": 25,
    "funny": 8,
    "cool": 23,
    "text": "4.5 stars is about right for this restaurant. I would have client power lunch or dinner here. It is because of the beautiful interior decoration. Great blinds curtains. Many crystal chandelier hang from ceilings. That is the reason they call this place Crystal Dining Room. \n\nOne thing is they lack of service people die to lack of customer. However, food is good in compare to many place and the price is good for the food and ambience. I would host the wedding reception here. \n\nWe have the New York Strip au Poivre. The steak is big enough and the sauce is great. The accompanying potatoes and asparagus was great. We also has the grilled salmon bed with rice, top with mango salsa. All the dish is great. The chef has great skill. All entree come with salad. I also like their dark n stormy cocktails.",
    "date": "2019-05-07 00:33:32"
  },
  {
    "review_id": "Cqu5SebR4YfBnV8WbWERGg",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "xoVTtQd6xRrFbQcdfH0dLA",
    "stars": 5.0,
    "useful": 3,
    "funny": 1,
    "cool": 5,
    "text": "I have been this place twice and we are enjoying every bit of it. I believe we found our Italian Ice in the county. I am not Italiano but love this place. Eat while you can before the weather turn too cold. \n\nJeremiah's Italian Ice has many varieties. Their trademark ice is scoop froggy frog. However I like the mango and sea salt caramel. Like other Italian ice place in some Tampa a layer Italian ice with a layer of soft serve. Jeremiah can pile 4 layers which a layer more than anyone can pile in Tampa. I have try that route. \n\nI also have them do the ice only. The ice girl pile 4 layer and top one scoop of four favorite on top of four layer you have ask. It look colorful. The trick is to eat eat fast since they don't have soft serve in between. If it melt, the ice will mix together. But I like this way even freezing my brain. I have a few of them when I try this way. Take boon challenge!!!!!",
    "date": "2015-11-26 23:44:33"
  },
  {
    "review_id": "Q6USwCT4suU6MqifoQ5TcQ",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "ySyzC-hLWeRJCiTLBtcpvA",
    "stars": 5.0,
    "useful": 3,
    "funny": 1,
    "cool": 5,
    "text": "South Tampa is lucky to has such store. This place is too far for me. But my visit is a pleasant one. I would consider a people care serving grocery store. \n\nThe store offer craft beer sale, fresh produce, meat market, can goods and more. This store hold it own with very competitive pricing. \n\nThe love of the store is not about the groceries. It is about the deli section. The have all kind of sandwiches to select include the one I like now grilled sea bass sandwich. It is only $6.99 for regular size sandwich. Compare to the seafood restaurant next door, I pick the value, good food anytime in this store. Other sandwiches include Cuban, gyro, Italian, ropa veja and more. Come to check them out. \n\nThe have the hot deli in Cuban cuisine series. It include the roast pork and devil crab. Food here is good and convenient to housewife. I would visit them again if I am here.",
    "date": "2016-03-21 22:15:26"
  },
  {
    "review_id": "lw4IV2yqOgDBi5IJ8v-w7g",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "jorZo7Dp-xBzIBUxP0RkxQ",
    "stars": 5.0,
    "useful": 8,
    "funny": 1,
    "cool": 7,
    "text": "This is about 4.5 star restaurant. We know about this type of cooking when we visited Taiwan 2005. The use of volcanic rock stone heat up over 700 degree and grilled the food is a healthy way of cooking. In Taiwan, the meat is marinated and cook over the stone. It is not much of difference than this restaurant. \n\nThe lunch of the restaurant offer a better deal in smaller portions for experience if you don't want to spend too much money. For $12 you can have the sirloin, shrimp or ahi Tuna with a side during lunch. Recently they run the special for $18include steak and shrimp. \n\nThey have butter on the side if you want to grilled your meat with it. This type of cooking requires fresh seafood of premium grade of steak. It is not recommend for pork or chicken. \n\nThe food is tasty. It may require some minimum cooking skill to enjoy it. So who can blame if the food did not cook well. It was great to see the method is introduced in US. The dinner item is medium range in price compare to any steak restaurant.",
    "date": "2016-12-31 19:10:01"
  },
  {
    "review_id": "mMJd33dtsyQtzRwaROSHGQ",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "OGXeRGntC3VXd7WKUP4JfQ",
    "stars": 5.0,
    "useful": 15,
    "funny": 4,
    "cool": 13,
    "text": "Love it. Just outside of the food court at open area. Very visible if walk into the mall through the restaurant street and they located on the right hand side before the entrance. \n\nWe have the Mr. Mango Favorite Frappe. The is peel mango noodle, frozen mango juice, fresh mango chop and condensed milk. She started the condensed milk spread around the wall of the cup. Chop mango then add condensed milk. Add frozen mango juice then top with mango noodle and condensed milk. It is epic. Go get yourself one of that. You can add spicy spread if you like. \n\nThey do have Diablo Frappe it is street Mexican mango chop. Very spicy. May be try it next time.",
    "date": "2019-09-09 11:47:30"
  },
  {
    "review_id": "v__Y3kpkIExNm5-TkU6g3Q",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "iNEePY05pBQjXUfdO4ykig",
    "stars": 5.0,
    "useful": 15,
    "funny": 5,
    "cool": 15,
    "text": "It is about 4.5 stars. Not 5 stars yet. Thanks to Rachel local yelper who is the pioneer to visit this store. After a year, the business is still doing well. There were a lot of customers while we visited this place. \n\nI would suggest to go for the big Kahuna if you are hungry. It give you two proteins. I got the spicy tuna and large shrimp. The shrimp size is big also the spicy tuna is good size. We are happy the quantity they allow to add on. There are plenty selection. I got the masago, seaweed salad, fried corn and more. The add on is great. The base selection also a lot. I got the white rice and soba noodle. \n\nOne thing that can be improved is the their rice. Instead of white rice, sushi rice is better. It has more flavor when preparing correctly. Other than the add on, they also have large variety of sauce for selection. If you don't like to mixed your on bowl, you can get the premixed bowl.",
    "date": "2020-06-29 22:28:20"
  },
  {
    "review_id": "oWzg1Pi-gsH6HVd8B8BO7g",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "tMUA2eajVUqrU8tdA-DvnA",
    "stars": 5.0,
    "useful": 15,
    "funny": 5,
    "cool": 12,
    "text": "This restaurant located at Riverview. It is a popular restaurant in the area. Lunch has many customers is a good sign. I would said this is 4.5 stars restaurant in my book not yet 5 stars. I round up the stars because they have the Jackfruit Smoothie that not many restaurant carry it. The smoothie is nice dessert. \n\nI got the pork chop, shred pork, meat cake and fried egg and rice. Seem like this is a popular dish that many has order. The combo of this dish is twelve dollars but it has everything thing I need. Pork chop is delicious. Meat cake is a fan. I also has the shrimp fresh roll. The roll is big can be share and come in to two. \n\nService is good and attentive. If I am visiting again, I would try their chef special. Ban Bun Hue. It is tapioca noodle.",
    "date": "2019-12-24 12:20:55"
  },
  {
    "review_id": "EbtwRHEDvfHSpaOmtL0PYQ",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "aAXo_vX8YG10kytAM9SC9Q",
    "stars": 5.0,
    "useful": 19,
    "funny": 7,
    "cool": 18,
    "text": "This ice cream shop is truly like by many. The stars will tell you so. It is not easy to find. But the local know where it located. You have go to the back of the plaza and wonder you are at the wrong place, but just right there, you found the ice cream shop. \n\nThey have many homemade ice cream. The flavor can be learn by many ice cream shop. I try all four flavors, and I like them all. I settled for two flavors. One is the loopy. It is with fruit loop and vodka fruit loop. You have to be 21 years old to try it. The other is the coconut blueberry. Both of them has wonderful taste. \n\nMy wife has chocolate bacon toffee. It sprinkled with candy bacon. BACON. Definitely people love the most in their food. It is gluten free also. The clerk is helpful and has knowledge about the ice cream flavor. This will help customers to make the decision.",
    "date": "2019-02-08 04:29:33"
  },
  {
    "review_id": "dNz0bngC_RnUfsJkZ-iQkw",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "eGcP3k_boTpEvkdD-fHazg",
    "stars": 5.0,
    "useful": 14,
    "funny": 6,
    "cool": 16,
    "text": "70 years history, it is not easy. This tell the story of this restaurant. It is definitely one of the best in Bay Area. After 70 years. It is definitely will do certain dish very best to serve the Tampa Bay. This is 4.5 stars restaurant to my book. \n\nIf you come here for the seafood, I would recommend a dish. Scrod Jason. This is special dish that they do well. Celebrating 35 years dish. This is a whitefish, top with wine, cheese, garlic, and bread crumbs. The topping is so special, flavorful, crispy, enjoyable. Such a good topping. \n\nIf you come here, you will notice most of the customers are white hair. It does have a grab for this group of people with older age. The service is great and attentive. It speak louder when the food is right.",
    "date": "2019-08-18 02:49:32"
  },
  {
    "review_id": "7Mms9gwV6WrzgMO9sdjwWg",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "5xf1ylDuTmbdcFt7-UJTdw",
    "stars": 5.0,
    "useful": 26,
    "funny": 7,
    "cool": 22,
    "text": "I am glad that we have a Italian market near me at Wesley Chapel. The market do bring a lot business. Especially during the pandemic, a lot people cook at home. The Italian market provides convenient with ready to cook food, ready to heat food, or cook food for your table. This market is not tru 5 stars. But I really want them to survive, I rounded to 5 stars. \n\nThe sandwich list is extensive. The have specialty's, cold or hot sandwiches. The sandwich is big. You are basically can buy the sandwich and eat at their outdoor patio. We got the bomb and Moschella special Italian sandwich. The moschella special is different cure meat and veggies. I like the way they assembled it. The bomb is very close to the philly cheese steak sandwich. It has pickles veggies. \n\nThe ready to heat food including slice pork lion, crab cake grilled chicken, Wagyu steak and more. We like the crab cake. The Wagyu steak also good and tender. We got Marsala chickenpox heat at home too. \n\nOverall the market have a lot to offer. There are many other sections we did not explore yet. But we will be back.",
    "date": "2021-01-05 13:45:13"
  },
  {
    "review_id": "9soEu4TVhL-jwgIDsPDYjg",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "5SbXk54zWe22jg95R-8Fjw",
    "stars": 5.0,
    "useful": 15,
    "funny": 4,
    "cool": 12,
    "text": "This restaurant don't even need to show the name at the restaurant location. The only sign on the front of the restaurant is PUB. You cannot imagine that was enough to attract a lot customers. The secret is the food was awesome and creative. Usually pub has less women customers. But this pub mostly women. That tell the food here is the main reason. \n\nIf you come here I recommend you to look at the chalk board outside before you enter. These are the chef special. They change so often. These items are the best. We have the three pig piggy. It is sandwich either three different way of pork. Grilled pork belly, fried pork, and ham. It was delicious. The fried coated pork is crispy. The side of potatoes tots also crispy. \n\nOur second dish is the duck flatbread. It is another creative item. Who thought the grilled duck breast over the flatbread with mozzarella cheese and arugula. I like this dish. Only these season. It may not be next time. \n\nIt was great to open my 2400 series review with these pub that many people love. My wife usually don't like pub and this is an exception.",
    "date": "2020-01-01 16:41:21"
  },
  {
    "review_id": "2yKwXhug5sZMz2lsR_JkdQ",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "Itv_1CMCvUQHAebxmsEzTQ",
    "stars": 5.0,
    "useful": 22,
    "funny": 3,
    "cool": 17,
    "text": "Today soft opening with everything 50% off. The drink is ready to serve. But not all the drink. The dessert also not ready yet. They still in job training for speed and operation. The store clerk fluent in English and Chinese language. \n\nSo far so good with drinks. We got the super fruit tea and the mango mango Pomelo slush. The have slush if you ask. The two items we have is the most complicated. Need time to prepare. I would said they about 4.5 star. We have Moge tea in Orlando Dr. Philip before. We don't like that location tea. But the Moge here did a good job. Even this is soft opening, the flavor, presentation and balanced of taste is there. That is the reason they have high praise. \n\nMy next visit may be tonight while run special. I would go with Creme brûlée milk tea. The mango pamelo slush was well done with cheese in the middle. It make easy to mixed. Love. I would recommend the mango pomelo.",
    "date": "2020-12-18 22:19:04"
  },
  {
    "review_id": "Y0s-LcBMiary3B4cDvSthw",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "7Cecref3HqLLpVLhMB1oTQ",
    "stars": 5.0,
    "useful": 17,
    "funny": 4,
    "cool": 13,
    "text": "Authentic Ethnic Food No. 48 Thai Cuisine.\n\nThai Mama is an excellent food truck who serve very good Thai street food. I like they move their food truck to the new location and look cleaner. It is better access rather middle of no way from previous location. \n\nThe food is ver good and very street vendor like food. We got the steam pork dumplings, as an appetizer which is good. The dish I like the most is the drunken noodles. This dish you actually need them to make it spicy level they like to eat. Because the call drunken in spicy chili. The other dish I like is Pad See Ew. This dish they cook dark soy sauce. But I like they way they prepared the veggies in the noodle. \n\nWe have ventured to try their Panang Curry. It is coconut milk curry and it is very good. The other dish we try is their special glass noodle with pork. I am said this is average dish. \n\nSince this is food truck, you can call earlier for your order. They are out door dining so wear proper cloth for the weather that day.",
    "date": "2018-10-25 01:50:58"
  },
  {
    "review_id": "LnFhxQMhAOLJFpfDrS5nUA",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "tUNa5f2KEauT6DM3hE8ndQ",
    "stars": 5.0,
    "useful": 18,
    "funny": 2,
    "cool": 15,
    "text": "This is one of the kind breakfast place. We like the restaurant because is local flavor. The outside seating is good but if someone smokes, may be inside is better. The host is very friendly. We were able to tell we don't like the seat beginning. \n\nMake sure you ask for the daily special. It is always interesting. We have the country fried steak and chocolate pecan French toast. These are the special of the day. The country fried steak top with meat gravy. It also come with hash browns and two eggs. It also has mable toast. The French toast topping is very special with chocolate pecan overlay. Good sweet breakfast to begin the day. \n\nService is good. I believe they are very good on their food for breakfast and lunch. Coffee is great.",
    "date": "2019-05-13 19:47:25"
  },
  {
    "review_id": "1jW5bOTtfNIb-8QoapD_CQ",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "fII7VVkwvuKLjq3j0C5LCg",
    "stars": 5.0,
    "useful": 22,
    "funny": 5,
    "cool": 17,
    "text": "Review # 2800. Rare Authentic Dessert - 68. This one go to local dessert store service Middle East food. \n\nWe were attracted by their Turkish Delight. We first know about this dessert from Narnia movie The Lion, the Witch and the Wardrobe when they tasted this dessert. The Turkish delight is amazing. Not too sweet but have good chewy and flavorful with or without nut. Not only the dessert is imported, they delicious and fresh. \n\nWe have several dessert. They cost is by weight. We got 1.25 pounds of dessert. It includes the hazel nut and cream, chocolate expresso, banana, and more. I love those strength looking dessert. All of them is delicious. The also has the dessert cookie with pistachio that I experienced in Jordan. They also carry different types of nuts. The chocolate selection also good from Europe.",
    "date": "2021-04-07 14:27:38"
  },
  {
    "review_id": "857gD40V_lCN2vzlwnQS7Q",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "P-TC0VSnUsct3NhYrj5xOA",
    "stars": 5.0,
    "useful": 6,
    "funny": 4,
    "cool": 6,
    "text": "Food is 5 stars. No doubt. \n\nThe restaurant just have the soft open. I would said give them a few week to familiar with the serving routine. It is still a chaos now. Beautiful interior design as a desirable to sit down and enjoy. Service is still need to improve. \n\nYou know if a restaurant will make it or not by just tasting the food. This is the restaurant I will repeat in the future. Food is very reasonable price and easy to select - may be not - it has huge selection. I love it. It make me to come back for more. They have good food presentation. Nicely decorated. Fast food chain of America, watch out, I can eat better food here. \n\nWe start with our entrees with Thinh An Special Noodle Soup and the Hue Style Beef Noodle Soup. I like the Thinh An Noodle. It has the clear noodle soup with seafood in it. Very good soup. My wife have spicy hue style beef noodle. Good but I like the special better. Then we move to the grille pork summer roll -  the appetizer. It is good. \n\nOur desert is what I search for some time. Hong Kong Waffle. They call it egg puff waffle. The waffle is puffy and crispy. Right baking. It come with two scoop of ice cream and two topping. I have the mango and coconut ice cream with assorted mochi and the blue berry mochi. Delicious. \n\nAdvice for the new comer. Come early at dinner before they are busy, get all the order in earlier. For the owner, I think open late and closing late is better. Breakfast usually don't get much sale. Usually people get one item and leave. Dinner people tendency to order more and get more sale. I will update on next visit.",
    "date": "2016-06-25 01:24:57"
  },
  {
    "review_id": "j3m9Hu1y4KUV-NY6iPurcA",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "wf0yPZRvfmkrvhJ6mf6O6Q",
    "stars": 5.0,
    "useful": 3,
    "funny": 2,
    "cool": 3,
    "text": "No. 400th review. This is a UYE worthy restaurant. You know it is a good restaurant when you take the first bite. This is actually rediscovered restaurant when my wife have a conversation which restaurant has pierogi polish food. \n\nThe restaurant is part serving food restaurant and part grocery store. We follow the recommendations of friend review to order the Two for Thirty dish. This dish come with every combination with sampler of the restaurant menu.  It includes the pierogi, staff cabbage roll, grill pork kielbasa, potato pancake, pork schnitzel, two soups and desserts. It is very good value.  The pork schnitzel is deep fried and top with sauce. That sauce has fragrant smell and I am impressed by the cooking.  \n\nThe soup we have are Borsh and the tripe soup. The Borsh in the red beet broth with small pierogi. The tripe soup is pressure cook and soften. They are delicious for the soup.  The dessert we have are the coconut banana cake and the poppy seed cake. Both of the desserts are super good.  And we have left over to take home.",
    "date": "2015-10-03 04:45:32"
  },
  {
    "review_id": "L6rI5oUfqfbihQxzvqluoQ",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "Hi2ADMI1_BEahkXRP4lcjg",
    "stars": 5.0,
    "useful": 6,
    "funny": 5,
    "cool": 6,
    "text": "The classic historic building where Bernini Italian Restaurant display some the historic value of the YBOR. We set this night to check it out first time. The interior dinning hall is a beautiful setting with two story high ceiling make the open space very pleasant. They also have the up stair siting which increase the capacity of the restaurant. They have bar with TV for the single dinner or people who wait for the table. Atmosphere is great.\n\nWe have started with the Beef Carpaccio. The thin slice of the beef to be pick up and set on the white truffle and a touch of balsamic vinegar. This is delicious. Our entrée are Blacken Atlantic Salmon and Crispy Duck. The salmon serves with spinach and zucchini. I like the lemon butter sauce that accompany the vege. the salmon grill with blacken at top of the salmon that make the taste desirable. Some improvement can be made on how to prepare the blacken side. Like the beef can be cooked for well-medium-rare, the blacken also can be prepared lite spicy-medium-black spicy. This can give the customer a choice of their familiar taste. The crispy duck is definite the go to dish. The duck is debone to only three bone left -wing, two leg bone. This make the dinner easy to consume. The dish serves with mash potato and the duck top with the gravy. The skin is very crispy that make the name of the dish. The duck meat is great and softly prepare. I have try crispy duck with orange sweet sauce, five spice crispy duck, pekin duck. But duck with gravy is first time. We end our evening with champagne raspberry sorbetto. The sorbet is great. By pulling the champagne on top of the sorbet that create the bubble sensation of the taste. The dinner end with creative dessert is making the dinning perfect.\n\nToday we came before 7 PM and they have the entrée for the half price. It is a steal. Even after 7 PM, they are also good due to the amount of the food was given. The quality and quantity surely make the chart. The service is perfect for the night. Certainly will be back. They deserve the five star rating for tonight. The half pricing make it to the top.",
    "date": "2015-01-16 02:47:16"
  },
  {
    "review_id": "1lQ9VjDrlBHN5Q3RmRMLzw",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "wA-oDO8OIzj57hApQW_XXQ",
    "stars": 5.0,
    "useful": 7,
    "funny": 1,
    "cool": 4,
    "text": "This may be the best Carrabba's chain restaurant in the Tampa Bay Area. There are number reasons they are good. The skill chef, attentive serving staff, wide seating area with good decorations. \n\nI have here for event and also come here to eat in person. I like their chef because they paid attention to the detail for the food. We started with the mussel in white wine butter sauce. The mussels was clean and not have any sand particle. The chef has good skill to cook this dish that the mussel meat just tender and soft. I have seen many chef has over cook the mussel but the here is very good touch. \n\nThe entrée are 6 oz sirloin and the shrimp and scallops linguine alla vodka. This sirloin was well prepared to the temperature I have ordered. The seafood linguine was well prepared. I like the large shrimp and large sea scallops. Good selection on the material. The dish make excellent mark.",
    "date": "2017-12-20 05:35:32"
  },
  {
    "review_id": "TahV87nbffkY8KMY3O-Jpg",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "wPCp5k8UqTNHaTE67ThYqw",
    "stars": 5.0,
    "useful": 14,
    "funny": 4,
    "cool": 14,
    "text": "This newly open restaurant was posted a drink from my friend which very attractive. I decided to visit it within a week from her post. The restaurant has a stage for the musicians. It has music entertainment, bar and food. Please check on their Facebook page for show schedule. Some day includes salsa and swing dancing if you want shake off you hip. \n\nThe food we order have some Peruvian and some Columbian cuisine. We started with Leche de Tigre - raw fish and cook shrimp in lime juice. The raw fish is in bit and small pieces. I will prefer it to be dice. Or slice. Shrimp is cocktail size. \n\nOur entrée are Bandeja Paisa Colombiana. This dish has many items. It includes grilled steak, fried Pork Belly, sausage, fried egg, rice, fried beam, fried sweet plantain. It is parade of food. Great taste for each items. Our second dish is Pescado A Lo Macho - fried filet fish as a base and with sautéed shrimp, octopus, squid, and mussel in seafood broth tomato base sauce. I like the sophisticated cooking. It make it interesting. \n\nThey have army of wait staff. Easy to get attention. Their staff can speak clear English which make easy to order. Food is good, service is good, great experience.",
    "date": "2018-03-19 01:37:04"
  },
  {
    "review_id": "0iLo3ZxfimfLqGU517IzEg",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "exuQOZA1tvlZbCiheUs1Eg",
    "stars": 5.0,
    "useful": 20,
    "funny": 5,
    "cool": 14,
    "text": "Finally St. Pete has a good enough poke. I like Chai Mixology has serve poke, wings, and boba tea. It is cute store at central avenue. \n\nThey serve poke that you can do your own or you can get one that pre set for you. We go for their best seller pre set - Mixology Poke. This is salmon and Tuna as protein. Including the seaweed and ginger. I like they add extra sauce on the side if you needed. Also extra salsa. The fish is firm and the piece was cut big. They were generous on the protein to create happy customers. Good strategy. Now day we have so many poke place open. This will be good sign for better and more protein. \n\nThe store clerk was very friendly. Definitely will visit them on next time I am in the neighborhood. Enough poke to fill the stomach. I will try their boba next time.",
    "date": "2019-09-25 09:50:31"
  },
  {
    "review_id": "KPNvfnMXyMacK2ak8odqCQ",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "qc-xhHvmyzyrBAOZUeleig",
    "stars": 5.0,
    "useful": 4,
    "funny": 0,
    "cool": 4,
    "text": "I am having easy day off. As a result, we chose a restaurant with lunch special during weekdays only. This restaurant has been in the Bay Area for a year and I saw Anna M. has carry out from this sushi restaurant to watch the movie at home. We decided to try her cinema sushi bite. \n\nThis is actually mixed of Korean and Japanese sushi restaurant. Our lunch special is perfect here. We have ordered the Kahlbee lunch box. It came with 4 pieces of California rolls, 3 pieces of sushi (tuna, salmon, and white fish), vegetables tempura, white rice and the main item Kahlbee - the Korean BBQ with short rib. I have been eating many lunch box special with California roll. This one has some Masago (fish egg) on top and makes it nicer. The Korean BBQ is grilled to perfect. The meat is tenderized and they not over grill to charcoal. Perfect meat seasoning. \n\nWe also order the lunch special for additional two rolls with total less than $10. The spicy crunchy tuna and Unakyu Roll (eel roll in eel sauce). I prefer the seaweed to be wrapped outside than inside. The reason is the roll receives crunchy seaweed on the outside than soak and wet to be wrapped inside. The crunch tuna is delicious. They make good use of tiny pieces of tempura chips. Some use the crunchy noodle but I like this restaurant use the tempura chip is more authentic. \n\nThe service is good. The restaurant did give us a special with 3 small Korean appetizers - Kimchi, fish cake, and egg cake. I love them all especially the fish cake. I would recommend for the lunch special and you can try variety of food with affordable price. I also like the combination of Korean food and sushi.",
    "date": "2015-07-28 20:32:45"
  },
  {
    "review_id": "Bcyu8wkQFMBZXZcxdH59TA",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "RLRTakpA-jtBsurYHjZRRQ",
    "stars": 5.0,
    "useful": 6,
    "funny": 1,
    "cool": 6,
    "text": "If you count the value, traditional, authentic, good dining at dinner, I would said 5 stars for this restaurant. I have been to this restaurant 5 year ago and it does not give me an impression of good Vietnamese cuisine. \n\nI have read many of my friend review about the pho, it is not the best. Why we revisit. I saw Joel review on the vegan food and decide to try it again. After I have read their menu, we discover the dishes that not normally serve in Pinellas Park Vietnamese hub. You need to navigate to their house special. Tonight we have a dish that we have try in Hanoi and did not see anyone doing it. The chargrilled fish. It is the grill fish \"Thang Long\" style. The fish is marinated with turmeric and baby dill. This dish we found at the street of old town Hanoi. Now we know they have it. \n\nWe also order the autumn roll with fresh roll on grill ground pork. Interesting. We order the the authentic happy pancake with large rice crepe with pork, shrimp and bean sprout. It is very unique. The other dish include traditional Central Vietnam Rice Noodle. This is special noodle of the central Vietnam. That how it got the name. \n\nOverall they are good. I would suggest if you are here, don't try the pho for once. But try their house special menu.",
    "date": "2016-03-13 01:30:16"
  },
  {
    "review_id": "oQAi72HvVh8Tm_tJmmEvDw",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "fKWKw4Q7xS47CIhOipNWUg",
    "stars": 5.0,
    "useful": 15,
    "funny": 3,
    "cool": 16,
    "text": "Yelping 2400 -- Rare Ethnic Cuisine 59, Haitian Cuisine. \n\nAlthough they receive five star, they are actually 4.5 stars in my book. This restaurant is a take out place. Not sitting area or dine in. I was wanting to try this restaurant when they just open. I want to be the first review but some one beat me to it.\n\nI got the goat in the sauce. This is goat with creole sauce. The goat is a bit smelly which mean the process do not include like soak in the milk to soften the smell. But the dish is still good. The second dish is the griot -- it is fried pork. This is popular item of the list. They have good fried systems. All dish come with rice and fried plantain. The rice have a choice of white rice and bean, mixed rice and bean or black rice. I would recommend the black rice. The black rice is actually their specialty. It is a mushroom rice. Very delicious. \n\nYou need to be a little patient to come to this place. Because they cook all food right there. So it requires 15 minutes wait minimum from order.",
    "date": "2019-12-28 20:20:19"
  },
  {
    "review_id": "NGr0mSAKvHKxDkRFZXKiXA",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "UNIkpdktP0t3lIwakAjlnQ",
    "stars": 5.0,
    "useful": 24,
    "funny": 8,
    "cool": 22,
    "text": "Authentic Cuisine #61, Moroccan Cuisine \n\nWe have been to Morocco and find this place is close to the cuisine we have tasted in Morocco. I like the Tanger sauce they have put over the rice. The use of spice is very similar. It is definitely a recommended restaurant to visit. The few things that I would comment on the restaurant. 1. Employees should use mask during pandemic. 2. Serve real plate instead of styrofoam box for the food if customers dine in. Other than that, they are great restaurant and good service to the local. \n\nWe order two plate from chef special. The first dish is the Le Carnivore. This is the grilled skew steak and chicken. The steak was process and good tender. The chicken has the marinated spice into the meat. The hummus is like soft like the silk. They must take time grind and prepare this hummus. The Morocco shlada or \"salad\" is well prepared. Love it. Our second dish is the mermaid. This is grilled salmon and skew shrimp. This seafood combo dish. The shrimp is large and the fish is good. \n\nOur appetizer is one of the best falafel. The coating is fried to crispy. The inside is still green. Similar to the falafel in Morocco. The spice in falafel is very flavorful. Don't forget to order this appetizer.",
    "date": "2020-07-14 23:56:45"
  },
  {
    "review_id": "DbwK3pRJ9X0S2zjy7qmQ5Q",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "VHUNHJtGiPmLffwXO9tnPw",
    "stars": 5.0,
    "useful": 8,
    "funny": 3,
    "cool": 11,
    "text": "#800 Review - Rare Ethnic Food 6 - Asian Fusion  \n\nGot Zen!!!! You will find your food zen here. I was in search for worthy 800 review and find this restaurant. I got my inner Zen to write it. \n\nA successful business need to lean and mean. In other word is efficient and effective. We don't need a hostess for dead weight cost pass to the consumer. This restaurant do not specific has one but able to manage the reservation and scheduling. Does mean they don't have one but integrated the system in the waitress. They also don't need one floor manager which is effective. Not second hand sit around worker. Very efficient. Big applause to the restaurant with good business model. \n\nThe food. Mmmmm good. Very good and reasonable pricing. We have order the Szechwan Cracked Peppercorn and Garlic Steak and the Shrimp Lo Mein. The shrimp Lo Mein is good but the steak is better. The steak is NY Strip with their spice rub and finished on the grill. Then it the sauce with pan fry garlic is added on the steak. Well balance on the taste. Steak is cooked to your order. \n\nThe service is well train on the table side manner waitress. Pay attention to the detail of how to serve. Am I coming back- a big yes. I like to try their special night some time with Peking Duck Feast.",
    "date": "2016-07-02 00:56:12"
  },
  {
    "review_id": "jPSiex6Nokja3daWNGZiUA",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "trdv3x6EWp1Dy30VCh5K0Q",
    "stars": 5.0,
    "useful": 20,
    "funny": 5,
    "cool": 19,
    "text": "This ice cream replaces another ice cream store here before. Due to pandemic, they only allow take out. You can go in the store to see what you like and look at the ice cream you like. They have several selection. Currently they run a buy one get milk shake before 6pm. They also serve the ice cream sandwich. It is using cookie as sandwich. I saw many post their sandwich and look delicious. \n\nI am here for their waffle puff. I think it is the best deal here. I got three scoop of ice cream. We got the rum raisin. The ice cream has rich rum flavor. The next scoop is the black cherry. I got the good cherry chunk. The last scoop is the mocha caramel crunch. It has good dark chocolate candy. The waffle puff is great. It is good puff \n\nThe entire thing is big enough to share. The puff is like a ball. Easily separate with ice cream. Mmmmm. It is good.",
    "date": "2020-07-22 21:54:12"
  },
  {
    "review_id": "1MuolrkKdOApvu7yfXOfLw",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "tvH2qkHp_V-dHkfbSas5lw",
    "stars": 5.0,
    "useful": 19,
    "funny": 8,
    "cool": 21,
    "text": "Yelping 1600, Rare Ethnic Food 42, India Street Food.\n\nThis one go to local restaurant who is the up coming stars in the area. I glad that they do their food like they do it in India. No take a back step to naturalize to American taste. It is India street food and it suppose to be like it was done in India. Only one level of spiciness. If you cannot take it, do not come here. This is not your typical American Indian food. It is real to the conditions which cook in India. \n\nWith that said. I love the authenticity of the food. It is good spice. Marinated deep to the bone. We start with pani puri. It has shell crust outwardly and inwardly fill with cilantro, onion and tomato. This dish comes with the secret liquid to be pour into the opening of the crust. Then you enjoy the whole thing. It is out of body experience. I have the Apollo Fish. It is spicy and good. We also has the peppers chicken. It is very interesting to try it. \n\nTheir menu is extensive. Go find out yourself. The vegetarian side is amazing too. At lunch, they have this Tali plate that is intriguing. Don't forget they have variety desserts. They are delicious. My next visit is definitely try their biryani.",
    "date": "2018-04-01 12:32:03"
  },
  {
    "review_id": "l3W-nNOQlKpE8lt2PEiC_A",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "UfWjaifeYmyldKxlEYI9cg",
    "stars": 5.0,
    "useful": 16,
    "funny": 6,
    "cool": 14,
    "text": "Review # 2100\nAuthentic cuisine # 55. Fusion Venezuelan Cuisine \n\nWe have been here fist time but they close early. It is difficult to visit this restaurant during weekday and you are 30 miles away. Finally we have a chance to visit. The restaurant space is small. So either you have the take out or visit them at odd hour like 2 pm after lunch hour. Because they always jam pack. \n\nOur first course is the 11 chick bowl. Great flavors. However I like the second dish with chick # 8 the Paisa. This arepa has fried egg, marinated beef, plantain, chorizo, avocado. Best combination. I like marinated beef inside. Great meal. Our last dish is sweet corn arepa with sautéed shrimp. The shrimp size is big and worth the money. \n\nWe got the cappuccino top cinnamon powder. Great thick drinks. The rating is 5 due to great pricing, great food, and tasty.",
    "date": "2019-03-30 01:53:21"
  },
  {
    "review_id": "Y2pK_bkdYnWez4s4A8X8bg",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "pqcYTOo8kMYoNt4fjOm_vQ",
    "stars": 5.0,
    "useful": 20,
    "funny": 4,
    "cool": 20,
    "text": "A Korean bar and restaurant that interesting mixed. They have inside and outside seating. We did seat at the bar area to see all the action in the restaurant. We notice the chef is not Korean and they did a good job. \n\nWe started with kimchi pancake. Normal Korean restaurant serve this dis in pie shape. They charge to triangle piece. I actually like their method because easy to bite and enable to fried on all corner of the pancake. My next dish is the beef bulgogi. This sizzling dish has good marinated sauce. I also like the banchan that go with it. It they can expand the number of banchan will be better. \n\nService is ok. On point. The food is impressive. It is good concept to have small menu but do well on it.",
    "date": "2021-05-14 04:59:21"
  },
  {
    "review_id": "K8M2l2Qd5CHzACcCS5Is8g",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "wb6JLGExZ_u0xVRvG3OT2Q",
    "stars": 5.0,
    "useful": 15,
    "funny": 3,
    "cool": 11,
    "text": "The five stars rating is real per the yelper rated this restaurant. It is very easy to locate this restaurant because it is located at round about on the Central Avenue. They serve from noodle dish to sushi stack. Don't miss their lunch special. It is a steal. \n\nThe lunch special has selection from one protein to 3 protein. Protein range from sashimi to chicken katsu. The side included sushi roll to house salad. \n\nWe start with onigiri with spicy tuna and salmon avocado. I like the flavor mixed in. Our next dish tapas sample for two. This tapas dish include tempura shrimp and veggies, seaweed salad, squid salad, chicken pot stickers. Very much sample the appetizers. Our last dish is duck ramen soup. It is quite unique. The roasted duck lay on top of the ramen. The soup base is excellent and tasty. Definitely recommend this dish. \n\nThis restaurant service is good. Definitely will visit again. It is also reasonable in price.",
    "date": "2021-05-25 18:39:02"
  },
  {
    "review_id": "DHG1OfPDOErj-93g2VAq9Q",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "P-TC0VSnUsct3NhYrj5xOA",
    "stars": 5.0,
    "useful": 4,
    "funny": 4,
    "cool": 3,
    "text": "Great to see many Yelper gather and enjoy the fun time together. Thanks to TJ organize it. It was fun to see who like it, who cannot stand the smell or who cannot take the durian straight. \n\nDurian is king of the fruit in Asia. It look very pointy at outside. To open it, find the point of crust tip and hit it the ground to crack it open slightly. Than you can peel break it. Or use screw driver penetrate to the tip and pry it open. \n\nSome said this fruit look like the poop and some said is a golden nuggets. This fruit is either you like it or stay away of it. When fruit ripe correctly, it has an alcohol sweet taste. The sweetness is one of the kind that you cannot imagine. \n\nIf you have durian at home, the people who visited your home will know that since the aroma of the smell will occupy the air space of your home. When the gardener or planter walk under the durian tree, they need to wear a helmet. The ripe durian actually fall to ground and that is the signed ready to eat. You don't pick durian from the tree. You wait until it fall to ground.",
    "date": "2016-08-06 18:05:05"
  },
  {
    "review_id": "M9w9bFFhKWvmJvjj3S0WUQ",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "-xaY1TlMf20Ol9QLcDSU6Q",
    "stars": 5.0,
    "useful": 6,
    "funny": 4,
    "cool": 4,
    "text": "This is the oldest market in the country that founded 1791. Although they are not like ancient time but it offers a lot souvenir, food, hand craft, art, jewelry, drink, restaurant for the tourist. This is a fun place to be if you are looking for bargain souvenir. If you like the vender street food, this is a place to be. \n\nThe market is open air market. Please be aware of the temperature since it is close to Mississippi River and will catch a lot of wind drift in cold weather. The restroom is pack with tourist during the Mardi Gras season. I would advise you to take the restroom at old US Mint. When they are open, they have the cleaner restroom for the ladies. It is just across the street at the end of market. No line!!!!! \n\nThe vendor of art varies from many things. It ranges from clothing to front car display plate. During Mardi Gras season, the venders also located open sky concrete pad area. There are fantastic hand craft.\n\nPlease try their street food like fried cone or roast cone. These may be a must try item and they located at Mother Nature's Cupboard. Some of the venders sell crepe on the order, oyster and crawfish. Looking for special artist item such as one of the artists can bend the wire in different color to make a ring that can fit your exact ring finger size. My wife got a Mardi Gras color ring that is very unique.  \n\nSome of the venders show up after 10 am. And that is the time the tourist show up also.",
    "date": "2015-02-12 18:39:34"
  },
  {
    "review_id": "Wc8S7X8NUc-_zzLoq0XBQg",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "a6J0Jq1GJ6Shk-L10Bp6Cw",
    "stars": 5.0,
    "useful": 6,
    "funny": 2,
    "cool": 7,
    "text": "Buya will be easy to miss while you walking on the sidewalk of central Avenue. If you not look up to the sign, you will pass by thinking this is a bar. This is an interesting place that this store have special to offer. \n\nIn the cold night with temperatures in the low 60, it is good to have a bowl of noodles soup. We saw the menu has some fusion Japanese ramen. It is creative. We order a bowl of Oxtail ramen to share. The waitress is kind enough to bring two small bowl for us. It not cheap but big enough to share if you like. \n\nThe oxtail is braise then pan fried the outside to crispy. The soup is pork base but very different from tonkusu. The ingredients include two types of mushrooms. Soup with veggies and meat in very good harmony way. If you talking about soul of the cuisine, it has one. \n\nService is good and attentive. They at least has good comfortable chair compared to some restaurant we have in Seminole heights.",
    "date": "2016-11-16 00:27:07"
  },
  {
    "review_id": "3TUGaPkbwPqbA5HqBGgU_g",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "_ab50qdWOk0DdB6XOrBitw",
    "stars": 5.0,
    "useful": 5,
    "funny": 1,
    "cool": 1,
    "text": "This will be marked my end of double digit review (review 99). I will start my review by simply saying::great restaurant. Every time we pass by there is a line outside. The wait for dinner is 1 hour average. They don't take reservation. The best way to get to the restaurant is during their opening and during parade. We have found a trick to get to this restaurant. YELP has indicated the restaurant open at 11:00 am, they are actually open at 10:30. I am using this advantage to beat the crowd by 10 minutes to get a seat.    \n\nToday lunch we have ordered the chargrilled oysters, fried crab craw, fried crawfish tail. The chargrilled oysters are season with garlic and salted and cook over the open flame. After you have eaten the oyster, you can dip the bread into the half shell to pick up the remaining seasoning sauce on the shell. Mmmm it is very good. The oysters here are better than the one we have in Florida. They are fresh and big. Somehow the swamp water breeds a better oyster. The fried crawfish tail is great to go with the beer. The fried blue crab craws are much better in this case. It is heavenly good. We were joking may be order to go order and sell with double price for the people who are waiting hour in line. \n\nSince they are open for lunch at 10:30 am, it is consider brunch. You actually can skip the breakfast at Cafe du Monde and come here for better food experience. I have pick this restaurant to be one of the best in New Orleans to close my double digit review.",
    "date": "2015-02-11 03:14:28"
  },
  {
    "review_id": "wsTTo_tjeWvWAdOAZOmYDw",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "8LUR1SJd-Va6x_TQBIYZdw",
    "stars": 5.0,
    "useful": 25,
    "funny": 8,
    "cool": 22,
    "text": "These one of the few healthy store around the soho area. For the New Year, everyone is conscious on the intake of the food. New Year resolution play the major part of the goal this year. Soho Juice can be a solution to your goal. \n\nThe have the healthy meal bowl that you can take home. Their juice program to clean your body also available. It has daily and weekly program. They are expensive. Not sure it worth the money. The product they carry include juice, meal, soft serve, Acai bowl, and more. I saw they have display gluten free, sugar free, allergy free, guilt free donut. Except they are not free of charge. Haha. \n\nWe got the swirl chocolate and vanilla. This is special chocolate make with nothing taste like chocolate. But it is healthy. Our topping is the blue majits. It is actually blue honey. The entire soft serve is flavorful. Love it. It do not carry food coloring which stain your lip. They are actually 4.5 stars in my book.",
    "date": "2019-01-13 20:50:38"
  },
  {
    "review_id": "f_HQOWsUD2hSlj63dt3LOw",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "eltuhV8KTDIhqdYgAyknAw",
    "stars": 5.0,
    "useful": 25,
    "funny": 7,
    "cool": 23,
    "text": "It is adding a twist into this location. Today I found out they have added Token Ramen. Now we can call them street food of Asia. Kung Fu Tea already has the Taiwanese street food and drinks. Now by adding the ramen, they become my recommended visit restaurant. \n\nThis update review put the restaurant to 5 stars because they are only one I know for Kung fu tea has Ramen. The chef here already has good skill for the Taiwanese food in compare to many Kung fu tea I have visited. I like the lunch special and the chicken nuggets. Those are the best. Now they added the ramen. I got the tonkutsu broth ramen. The soup is thick. It is flavorful. Love it. \n\nThe area is big and accommodate a lot people including the patio seating. Service is good. I also like their boba drinks.",
    "date": "2019-03-26 15:57:48"
  },
  {
    "review_id": "iwctza1X48zJl8jZ9UaArw",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "8jM0JhB5abhNs3YqJBmwGQ",
    "stars": 5.0,
    "useful": 18,
    "funny": 5,
    "cool": 11,
    "text": "Rare Ethnic Food 43. Caribbean Smoke Jerk Cuisine. \n\nUsually you will see Jerk BBQ chicken. The chicken mostly grilled. This one has a twist with Caribbean Smoke Jerk Chicken. The chicken is marinated with the special house sauce. The marinated is to the bone. It was greatly prepared. As a result, when they are out of food, they close for the remaining day. They also has Smoke Jerk Pork. Both items are very delicious. I like the chicken wing a lot. I would said you got to eat there. Because, when they just take out from the Smoker, the skin is still crispy. That why you need to eat at the table or in your car. DELICIOUS. Now with that said. Some time by luck, you can have their specialty rack of lamb. My goodness, those are amazing. Check out my picture. \n\nDon't get disappointed if they close because they run out. I have actually try visiting this place three times before I actually got to try their food.",
    "date": "2018-05-22 01:17:25"
  },
  {
    "review_id": "FZBl2-1Veggqw3EGaxSIWw",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "kA82NPdwYw6LvMRuBuXRjQ",
    "stars": 5.0,
    "useful": 17,
    "funny": 8,
    "cool": 19,
    "text": "Great shave ice. Why....  it does not left the food color at you tongue. I like it very much. This store is about 4.5 stars not full 5 stars. If the service can have the smilies face to customers, probably 5 solid stars. \n\nThis is a food truck in front of the plaza parking lot. I like they take an effort to fence it and decorated with plant and straw like umbrellas. It is good effort. We got Hawaiian Rainbows with passion fruit ice cream. It is definitely good for the picture. The shave ice was pile on the cup. The best thing is the color fruit flavors syrup was pull to bottom of the cup. Some other place they don't give enough syrup and the bottom shave ice did not receive it. Not this place. \n\nThe passion fruit ice cream is unique. They have some other flavors I like to try next such as Allota Colada, Green Paradise, Onalicious.",
    "date": "2019-03-25 13:32:51"
  },
  {
    "review_id": "KmRyQ9SQ2N7rTRA38EVrVw",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "XupqzjOerK3DcIoWWIKslg",
    "stars": 5.0,
    "useful": 17,
    "funny": 5,
    "cool": 11,
    "text": "Rare Ethnic Food No. 21\n\nIf you have been to Asia night market especially Taiwan or China, you will find this type of food. I am glad that Temple Terrace has established this restaurant that have this capability. This is classified as a street food. They are savory and good snacks. \n\nWe are here for snack that is close 9:00pm. They have two type fried chicken. Fried chicken fingers or chicken row. You probably understand chicken fingers. Chicken row are fried bread chicken breast and cut into pieces. This is my favorite. The breaded coating is not normal flour. It is crispy and the Chinese spice is in it. They are very good taste. \n\nThey also have curry items. But I am interesting on their pig feet, cool tilapia, and the Szechuan Sweet pork rib. I may have to come back to try it. \n\nI am excited to their price also. $3.89 for one whole box of chicken row. Very affordable. If you select the meal, you can ask the spring roll for the side and a soft drink come with it.",
    "date": "2017-01-26 23:35:52"
  },
  {
    "review_id": "GqV9bArb9D6uPIb9lFhJ9g",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "v66ZTl8tOGWQs-Z6BJOEcA",
    "stars": 5.0,
    "useful": 26,
    "funny": 11,
    "cool": 27,
    "text": "It is strange to name the restaurant four brothers. I wonder which brother. They have southern, middle eastern, Italian, pastry. I wonder each brother are different in cultures. This concept is definitely well accepted. \n\nPredominantly this is middle eastern food. We got the whole rusted chicken with two side. The chicken is marinated with yellow spice. It was split to half and grilled to perfection. I like the chicken with juicy meat. It is wonderful to eat. The side is amazing. We have dirty rice and baba ghanoush. The dirty rice has ground meat and sliced gizzards. Very interesting. \n\nThe gyro is good. Not particularly impressed. If I visit next time, I would try their grilled snapper. It look interesting. This restaurant is 4.5 stars. Because the price match the food given.",
    "date": "2018-12-08 02:40:24"
  },
  {
    "review_id": "PIpiZRZyeCsBZCHpT-SQRA",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "KvXcUof9CictI9nNe2oSLw",
    "stars": 5.0,
    "useful": 15,
    "funny": 3,
    "cool": 13,
    "text": "It 4.5 stars not yet 5 stars. The reason they are good rating due to good pricing, good food, good ambient, and good service. It popular among the local. \n\nWe start with spicy crunchy roll and eel roll. It it decent with 8 pieces each. Fish is good. Spicy tuna also good. We also got one of the specialty roll. It is the scallops volcano. The bay scallops was on top. The inside is the crab tempura. We also got a bento box sushi. It has 4 pieces of fish sushi, California roll, goyoza, rice and salad. \n\nOur experience here is great. Love the. We will be back.",
    "date": "2021-04-24 15:34:52"
  },
  {
    "review_id": "Et1qJaUpKImBz4yNi14vpA",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "8lpTYRm6O_3k8b_KDOJL1Q",
    "stars": 5.0,
    "useful": 15,
    "funny": 6,
    "cool": 12,
    "text": "This food truck live up their name as Gastrotruck. The Korean cuisine is exquisite. I have a chance to visit this truck due to festival. During the Tampa Japanese Summer Festival, their truck is one of the food truck show up. \n\nTheir menu is simple, Kaarage $10, Chicken Teriyaki $8, Okonomi Tot $10, and the Gyudon for $11. All this is actually Japanese street food. I am appreciate they try to change their cuisine just for the festival. In fact, those dishes is quite good and colorful display. We got the Kaarage. This dish is chicken marinated in sake and soy sauce then deep fried with coating. They are quite good. The accompanying slaw also good. What a treat. It come with 5 big pieces chicken. \n\nThe order to wait for the food is less than 5 minutes. They have enough man power for the food preparation.",
    "date": "2018-06-24 01:41:02"
  },
  {
    "review_id": "5sa3-9RxR4O3rUkEzP2N_g",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "f6IWrBC5CK-pBF6EVUTiLg",
    "stars": 5.0,
    "useful": 12,
    "funny": 2,
    "cool": 11,
    "text": "It is about 4.5 stars in my book. It does bring something fresh to the community. Is it an art, ice cream, or beautiful treat? All of that. \n\nThey have the gelato and ice cream section. I would go to the gelato because they are more interesting. We taste many flavor. I got the banana foster and bourbon gelato. This two flavors is excellent taste and not find elsewhere. Then you can choose the type of make up or just regular cone. For the experience, I would go for the makeup cone they have. We got the clown cone. This is with cotton candy. We take a part and eat those separately. \n\nBy the way, extra scoop is only a dollar more. The clown cone is $7 and extra scoop make it to the $8. Not cheap, but they give good quantity of gelato to make up the price.",
    "date": "2018-07-29 11:48:58"
  },
  {
    "review_id": "1MRibPKdsQEX7ebFfrbgtw",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "C3RFTpNj8_4Yz9gtmGeH5Q",
    "stars": 5.0,
    "useful": 16,
    "funny": 2,
    "cool": 11,
    "text": "I like my time here. I would say this not a true 5 stars restaurant but very close to 4.5 stars. The place is cute. Two dining rooms setting. I was not going to have the high expectations. They have very good lunch special Monday to Friday. Approximately $9. Great deal. \n\nI did not go for the lunch special and go straight to one of their best dish. The cuisine is very similar to Black Forrest Germany cuisine when I have visited the Germany. I got the Schweinshax'n (pork Shank). It come with sauerkraut and bread dumplings. The sauerkraut was excellent. The dumplings is interesting that come as a cake pieces. \n\nThe shank is braise and over roasted. They have lite seasoning outwardly. It is a big chunk. Great for hungry people. The pork sauce is great accompanied the bread dumplings and the pork shank. \n\nWhile I visited there, many have order the lunch special. Definitely a go to menu for lunch.",
    "date": "2018-08-07 05:08:57"
  },
  {
    "review_id": "iV-fKJoLnOMw27eEDL79Gg",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "wFFHt-ixlw_3kZ6kfioMMA",
    "stars": 5.0,
    "useful": 3,
    "funny": 1,
    "cool": 3,
    "text": "Rare Ethnic Food No.12\n\nThis is the series of five rare ethnic food at every 100 review I have made. I have selected Byblos due to their unique decorations and the unique cuisine Lebanese Cuisine.\n\nMiddle Eastern food is alway heavy in spice, marinated technique, and grilled timing. Byblos has these technique in high standard. I have the lamb chop and my wife has a mixed grilled. The lamb is the bone in lamb that is well cut and perfectly grilled. The marinated spice is well deep into the meat. This dish is my favorite. My wife have the mixed grilled. They are good also. But after you have the lamb, you will feel the lamb is more superior than the sheik kabab. \n\nThe room is well decorated. Each room has it own character. The outside sitting include fire pit you can grilled you own. The interior include formal dining hall, bar area, private drape room. \n\nThe service is good during lunch time. The lunch is certainly more affordable, but the dinner portion is a lot larger.",
    "date": "2016-09-06 08:30:02"
  },
  {
    "review_id": "iTb8blfOZJ4KWPgsJTK5dA",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "KdAWjL9MKjpJzEeI902qBA",
    "stars": 5.0,
    "useful": 19,
    "funny": 6,
    "cool": 20,
    "text": "One of the treasures in St. Louis at The Loop Neighborhood is this Chinese restaurant. It is great to visit them if you are in St. Louis. They have boba tea and hand pull noodle. My wife like their hand pull noodle. I also like the boba or smoothie. I like the mung bean smoothie.\n\nWe begin the handmade wonton in chili oil. This dish dumplings is great. Love the chili oil and the wonton skin. Our second dish is their special beet dry handmade pan-fried lamb and cilantro dumplings. Just the name you already know this dish is special. I have not seen anyone serve this dish before. Because of the beet, the dumplings look red. Very interesting. \n\nOur last dish is the Pepper Chitterlings. Great wok technique with soften chitterlings. Great dish to go with rice. I enjoy every bit. The service is great. The food come out quick. You can see the chef hand pull the noodle and make the dumplings.",
    "date": "2019-04-11 01:41:13"
  },
  {
    "review_id": "IMbZehS-eABNUbbwMaEgIQ",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "xBAieAvUBy4xKE3hBAawbg",
    "stars": 5.0,
    "useful": 22,
    "funny": 8,
    "cool": 19,
    "text": "My second visit is pleasant. This time I am sit down have snack at dinner. I believe they are 4.5 stars restaurant not full 5 stars. Although I didn't try their ninja chicken nuggets again, but we do try fried calamari and the the black garlic ramen. They finally have the token ramen with newest ramen dish. Black garlic is one of the kind. It has the black sesame oil with black garlic on it. It is delicious. The calamari was fried very good with good coating. \n\nThe reason they are upgraded is I make a challenge to their boba team. I ask a drink that partial in the menu but not totally in the menu. They have winter Mellon milk tea. I ask if they can do the slush. They said they have not done that before. But they will try. End up it is good drink.",
    "date": "2019-10-21 16:02:04"
  },
  {
    "review_id": "NpmBwsQmwiXZRP_4cN79wQ",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "tZe5mvS13mPy0rk5ltuR9w",
    "stars": 5.0,
    "useful": 8,
    "funny": 2,
    "cool": 6,
    "text": "I like Sandra. It is about 4.5 stars. If you come here, I recommend to get at least one link of their homemade sausage. This item is must have. They do have a table on the outside and few table inside. \n\nThey do have combo meal, sandwiches, dinner plate and more. If you really want to try everything, they have built your own by pound or pieces. I like the build your own because I can try everything - pull pork, brisket, rib, chicken, catfish, sausage, rib and sides. The rib, chicken and brisket are delicious. The sausage is the best. \n\nThe price is moderate. It is worth the money because of the taste and experience. If you like southern BBQ, this is a good choice.",
    "date": "2021-11-20 17:17:28"
  },
  {
    "review_id": "SxgvlDD25RCs5k0SeWEWDQ",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "Hj68GMB1E31JRtm5DbQcPA",
    "stars": 5.0,
    "useful": 12,
    "funny": 1,
    "cool": 10,
    "text": "Rare Ethnic Food #71. Tunisian Sweet. \n\nIt is about 4.5 stars. I were here several time and they close for irregular hour. And pandemic. Finally I got to visit their store and try something that rarely found in the Bay Area. Tunisian sweet is temptation delight for the Mediterranean people. It is a good item for for tea time and more. It a crazy good sweet food but not too sweet. \n\nWe have several interesting look sweet that is my first time try it. This sweet includes Chaba Kia shape like honeycomb and taste like rose water. Makroudh with dates infill item. Youyou like small sweet donut.  Ghrayba Hommos with hazelnut. The best is the pistachio cake. They are quite famous for that. Must try. \n\nOverall the experience is good. I can see to get use to it. Definitely come back for some other items.",
    "date": "2021-07-28 18:28:24"
  },
  {
    "review_id": "bIxa6HzxnTtMcT3sG3uWNg",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "tP-AlhGZYzqyr0CouTCmUg",
    "stars": 5.0,
    "useful": 7,
    "funny": 7,
    "cool": 8,
    "text": "Old school restaurant. They don't take credit card. However, they take check or cash. They also have no web side. This is a 4.5 stars restaurant since they don't take cash. However the food is good consider the good time per the name of the restaurant. Yelp don't have 4.5 stars. 5 stars is rated. \n\nFood cost is in the high side. There is a value for the art of cooking. The sauce and culinary art is good. The meat is well prepared. Tonight we have dinner with friends and I have the New York Strip with special gravy sauce - spicy Madagascar green peppercorns sauce flame with cognac. It came with sautéed mushrooms, green bean, potatoes. The mushrooms is well cook and brown.\n\nMy wife have the duck with cherry sauce. This is their signature dish according to Nick grandma. The duck is well braise. I like it when the meat is separated from the bone easily. This dish accompanied with green bean and rice. Yum. \n\nService is great. Next time I will have the beer since they brew it since 1292.",
    "date": "2015-12-05 18:57:22"
  },
  {
    "review_id": "TjHqwrAughhj9rZtXBgLBw",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "HqgMCVe-jvlP0kT93M_5Sg",
    "stars": 5.0,
    "useful": 8,
    "funny": 3,
    "cool": 8,
    "text": "Best value for NOLA food. \n\nMany of the menu item is fried but they are wonderful to try. I guess they got their name Crispy because the crispy fried items. This place is in my book mark for some time. Nick first go to this place without me. Now I come with him for the redemption. \n\nSince this is our fourth restaurants to visit today, we order something good for munch. We have Cajun fried gizzards, crispy catfish, Orleans beignets, and seafood gumbo. The best is the gumbo. It has good taste here. If you are here, just order one without sharing. Have it all for yourself. \n\nI like the catfish and the gizzards. The catfish was nicely batter and fried. The gizzards is soft and easy to eat. This is special item that not serve in normal item to many restaurants. \n\nThe owner of the restaurant is nice and she know her cuisine. If you are here your soul for seafood gumbo will be retained in this place. Good luck.",
    "date": "2016-01-22 01:33:44"
  },
  {
    "review_id": "ghtYm4UvzHcqek3qOoV9qA",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "aurSXIlX86Ob94kYvSSDPw",
    "stars": 5.0,
    "useful": 8,
    "funny": 1,
    "cool": 9,
    "text": "This restaurant has some characteristics on the Thai cuisine. If you like very authentic taste, this restaurant has some. We like it because the material use on the dish is unique.\n\nWe have order the Tropical duck and grouper special for our entrees. We have the winter shrimp as appetizer. The winter shrimp is a good value. Most of the restaurant has this dish with one shrimp and tail. This restaurant has the whole roll fill with shrimps. \n\nThe tropical duck with the meat fried to crispy. It has tropical fruit such as pineapple and lychee. It make it interesting but not wow me. However, they are good enough dish. The dish that wow me is the special grouper. It has a root slice item and green string like the lemon grass flavor. I couldn't make up the name of the two items. But they just make this dish so unique. \n\nI like the food of this store. Service is average.",
    "date": "2016-11-03 22:58:25"
  },
  {
    "review_id": "IP_j993TBHiBudppbgtrKA",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "BZyxr4ocl1hJvFvhlogz0Q",
    "stars": 5.0,
    "useful": 3,
    "funny": 3,
    "cool": 4,
    "text": "It is my honor to introduce you the small business sandwich shop that is one of the top of my list. \n\nI have read many reviews for this shop and learn about the abbreviation of SSSS for name this shop. You also can said it translated to Sophisticate, Satisfaction, Special and Stylish sandwich. This four words are truly represent the food serve there.\n\nWe are trying their new sandwich that is not in the menu yet. We have the Arcade. It is quarter pound seared Ahi Tuna on the pretzel bun. The tuna is well seared on the out side with toasted sesame seed. The sesame seed was prepared very nicely with crispy and crunchy. It top with marinated sea weed salad and sriracha mayo. This sandwich is a keeper can be considered in the regular menu. Very sophisticate and special. It also come with a choice of side for $10.99. \n\nIt you visit the shop, you will see the took picks on the ceiling. These took picks are the left over from sandwich. It becomes a transitional for this store. Service is friendly, food is good, price is right. They deserve to be 5 stars.",
    "date": "2016-09-03 23:29:34"
  },
  {
    "review_id": "aEV0YFBt49kVpUau_U1r4w",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "VCGOGpOYnomj7o2qeVHHiA",
    "stars": 5.0,
    "useful": 3,
    "funny": 2,
    "cool": 3,
    "text": "I come to Twennie home town but she has not review this place yet. I am surprised that I am reviewing ahead of her. \n\nThe Tasty Pho is a very comfortable place to be compared to many Vietnamese restaurant in the Bay Area. Modern looking interior decoration and nice to eat and hangout. I forgot to ask if they have the Wifi. \n\nI have order the combination Tasty Beef Noodle pho and grilled shrimp sub Banh Mi Tom Nuong. The Tasty Beef Noodle is combination of slice beef, beef flank, beef ball, beef tripe and beef tendon. I like this noodle soup due to the tripe and tendon are big and whole piece. The soup has a bit of minty taste. The grill shrimp sub is sub is best one I have. The shrimp is include a bit black pepper and they are grill to perfection. The bun is toasted and crispy. Therefore they are easy to bite. \n\nOverall the experience is great. Like the pho and Banh Mi. Services is great and the interior is great.",
    "date": "2015-09-22 04:17:08"
  },
  {
    "review_id": "DNE4lexG7JDfe1vrjmGzdg",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "cmvseNCdevDdxbxlz3KkWw",
    "stars": 5.0,
    "useful": 10,
    "funny": 2,
    "cool": 9,
    "text": "The word for this restaurant is NOLA cuisine. This restaurant simply the best in Tampa Bay Area for serving the NOLA cuisine. We love our time here. The service is a bit slow. But the food are excellent. This place has vibe. If you come before 11:00 am order a drink, the beignets is free go with the drink. \n\nI like bar area. It has tight cool bar. This is a tiny place. The most you can seat inside is less than 40. Time to time they are pack. We have ordered beignets, Andouille Sausage, Red Grouper Bite, and the Seafood Gumbo. The beignets is just ok. But the rest of food are delicious. The red grouper is fresh and chunky. It accompanied with red cabbage slaw and sweet potatoes. This come with 4 different sauce. Yummy to try. \n\nThe Andouille Sausage is slice into 4 thin slice. Serves over red bean and Louisiana style rice. The red bean was grind to liquid and serve with whole bean. The sausage is pan grilled to let the taste exhaust outwardly. The seafood gumbo is insanely good. It has shrimp, scallops, Andouille Sausage, crab, grouper, okra, pea. The gumbo sauce take you out of your mind. If someone looking for Louisiana cuisine, I will certainly point this way. \n\nToo good. So try yourself. Mike drop experience.",
    "date": "2017-09-05 00:06:01"
  },
  {
    "review_id": "FfFYGy4XelVj7Yq4Yzuj_A",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "RCrPiI7kcz3VkvdqngWU9g",
    "stars": 5.0,
    "useful": 19,
    "funny": 6,
    "cool": 12,
    "text": "For the lunch, they deserve the five stars. This is about 4.5 stars restaurant. This restaurant is new kid at the block at this southern Riverview. Restaurant location at Apple map is incorrect and I have reported them. The Yelp page was correctly show the restaurant location. \n\nIf you looking for value lunch, this is the place. I have their lunch special with maki lunch. The cost is $9. Two rolls with a choice of soup or salad. I got the spicy tuna and and salmon skin rolls. Both rolls come at 8 pieces. They are good size. I hope they keep it up. \n\nI also go an app Mixed Tempura. It come with two tempura shrimp, four tempura veggies and one tempura broccoli. They have the best broccoli tempura which not over coating the broccoli. Very good technique. The dipping sauce bowl is big enough to accommodate the tempura pieces. Shrimp is great. \n\nI don't need to wait for my food. I finish in less than 35 minutes for lunch. Good value entree and app for $15.",
    "date": "2018-11-30 03:22:34"
  },
  {
    "review_id": "Nd-W9zkuKwjIlK1JqvaQeA",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "wIz_tZ88bj4W3VlrJTiiqQ",
    "stars": 5.0,
    "useful": 10,
    "funny": 4,
    "cool": 4,
    "text": "Mad scientist or creative chef. Do you have to decide the final outcome for the food lab. It is actually experiment food?  Mmmm. Let see the dinner out come. We have our company holiday dinner there with design menu. It is not cheap but very worth for the trip. \n\nOur request menu is a four course night with starting the cold appetizers at the first plate. My wife have the almond coconut gazpacho - it is coconut rock shrimp with Fuji Apple salpicon in green curry oil. This a cold soup. The rock shrimp is nice and creative in the soup. The soup base is not normal gazpacho and is white. It is good. I have the avocado leaf seated yellow fin tuna. This is the best of the cold app. It come green mango salad, aji amarillo sorbet, fish sauce caramel and tamarind peanut crunch. It creative that the sorbet replace the wasabi and the fish sauce caramel replace the balsamic reduction sauce. Now you know why they call themselves food lab. \n\nThe second course are the hot appetizers. I have smoked maple glazed pork belly. It top with hoe cake, black eyed peas, green tomato chow-chow. Usually I don't care about hoe cake but sauce and other ingredients combine, it is great. The pork belly is cook perfectly. If you are not good chef, do not try this dish because it need three part meat harmony. My wife has Serrano ham zeppole. The slice hams were place on top of rosemary doughnuts with compressed melon, Saba and Parmesan snow. Interesting dish. The rosemary was deep fried to crispy with seasoning. I have not have it this way before. \n\nOur third course are the main dishes. I have the red snapper a la plancha. It is fillets snapper with sautéed and glazed on top on avocado coconut grits, baby spinach, mergers marmalade, avocado chutney and mango harissa purée. This best main dish tonight the purée go very well with the fish. My wife has the painted hills short rib 'sancocho'. Usually the Caribbean sancocho is a mix of meat and veggies soup. This is an overhaul design for the short rib with boniato, yuca, sweet potato, and sweet corn, green plantain,avocado toss watercress, and cilantro sweet garlic juice. I only can said - it is good. \n\nThe final course is the sugar crusted butter cake or chocolate peanut butter bar. Both of them is great. I the butter cake because the cake form the caramelized sugar crust on all expose wall. The cake is syrup and is good. \n\nThe only thing is the food take a bit time to come out for the first dish. The rest are good. The service is great. The drink you have to refer to the pic since we don't know what they have created.",
    "date": "2015-12-06 13:35:02"
  },
  {
    "review_id": "1po_YxMO2f7IBNOXoKq-Nw",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "TNTBObKmICMn13T0pyAGyg",
    "stars": 5.0,
    "useful": 9,
    "funny": 0,
    "cool": 0,
    "text": "This restaurant locate at downtown St. Pete close to the museum of fine art. Since this is a Thursday night with museum special deal after 5 pm ($5 per adult, normal $17), after museum, we decide to come to this restaurant. \n\nThe store front is a open bar. The time we were there is about six and they can sit you immediately. After 30 minutes, there is already a waiting line. Please come before six if you don't want to wait for sit. Bella already extend their sitting area with capacity, however if you are late, you will need to wait.  Among all the restaurant at downtown, they are the most reason in price for the food. \n\nToday I order the menu with \"secondi\" category - marinated skirt steak and my wife order the grilled chicken pasta. The item in the \"secondi\" came with soup of the day or salad. This is better deal. The $22 skirt steak came with two side and a soup. Good deal. The soup of the day is minestrone sausage soup. It is bean base, dice tomatoes, dice carrot, and chop pasta in crush tomatoes base. I believe they have added the oregano and basil to enhance the flavor. It make the soup well balance and interesting. \n\nThe skirt steak is marinated with sweet sauce and serve with mash potatoes and grill broccolini. The broccolini is very impress. They broil, grill and stir fry in the process with garlic sauce with a hint of spicy chili. This make the food sophisticate. The skirt steak is grill to your order and slice to the bite size. \n\nThe whole proceed of serving is ok. It is slow in the beginning but it pick up at the end. The extend area may be good for company Christmas party. It deserve for full stars due to to chef cooking skill, service, clean bath room and good pricing.",
    "date": "2014-12-12 01:33:21"
  },
  {
    "review_id": "SY2wgub7usezgqndrag5VA",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "m87qQsq2SMJruE9tVQTIrA",
    "stars": 5.0,
    "useful": 5,
    "funny": 3,
    "cool": 6,
    "text": "Craft Kafe is an interesting restaurant with many flavor. With the restaurant next door to organic grocery store, they can get the fresh ingredients immediately. You also can eat healthy here since they have organic items. \n\nDefinitely stop here for breakfast. I usually not a breakfast person but got to try their breakfast since many reviews indicate they are good. We have order an omelette and two coffees. I have the latte and my wife has cappuccino. I have ask them to decorate the cream in artist way and she did impressed me. Coffee is good and better than Starbucks. \n\nThe omelette we order is the craft omelette. It come with spinach, chicken sausage, mushrooms. It accompanied with hash browns and toss. It is quite tasty. \n\nThe cafe also have other item such as fresh squeezed juice, quiches, vegan pumpkin bread and more. If I pass by here again, I will check them out.",
    "date": "2015-12-12 03:40:49"
  },
  {
    "review_id": "1KC9WP7tXJhf3ws8t2NSwQ",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "JpXCEh8PSgrH4nIHCN9qxQ",
    "stars": 5.0,
    "useful": 15,
    "funny": 6,
    "cool": 13,
    "text": "Agree with Mark for the tasty food and fast service. I think it is more like 4.5 stars restaurant then actual 5 stars. I wonder why they have to be located at Soho area, why don't they locate near USF area to attract more students and the Busch Garden tourist. Soho already has so many restaurants, I think their pricing is good for the students. \n\nI will start with their side selection. They have several selection I like. The roasted vegetables, braised white bean and Greek salad is good. For the Greek salad selection is free with kabab. Other combinations need to add $1.69. Tonight we have the steak and salmon kabab. Both of them is flavorful. The steak is in sweet marinated sauce. The reason they get half stars less due to the meat quality,  it is chewy. The salmon was perfect. It come with zucchini in the skew and the salmon juice dip into the zucchini and make it more sophisticated. \n\nThe price is right. I like they use the actual silver ware instead of plastic ware. The place is typical fast food. Definitely will be back.",
    "date": "2017-07-18 01:12:41"
  },
  {
    "review_id": "rsR52i7Rdf3vUhNv6zm4Jw",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "5zOYg50gWuLkg7vfxjDsEw",
    "stars": 5.0,
    "useful": 10,
    "funny": 1,
    "cool": 9,
    "text": "It is about 4.5 stars for my visit. Round up to 5 stars. We were here about the burger week. They are serving the Jamaican Me Crazy burger. Only this occasion they serve this kind of burger. This burger is top with grilled pineapple, applewood smoked bacon and mango purée. Very tasty. The patty of meat is grass-fed beef. The patty cooked to edge crispy and medium to center. Very good preparation on the grilled. \n\nIf I revisit again, I will try their salmon burger and mushroom and Swiss burger. These two burger will be in my future visit. I also like the burger cook on the order which make the burger really fresh.",
    "date": "2021-11-17 17:48:59"
  },
  {
    "review_id": "NGD2Pk6dx7qXGn2UgUhJLw",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "ysWG1Hwm21UWCSlc_frXBg",
    "stars": 5.0,
    "useful": 4,
    "funny": 2,
    "cool": 3,
    "text": "The super bowl night and we decide to sit at the bar side of the Bonefish Grilled.  The new added menu for the Bar Bites Menu has added another dimension for the order. The items start at $4 to $12. The bar bites menu have 8 selection and some of the selection have two different type of meat. The appetizer has 11 items to select. The combination of the bar menu and the appetizer create over twenty different selection. This is good business model with Tapas mentality that the bonefish management has provided the customer with more choice. It definite makes the top bar in this area. It will attract more customer in the future.\n\nTonight we started with the Lamb Lollipop hops. I have this dish at different Bonefish location and I want to make sure different chef can create this dish better. The lamb chop turns up better at this location. The meat is cook to perfect medium and have hint of salt to make the chop taste better without losing it meat taste. We have order the Lobster Street Taco. My wife like this dish and said it have big chunk of lobster meat and worth the $5 item. We have order a bowl of the corn chowder with crab meat. I will advice you order the bowl instead of the cup when you are hungry or two people in the party that can share this dish. The cup and bowl size only a $1 different and you get more on the bowl. We have gone to the appetizer menu and order the Filet Satay. This is new item in the appetizer. It is a center cut filet mignon in soy seasoning and serves with spicy mustard sauce in tomatoes, cucumber, onion.  The meat is tender and soft. The only down side is each pieces is small. However they are delicious. The next appetizer is Singapore Calamari. The calamari is lightly dry pepper breaded and deep fried. It serves sweet spicy sauce. They are crispy and we have left nothing on the plate because they are insane good. The last item is the coconut shrimp with sweet spicy sauce. The dish has six jumbo shrimp and coated with coconut flake. This is a good value dish and it is less than $9. \n\nWe are stuff after all the items. I forgot to mention the Sunday night have happy hours till 6:30. The wine is $3.25 a glass and the draft beer is a dollar. Can't beat that!!! Our server is super nice and attentive. As a result, tonight we are awarding this restaurant with 5 stars.",
    "date": "2015-02-02 02:22:07"
  },
  {
    "review_id": "dnzYAXtDVYMdVislQVukwQ",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "pwMejZZUizAZ4aOADafVPg",
    "stars": 5.0,
    "useful": 13,
    "funny": 3,
    "cool": 17,
    "text": "This is a grocery restaurant with an interesting ideal. I know the grocery store with restaurant is not the new ideal but a grocery store with great Japanese goods and great restaurants is the first. I would said this is the restaurant to be. \n\nYou can order the food then shop while you wait for your food to be ready. We got a lot Japanese item which cannot be founded in Tampa. For the restaurant we order the chirashi. It is a rice with assorted sashimi tuna, salmon, octopus, unagi, ikura, egg, hokkigai, kanikama, white fish. Very delicious. Second dish we have is the tonkutsu ramen. This pork bone soup is nice and tasty. It has the roll pork belly. Next is my favorite with Cajun shrimp roll. The shrimp is soft shell. It is deep fried to a point the the head and tail is crispy to eat. Basically you cat the entire shrimp with shell and head. The roll is delicious with the Cajun sprinkles. \n\nIt is authentic Japanese food here with a twist.",
    "date": "2018-11-10 04:41:58"
  },
  {
    "review_id": "wcgb55uEb1H9t8OYzwltWA",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "p_qSQwShIgQnNxGcajI4-w",
    "stars": 5.0,
    "useful": 18,
    "funny": 5,
    "cool": 13,
    "text": "It is about 4.5 stars. Not yet 5 stars. This is a place that young and beautiful gatherings place. Great to many young people participating the lunch. With University of Tampa next to it, many students eat here. I like this place because it has variety of shops in one place. They have bookstore, champagne bar, coffee bar, the shop, commerce club upstairs. Very interesting to host many variety. \n\nWe enjoy the restaurant area. For lunch, their food selection is flatbread, sandwiches, small plate, breakfast and salad. Simple but elegant. We got the steak sandwich and tomato prosciutto flatbread. The steak sandwich has a sauce along caramelize shallot in it make the tasty. The flat bread prosciutto is chop piece with pesto sauce which is delicious. Our experience is great. Definitely come in the future. Serve is average. Once the server engaged, we have good service.",
    "date": "2021-07-22 17:18:08"
  },
  {
    "review_id": "1T88M5shwOL-eXXSHFNGrw",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "Fbtcj6j9-byxq68ACKpcUA",
    "stars": 5.0,
    "useful": 30,
    "funny": 10,
    "cool": 28,
    "text": "Yelping No. 2000!!!\n\nRare Ethnic Food # 50. Russian and Ukrainian cuisine. \n\nThis little restaurant just opens no long ago. I already like it very much. It is one of the kind in Tampa Bay Area. You have to experience it for it wonderful cuisine. The restaurant locates near USF which make sense for many Russian students study there. The day we have visited, not many customers. It need great word of mouth to spread a good news. \n\nThe menu is simple and delicious. The display in the restaurant is nice with Russian doll. They have the bakery good next to the counter. The only thing I would complain is the chair is too tight. \n\nWhat is meaning of \"Babushka\". It mean triangular folded kerchief for head or it also mean grandmother. Many Russian doll has kerchief over it is part of long tradition. It also can mean your grandma kitchen. Take your pick. \n\nOur first dish we have order is the Borscht. This is a famous soup with meat, sautéed veggies and beet root. The beet make the entire soup red color. The soup is great during winter. It top with the rosemary. The second dish is Blinchiki. This is a tradition wheat crepe wrap the meat inside. Very unique in many way. \n\nOur third dish is the Russian dumplings. They have three different fillings inside the dumplings. The Lamb, Beef and Pork. We mixed the pork and beef with the soup base. I like the most is the pork. I would suggest order with soup options. The fourth dish is the Syrniki. This is a pancake made from cheese and wrap with meat options. I like this one too. \n\nOur fifth and final dish is the Kotlety. It is three minced meat croquettes with a side. We have chose Russian brown rice\n\nOverall our experience have exceed our expectations. It was marvelous meal we have at the dinner. It deserves a 5 stars attention. I would said you may need to change your taste bud when you come to this place. Many items is less sodium. But the taste still there. Russian like to use the sour cream. But I don't.",
    "date": "2018-12-28 05:07:08"
  },
  {
    "review_id": "WwTzh4Ye3DWGeDPjvtCzoA",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "RT4apxmKb35wLe7pbyjFiw",
    "stars": 5.0,
    "useful": 5,
    "funny": 1,
    "cool": 4,
    "text": "The name matches what they serve. Mr. Penguin definitely a cold serve. We are welcome the cold serve in Florida since we have hot weather most of the time. \n\nI like thank Nick to show this place to us. We like their combination of the Italian ice with the soft serve ice cream. This combination is work for me. I have the vanilla soft serve with the bubble gum flavor Italian ice. They put them in layer. We actually can pick to flavors of Italian ice but I didn't do it since I like bubble gum flavor. The ice cream with the two type of mix calls gelati. I like Mr. Penguin creative bring other sensation to the community. \n\nThe soft serve can be vanilla, chocolate or the swirl of two flavors. The Italian ice has a lot to select. You can ask for the try out taste before you make your order. This place is dog friendly.",
    "date": "2015-08-29 04:09:45"
  },
  {
    "review_id": "AIlpvKCibIqe3mJUB9Qdzg",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "eAc2AMfLy97r_AQY1IieGg",
    "stars": 5.0,
    "useful": 9,
    "funny": 2,
    "cool": 6,
    "text": "In search of the taco place. I look up Dianna review and decide to try this place. You can said is unique place in the Bay Area with authentic Mexican food. I have not seen our recent taco crazy taco queen Kristal checkin to this place. I finally have a place to bit her to the punch. \n\nIt was surprise to me this place have good taco at very economical scale. I have three tacos and a margarita for total of $11. I have the steak, pastor and lamb. This is the first time I have the lamb taco. It is very different than other taco place. Very tasty. It come in chunk. Good in value for this taco. \n\nThe other two taco is not bad either. During the weekday including Friday, they run the two margaritas for $5 from 2:00 pm to 7:00 pm. Very good deal. With economical pricing, friendly serving, and good food, they deserve 5 stars.",
    "date": "2016-04-30 20:53:52"
  },
  {
    "review_id": "jOQXcDuNnf7qVbLq5miARg",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "PrTLeauQE62fZBJ6WtSV3Q",
    "stars": 5.0,
    "useful": 6,
    "funny": 1,
    "cool": 6,
    "text": "Rare Ethnic Food No. 19\n\nIndian biryanis is an beautiful like Chinese fried rice.  Chinese use the soy sauce with other ingredients. The Indian biryanis is using the Indian spice mixed with meat. The liking of how biryanis taste is up to each individual. Some like heavy spice with hot chili and some like it mild with touch of spice. \n\nThe selection of biryanis here is a lot. Start with egg biryanis, boneless mutton, paneer veggies, Kheema, anthrax chicken, Avakai, ulavacharu and more. We have order regular chicken biryanis and Avakai biryanis. Tha avakai include mango pickle. Very interesting. I like it spicy hot. But if you feel is too hot, they have yogurt on the side. \n\nService is good, the biryanis is excellent. Good enough spice. My wife said it is to hot after 5 spoon full. Love to come back to try them all.",
    "date": "2016-11-12 04:14:02"
  },
  {
    "review_id": "f-5ToYJcz2pO_6BD6TeOLg",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "iHxKKQwUaFj7PzCddBEVZg",
    "stars": 5.0,
    "useful": 21,
    "funny": 4,
    "cool": 27,
    "text": "It is not yet full 5 stars. It is about 4.5 stars in my book. The reason they are 4.5 stars is the value of the food vs the quality and taste of the food make the list above 4 stars. A reasonable price with decent food. \n\nI started with the Guanabana Juice. It has great fruit smell. Mixed with 2% milk make this drink very desirable. We also has the shrimp empanada. This my first time with the shrimp infills. Very interesting. We got the Fish Fritter. The fish is salty fish. It is another interesting dish. \n\nOur entree are the tilapia and steak mofongos. Tilapia is ok. The steak is better. The mofongo is good because they are cooking with pork material inside. The mofongo is better than other place I have tasted. Because it is soft and no dry - the key of good mofongo. \n\nWe end up with home made churros and coconut flan. Great balance of flavor. I will revisit them because they have reasonable price.",
    "date": "2019-02-03 13:11:57"
  },
  {
    "review_id": "tG0cVw8J8y2UhDW8AGAq5Q",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "sCkBUXw-GrMvRRxcun-Alg",
    "stars": 5.0,
    "useful": 13,
    "funny": 1,
    "cool": 14,
    "text": "I love downtown. But most of the time is difficult to find great food with reasonable price. Fusion Bowl has solved many lunch office workers with affordable price. The location also is prime location next to county office building. \n\nI was surprised we able to find a \"great\" drink place with decent food. The drink. I have the mixed berry with condensed milk with coffee jelly. This is great drink. This drink has many berry type and herb. We also has a good lavender drink and mango drink. All these drinks were good. But the mixed berry is the best. \n\nI got the beef noodle pho, lemon chicken fresh roll and grilled pork bowl. I said they are decent and acceptable. The quantity enough for lunch and better than fast food.  Lemon chicken is good to start. \n\nThe store owner was friendly. I like this small business. They have a lot customer visiting during Sunday lunch. Imagine weekday afternoon.",
    "date": "2019-05-24 00:21:55"
  },
  {
    "review_id": "dJEG1OP1nOTLfDnNb42rnA",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "EjG3BCsSGj9jSphYFrd9MA",
    "stars": 5.0,
    "useful": 24,
    "funny": 10,
    "cool": 20,
    "text": "Yelping 1900. Authentic Cultural Food No. 47. Center East Chinese Cuisine\n\nThis restaurant use to call Tao Asian Fusion. Recently has changed their name. The menu is also changed. This restaurant basically has Shandong and Peking cuisine. Very close to Szechuan cuisine. This area of China eat slightly different from other side of country. Since it is at the capital, the cuisine includes many area of China due to dynasty dining. \n\nI like many items in the menu and the special of the day. It has an attractive menu. We got the sautéed pig kidney. The chef is skillful not to let the ingredients over cook. It is nice to see to serve this dish right. Our next dish is the beef noodle with pickle veggies. The beef is marinated and braised for some time. \n\nWe also got the fish with black bean sauce. This black bean sauce with chili is a nice combination. The fish is fried with whole fish no head. So you need to skill eater to order this dish. Our last entree is the Dong Po Pork. I love this dish when they prepared correctly. This is Pork belly with skin and braised in sweet sauce. It need to be braised over time to soften the tough skin and meat. Which they have done that. I would recommend this dish if you come to visit. \n\nWe order the beef pie from the special menu. It is special street food category. If they carry this dish. Order the pork pie. Overall experience is excellent. Enjoy the good cooking. We have been back twice.",
    "date": "2018-10-24 02:27:25"
  },
  {
    "review_id": "mFied-Q7nOWetovVqdpYjw",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "VKaxKK37-XMIbBYfq9PhIg",
    "stars": 5.0,
    "useful": 16,
    "funny": 3,
    "cool": 12,
    "text": "4.5 stars restaurant. Not yet 5 stars to my book. This restaurant has plus at back of the name. This mean they beyond just poke only. The restaurant also has the Vietnamese cuisine. So you can get poke and cook meal. I got best of both worlds. \n\nI start with mixed poke. I got the base as rice and protein as tuna. They are generous for one scoop of protein. This is why they have 5 stars. I got all the mixed in ingredients and topping that have have no up charge. The sauce are poke sauce, eel and special ask for sesame oil. It was really good for mixed in. I would pre them to do mixed in ingredients and protein separately than added into the base then add topping. But they don't have this procedure. They do put the sauce over base then on top of mixed in ingredients. This area they can improve. \n\nWe also got the combination pho and grilled pork bun. Their Vietnamese side food also delicious. The grilled pork is well marinated and their pho is deep with herb smell.",
    "date": "2019-09-14 12:19:39"
  },
  {
    "review_id": "VDf9yHozzS86-rxluGvOtw",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "ClECgEMnf6_xlQzEk3IKCA",
    "stars": 5.0,
    "useful": 22,
    "funny": 4,
    "cool": 18,
    "text": "#ThankYouThursday. \n\nI have chosen Terra Gaucha for today visit for lunch dine in experience. Thank you for hanging there during pandemic. I think your restaurant has good high ceiling dining hall. No doubt the great Brazilian Grille in Tampa Bay Area. We were lucky to have you. Interior design is great. Good place for power lunch and bring the the client. \n\nWith that said. This is place for meat. Love it. Buffet style. People may be afraid of close contact because of buffet. Thank you to make it safer for people come to the table. Before each individual come to the buffet booth, each one need to put on the hand gloves. So the share spatula is not touch. The buffet table already have partial cover on top. But I think more cover or complete lid cover is better. We saw a few completely cover such as soup item is very good. \n\nThe meat bring to the table is well perform. Server wear gloves and mask. Definitely great to visit. Keep serving our community and we are looking forward to see you again.",
    "date": "2020-05-14 20:56:20"
  },
  {
    "review_id": "427s57T2voHBW5vRSMk34w",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "EjG3BCsSGj9jSphYFrd9MA",
    "stars": 5.0,
    "useful": 29,
    "funny": 11,
    "cool": 24,
    "text": "Currently the restaurant are not open for public to dine in. It is takeout only. In order to attract customers and regularity, they push out several rewards systems. They have clover points system. 50 point cumulative got the free peach pudding with milk. 100 point got Tao Beef Burrito, 200 point spicy chicken and 300 whole grilled fish. Basically is 10% off item you cumulative as point. \n\nThe also run weekly half price promotions. Currently is the grilled lamb leg half price. You can choose spicy or salt and pepper. I prefer the salt and pepper. It is delicious. Other item include dong Po pork belly, fiery shrimp are among the best. You should try those dishes. The lunch special is comparable with and fast food outside with great value. It also includes a soft drink and make the deal sweet with about $8. Can beat that. \n\nCall ahead is the key. They usually need 20 minutes to prepare. Food are very nicely seasoned and go with wine at home. Are you hungry now.",
    "date": "2021-01-12 02:40:50"
  },
  {
    "review_id": "EbGqtPFxUKXhiM825dly5Q",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "GXKCge5grypjLZETrQMCFg",
    "stars": 5.0,
    "useful": 19,
    "funny": 5,
    "cool": 16,
    "text": "Review #2900. Rare ethnic food #70. Iraqi Cuisine. \n\nThis review go to our local unique restaurant. I have many Middle Eastern food but this one is different. If you come to visit, I would suggest get the Iraqi Masgouf fish dish. The restaurant has very interesting meat dish in the menu. All food is interesting. \n\nWe got the Iraqi Masgouf. This dish is not cheap but it has good quantity and quality. The entire come with marinated grilled fish. The side dish have Fries, green chili, butter bread, two mixed veggies, and more. The fish is delicious with bone. The other dish we have is the  dolce ribeye steak. This dish we select the rice. I like the spice up rice. The steak was well marinated. It is tasty to the bone. \n\nThe restaurant has a yellow bird. It sing for us while we are eating. The chai tea is complimentary. The soup was special complimentary. We got the lentil and the okra soup. Service is good. Love to eat there for good food. The bread is special with their own made butter.",
    "date": "2021-07-08 19:26:05"
  },
  {
    "review_id": "YqoN8h2qQy3jk-pCIM675Q",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "ClECgEMnf6_xlQzEk3IKCA",
    "stars": 5.0,
    "useful": 21,
    "funny": 3,
    "cool": 13,
    "text": "This is brand new Brazilian Steakhouse. It is a chain restaurant with well train staff to get this restaurant run smoothly at the first month. The lunch is cheaper than the dinner. The all you can eat steak also includes all you can eat buffet for other miscellaneous items. \n\nThe steak is awesome. Especially I like the lamb chop, chicken heart, skirt steak, top sirloin. All steak is well seasoning. Especially the chicken heart and chicken drum stick. The chicken drum stick is marinated in wine sauce. Very delicious. There are wave and wave of meat to cut. They also bring out big giant leg of lamb. \n\nDuring this time on the brand new opening, they have 10% off the bill. On the buffet table, they have heart of palm, Smoke salmon, caramel mushrooms and more. \n\nTip - don't forget to ask for the steak sauce such chimichuri, hot sauce, mint jelly to go with steak and lamb chop. \n\nService is excellent. These include the speed, attention to detail, clean up, and frequently check on the table. Definitely 5 stars.",
    "date": "2018-06-03 01:29:34"
  },
  {
    "review_id": "hMl44baQPdyx4sNuZjlhkg",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "GoUSZEWLycD1fIYthTMylQ",
    "stars": 5.0,
    "useful": 14,
    "funny": 7,
    "cool": 16,
    "text": "Rare Authentic Food #38 - Florida own seasoning crab. \n\nI am surprised Nick and Tina did not smell this one out since both of them love crab. This restaurant now is my number one store to go finger food for crab. It is king of the crab store. Best ever. If you want some finger food during this football season, this will be the one if you don't mind to get down dirty with finger for limited crab meat. \n\nToday I got two types of crab. The garlic crab and fried crab. Both of them are excellently exceedingly my expectations. The garlic crabs are finger licking good. 3 crab for $7.50. I also got the seasoning fried crab for $11. Man!!! Those are good. The seasoning is deeeeeeeeep into the crab since the crab is minorly crack to allow the seasoning get into the crab meat. They have other item. But I think you should concentrate on the crabs. \n\nAm I coming back. Hell yes!!!! Love the food. By the way this is just a take out store. You can order 15 minutes ahead so it won't be any wait. The crab is fresh. The fried crab is normally bigger than garlic crab. There is not sit down area. Only carry out.",
    "date": "2017-09-02 21:50:41"
  },
  {
    "review_id": "6eFSWWS1yIfwADWjAPY7DA",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "jGn6f8Y8A9mnNlVSc4lAJQ",
    "stars": 5.0,
    "useful": 26,
    "funny": 9,
    "cool": 26,
    "text": "Yelping 1400 - Rare Ethic Food # 41\n\nThis one go to the local restaurant which is unique in many way. This Turkish kitchen offer many items I have never seen before. It is amazing to try them all. I would recommend friends to try this restaurant which is extremely good. \n\nTo begin, we start with oven baked Hummus with added Turkish sausage. This hummus is mixed with mozzarella. This dish come with lavash bread. This is my first time have this dish. It is huge bread. The bread blow up is actually made up of hot air trap inside that bigger than my head. It is interesting. \n\nThe main dishes include Levrek- Whole Mediterranean Sea  Bass. The fish is grilled. I like the crispy fish skin with the marinated sauce. The fish is fresh and great to enjoy. The second dish is Pirzola - marinated grilled lamb chop. It come with 4 chops. Very good flavor. \n\nWe end the night with special dessert. The Kunefe is one of the specialty of the night. It is string type Filo Dough stuff with cheese and sugar syrup. It was interesting to pull them apart. String dough make the this dessert unimaginable delicious. \n\nOverall this is solid five stars restaurant. Good service.",
    "date": "2017-11-03 03:09:26"
  },
  {
    "review_id": "Ml4ZvN1pgb-slTlFyKX_vQ",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "-788YqeAedOZseDJOo7kfQ",
    "stars": 5.0,
    "useful": 16,
    "funny": 4,
    "cool": 13,
    "text": "It is about 4.5 stars. Onur is part market and part restaurant. This is a Turkish market for item like Turkish delight and all the Turkish goods such as tunas jam, coffee, spices, flour, marinated steak and more. \n\nWe got some of the cookies and milk drinks mixed and a kabab to go. We have the chicken kabab and it comes with veggies. You will not believe the kabab is good. Love the juicy chicken kabab. \n\nThe menu of the restaurant was easy to select. The price is affordable in compare to full middle eastern restaurants. The kabab was prepared in ten minutes. In compare to restaurants I usually waited for half hours. This is the plus to prepare the food quick and quality.",
    "date": "2021-05-11 16:18:38"
  }
]