[
  {
    "review_id": "nhfB-ssDwJxbpAUjlE889A",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "t-bcEvAM8oE92tm9HBr7wQ",
    "stars": 3.0,
    "useful": 8,
    "funny": 3,
    "cool": 9,
    "text": "We have big group of 12 for the office outing lunch. I would said for the number of people we have, the service is not the best but good enough. Only one of our members get the food late. The close out may need to work on it. Tip was added since we have large group which may my bill easy. \n\nI have order the lamb kebab (Shish Kebab) plate. It come with two choices of side. I got the rice and the babaghanoush. The rice was well cook and nice aroma. The babaghanoush was well prepared and great with extra olive oil. The presentation of the dish is pleasant. However, the meat did not measured up. It was too dry and the marinated is not over the top. They need to improve on this area. \n\nI have been here several time. My previous experience is better. During the month of Ramadan, they serve the buffet that are plenty of choices and attractive. I would said try them during this time. The buffet of Ramadan usually start at 8:30. Go early because is a lot of customers.",
    "date": "2017-05-26 03:20:52"
  },
  {
    "review_id": "dP-WOpbVCHBUmy4X_S4yww",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "WoFttPbJRti49sXBgOeIBQ",
    "stars": 3.0,
    "useful": 2,
    "funny": 0,
    "cool": 2,
    "text": "My wife's pick this place since we have a coupon to use. Like RJP said \"blame it to the wife\". Love to do it when you can get away reasonable doubt by saying wife pick the place. A lot eye candy in the restaurant with my wife. Strange.  \n\nMy wife was at the restaurant first and she order ahead. I follow to the restaurant in 10 minutes. She order the lunch special with Chinese stir fry. Chinese food in winghouse? May be not. Her food came out like frozen section ready to cook meal from the Publix. I would not go for their Monday special. \n\nThey have two selection of fish sandwich in the menu. Grouper cousin or Mahi Mahi. Grouper cousin is one type of white fish. I definitely go for the real name fish- the Mahi Mahi. It can be grilled, blackened or deep fried. I have it grilled. The blacken Mahi Mahi is not the spicy type I like but it do have a good taste. This sandwich is better than their daily special. \n\nThe service is average. However, I think they need to be faster for lunch. Most people only have one hour.",
    "date": "2015-07-17 12:43:19"
  },
  {
    "review_id": "8GfeTDv2jl0TABAkPOg0LQ",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "9dGzGbNKLMP0_wOqI5GffQ",
    "stars": 3.0,
    "useful": 5,
    "funny": 1,
    "cool": 7,
    "text": "This is my second time here. They are open at the Christmas Day night. Not too busy compared to many other restaurant open at that day. The interior of this place is beautifully set up. I like their decorations. \n\nWe were sit immediately on second small room. Including us is about three tables of customers. We have ordered Black pepper basil crispy duck and Spicy noodle with squid. Food delivery is on time. The black pepper basil squid is average. The spicy noodle seem like not cook in high heat because I cannot taste the burn oil. Both dish is actually made for American Thai flavor. The local may like it but I am looking for good Thai which is average. \n\nThe service is not measured up. We were not able to get attention of our waitress. But the other two tables was able grab her attention. Some how we got ignored. The three stars for the food and the service we have experience.",
    "date": "2016-12-27 02:02:17"
  },
  {
    "review_id": "n4vGAA-sRKf60Vb0VcT2-w",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "rQCTWNMzIZTfqWEAjxDpKQ",
    "stars": 3.0,
    "useful": 3,
    "funny": 2,
    "cool": 1,
    "text": "Fancy fast food chain. A lot of choice for the sandwiches. Today I have the shave prime rib basket with upgrade to onion ring ($1 more) and my wife have the Atlantic cod basket with upgrade to shake ($2 more).\n\nThey give you a number and the food was brought to the table. This is plus that you don,t need to wait for your order at the counter. The food came in 5 minutes. \n\nThe shave prime rib is a bit salty. The onion ring and the cod came with a thick fried beard coating at the cover. To do the coating for deep fried have two method. The wet flour with material then fried or dry flour with material then fried. This restaurant chose the wet coating. As a result there is oil in the coating if you don't sit the food for a while and serve. \n\nThe service is good. However, I am not a fan for the wet coating. I believe the restaurant can improve on this front.  I not against the fry food but against the oily food due oil residue can be tasted at the onion ring coating.",
    "date": "2014-12-21 17:07:39"
  },
  {
    "review_id": "S55PPgvDtZLYqrx90I--wQ",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "uxqn4kSvEj6Q66egwYrKYQ",
    "stars": 3.0,
    "useful": 16,
    "funny": 3,
    "cool": 14,
    "text": "Desi located at telecom park. Which they can get a lot Hindu customers who work on IT at this commercial park. They located at the end unit of the plaza which allows them to have some outdoor seating. During the weekday, they serve Tali plate. Weekend they serve buffet for lunch. \n\nThe buffet have a lot meat selection. I like the mutton curry. Among the meat curry, I also like their chili chicken and the chicken curry. Tandoori chicken is also good there. They have served different biryanis. But I like the noodle. One thing special I can said is the shrimp curry. It is interesting. \n\nOverall the price is at the high side. I do not get the wow factor. But I can tell you they don't make it less spicy because of Americans. They did spicy the food which suppose to be. I would give them 3.5 star f",
    "date": "2021-03-18 17:35:57"
  },
  {
    "review_id": "Qmk9tMaOOiB4_4dj6MQ2vw",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "USekrAG0-4tJUs9V2gBBOQ",
    "stars": 3.0,
    "useful": 18,
    "funny": 7,
    "cool": 12,
    "text": "I have book mark Honu for some time. Honu is Hawaiian Green Sea Turtle which is remarkable creature. They have plenty of the decoration about this type of turtle at their wall. Those are cute turtle picture on display. \n\nWe were there New Year eve and they are the only few still have space for 6:30 sitting. We were plan to eat there and go to the New Year show. We start with the Musubi - sautéed spam in seaweed and rice. Very interesting. The second dish is the special of the day with salmon poke and thin piece rice cake. This is interesting dish too. We have the stack - slow cook pork on sushi rice top with claw slaw. The rice is not my liking. The pork are sweet. The final dish Mauna Kea Keck II - slow cook beef on the spinach with twin scoop of rice. The beef is average. The rice definite needs improvement. \n\nOverall the service is very good. The dishes presentation are well design. However the food seasoning and taste is not there. I like the live music and dollar champagne for good New Year celebration.",
    "date": "2017-01-07 04:34:18"
  },
  {
    "review_id": "zKcMX4zkkhBo15xjyQJMGw",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "gambCINfjny6RLKyZQzEtQ",
    "stars": 3.0,
    "useful": 14,
    "funny": 3,
    "cool": 13,
    "text": "This restaurant located in the Hilton Garden Inn near airport. This is interesting to see a restaurant in the hotel. We were here for lunch. The food is not cheap for lunch and dinner after we look at the menu. As long they can provide a good food. We are good. \n\nWe order the chicken panini and the Margherita Classic. The panini is good. Chicken was grilled. Accompanied fries was crispy. The Margherita is a flatbread top with chop steak with mozzarella cheese. It very good. Overall the food is good. The wait is a bit longer for the food. \n\nThe reason is three stars is due to waiter didn't pay attention to the table. Even we try to flag him down. Lunch during office hour usually is short. They need to paid attention we try to paid and get put. It take us ten minutes to finally get his attention.",
    "date": "2019-04-01 13:46:24"
  },
  {
    "review_id": "0SyoxerkqP6QOYmzod3dZA",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "pjb3xGA9ccjl49B5ERH46w",
    "stars": 3.0,
    "useful": 3,
    "funny": 0,
    "cool": 2,
    "text": "I have a late lunch here. I walk into the restaurant at 2:20 pm and they have two table occupied. I was sit immediately. \n\nThe furniture is a bit old. The table is a bit sticky. The waiters were nice and courteous. I got the steak taco with rice combo. It is $9.95. The food came out in 10 minutes. The tortilla is a 8 inches flour tortillas. It is big and they have to stick the tortilla with toothpick. The steak is regular steak nothing fancy. No special cut section. It is definite good with fill up you stomach. They guacamole, cheese and salsa for the add on. \n\nThe rice is nicely cook and typically prepared. Before the meal come, they provide the chip and salsa. The salsa came in a small dish. It is easily finish with less than 10 scoops. I have to ask for more. \n\nOverall is not the five star restaurant. Service is good. It is done that check off deal.",
    "date": "2015-09-04 10:33:09"
  },
  {
    "review_id": "3Jwx6XJJ9-JC2Ye9REVPnw",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "ZpWT4FlEVgGJUV9gNuhQ4w",
    "stars": 3.0,
    "useful": 7,
    "funny": 4,
    "cool": 6,
    "text": "If you looking for meat, they have deal in the store. I got beef flank steak only for $4.95 a pound for the special of the day. It has many types of beef and pork cut. \n\nThe meat market serves hot deli such as empanadas, tacos, fried chicken and more. The price of those deli food are affordable. It has package deal. For is ok since the price is low no complaints. They do have the seating area if you decide to eat there. \n\nThe veggies section just like normal supermarket and same as the can good and un perishable food. They do have special soft drinks. Some from drink still at original bottle packaging. \n\nThis store just like typical supermarket but is local own. The advantage is the meat they have sold here. If you have huge party at your home and hosting a BBQ, this is a good place to purchase your meat.",
    "date": "2017-03-26 19:23:10"
  },
  {
    "review_id": "BHX70ePexAiN4FHuvpJuaQ",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "M1BkW7JZZBrCfT4_Sr4NEQ",
    "stars": 3.0,
    "useful": 14,
    "funny": 4,
    "cool": 13,
    "text": "Sushi burrito is new thing in the recent food world. Basically is poke in a wrap. This handheld is new to people as comfort food. It has good attraction to many people try to catch the trend. I am also one of them. \n\nI got the original sushi burrito. It has tuna, tempura shrimp, asparagus and more. You can choose the sauce. It is wrap with very soft skin eatable wrap. This burrito to me is like something you need it quick. It look like blue color lunch but cannot be made for hours wait and eat due to raw fish. \n\nI also got durian boba. The cup indicated Ha Long Bay. I am guessing this restaurant is relate to the Ha Long Bay restaurant. Not much of service. Basically order at counter and wait for your food.",
    "date": "2019-10-23 02:48:40"
  },
  {
    "review_id": "-WEutO7DmRn462tw2kFTAg",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "cg4JFJcCxRTTMmcg9O9KtA",
    "stars": 3.0,
    "useful": 7,
    "funny": 4,
    "cool": 4,
    "text": "Ava is well decorated to match the younger generation. I like the decorations. However I don't like chair with cross vinyl support seat cushion. I like the bar area is well lid in color. This restaurant is selling atmosphere. \n\nWe have ordered the seared duck breast and the spaghetti e vongole. The duck breast is with the cherry sauce on top of the pistachio goat cheese. The combination is ok if you like goat cheese. It will better with grilled veggies. The spaghetti e vongole is spaghetti with little neck clam. It is white wine sauce. I have this dish at elsewhere. The current experience is not top that previous experience. The wine sauce can be better. \n\nI can see that why they are not above average. The portion of the food is small compared to many restaurant. It is almost need additional food after we have finished eating. Value is not there and the taste not measure up to the price is charge.",
    "date": "2017-07-22 01:54:09"
  },
  {
    "review_id": "OZOssiAV1bvsCzbtIlmNEw",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "xkTjLbBC7uB-rAIDqAm-sw",
    "stars": 3.0,
    "useful": 3,
    "funny": 1,
    "cool": 1,
    "text": "I have to agree with Mark on this taco truck. We have try variety of tacos but this truck is average. I would said the Bay Area certainly step up on the taco food. The tacos have growing interest in this bay area. \n\nWe have order 8 different taco. Including shrimp, lengua, tripa, carne, chorizo, pork. The food is average. I would said the sauce has over power the ingredient. If they can lightly season and still make it taste good, that will be the key. May be I not use to this type of taco with overpower sauce.  We also order the ceviche. The ceviche is better. The crispy corn tortilla go very well with the ceviche.",
    "date": "2016-04-03 10:56:16"
  },
  {
    "review_id": "BlpDoBhx7VcSKEC30uG_-Q",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "qa1fGa9u0_awl-A8CinLRg",
    "stars": 3.0,
    "useful": 8,
    "funny": 0,
    "cool": 5,
    "text": "This deli is order at the counter and issue an order number.  Then you a fix you number to table stand. That how they identify your order and deliver to you. Table and seat is pick by you. It has freedom of your table choice. I like that concept of fast food order. They bring the food to you. \n\nThe menu is very simple. Mainly is the sandwich. Nothing fancy. We got the Black Angus Beef Club. The club sandwich come as four pieces of bread cut in triangle with beef slide sandwich. The bacon can be improved to a bit crispy. This item may be one of the most expensive items. Taste is ok. \n\nWe waited about 8 minutes for our food to deliver to our table. Not much of service",
    "date": "2020-01-18 12:13:46"
  },
  {
    "review_id": "nhhxhyYFFRwc-HIEf4g6xQ",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "_HcAoG6Jj_XTj4-XNEbo6Q",
    "stars": 3.0,
    "useful": 20,
    "funny": 10,
    "cool": 16,
    "text": "It is huge improvement when there is staff members help you to get the right order. A beeper was given when your food is ready to pick. At least they no longer let the customers to figure out the food on the counter. \n\nWe were here for the taco week to celebrate the administrative day. Most of my guest got two tacos and a drink with about $10. I got the grilled fish and grilled shrimp. It is tasty for the two tacos I have selected. I like the grilled shrimp better. It has some blackened seasoning on it. \n\nI got the margarita for my combination deal. The margarita start light then feel the alcohol effects later. We enjoy our time there.",
    "date": "2019-04-30 13:06:04"
  },
  {
    "review_id": "zKFCwni8z7da0-T4DLH2Kg",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "FJlYldo1NcoyKMG2YKWywA",
    "stars": 3.0,
    "useful": 7,
    "funny": 3,
    "cool": 6,
    "text": "Among the three MD, this may be the least favorite. This MD under the major face lift and added many footage to the store. They has increased the good carrier and display with close to 100%. A big applause to the owner. \n\nAdding is good. But renovation is still needed. The live seafood section need to clean their tank often. The MD in this location employees training need to know how heavy a bag can carry. Today I have two break bag due to the over weight of the bag can carry. They should learn double bag or less items in the bag. \n\nIt is good to see the fresh produce. I like the different fruit items. I like them added the bakery items. This place is more complete now.",
    "date": "2016-03-13 03:58:18"
  },
  {
    "review_id": "rvAvGBKM5fZ3BZ9IJEJJ-A",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "5xd-UOui26nPkNLos2PjcA",
    "stars": 3.0,
    "useful": 13,
    "funny": 3,
    "cool": 7,
    "text": "We have brunch here during one of the Sunday. I like beach community restaurant because of the Pass A Grille beach. This restaurant is basically at the Main Street. The restaurant decorated modern contemporary. Decoration color mainly white. \n\nWe have group of people. I got the eggnog waffle that top with strawberry and syrup. The waffle also come with the roasted walnut. This dish is decent. I also has the bowl of soup with southern clam chowder. Not much of clam. And the clam is tiny. My friend order the tuna melt. It was not melt at all. The cheese still at the room temp shape. Never melt. Then why call tuna melt. \n\nService is a bit slow here. I would give them an average among the restaurant.",
    "date": "2020-01-09 02:26:36"
  },
  {
    "review_id": "lAqzcJL1EXFLLdQ9pdtviA",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "qppGA9vCUPfw9ngOy_R90w",
    "stars": 3.0,
    "useful": 9,
    "funny": 4,
    "cool": 7,
    "text": "This is a difficult one. Among the wine bar or kitchen they are in the passing grade. Very close to the 3.5 stars but not there yet. I think the food need to step up among the wine bars. Selection of the wine is just average. \n\nThere are several thing they can improve. The portion of the plate is small compared to the Bay Area wine bar kitchen. Food pallet is at the sour side. If they can improve this two, it may be great attraction to the customers. Food price on the small plate is at the high side. Flavor and taste still need big improvement. \n\nI have the blacken octopus and seared tuna. The octopus is one tentacles. Which is small for the price they charging. The sauce can be more complicate by not stay on one sauce. May be grilled a bit better. The seared tuna coating can be improved. Not impressive. It is almost like Japanese tuna sashimi. If the outside is seared, it can include some awesome seasoning. May be smaller cute but more piece which provides more are of the seared outward tastes. \n\nOverall, they are try to sell the wine which the taste of the food need to be more attractive.",
    "date": "2017-07-01 23:21:57"
  },
  {
    "review_id": "pajpemP6mxCQKuHsJgsBRA",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "I1h0GRYp86eX-XqwVXsSGA",
    "stars": 3.0,
    "useful": 9,
    "funny": 3,
    "cool": 7,
    "text": "I have been to this Zeko before but have not try their chicken wing. Zeko is a Mediterranean restaurant. They have variety menu. From vegetarian to meat kabab. Their extensive menu includes Greek salad, falafel, fried seafood including shrimp and fish, different kind of shake, beef and lamb kabab, gyro, shawarma, chicken sandwich and wings. \n\nThe restaurant operate like fast food fashion. Order at counter and ready to pick up. After 8:30 pm, most order are take out. I got the honey BBQ wings. The wings is fried and toss over the BBQ sauce. The wing value is $1 a piece is at the average in the Bay Area. Toss sauce with fried wing is not my most favorite. They are just average. \n\nOverall experience is good. It is definitely better than the fast food in Busch garden.",
    "date": "2017-08-28 19:01:40"
  },
  {
    "review_id": "PasU9U7k3cLbU4xTFUzUdw",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "ixPTo6Hum7nNZ7A4VPhTXg",
    "stars": 3.0,
    "useful": 12,
    "funny": 3,
    "cool": 13,
    "text": "We were here for the restaurant week at Saturday. For Saturday night this restaurant is average busy. The tap house has good collection of whiskey. They have quite a selection if you want some southern whiskey. They can consider sport bar. I would they may need to add a few more in order to compete as sport bar. \n\nThe service is good. I like the appetizers and the dessert. Their entree need to be work on it. We started with the knockout shrimp. This is fried shrimp with spicy creamy sauce. This serve over the cabbage salad. Our dessert is the chocolate bourbon cake. I also like this dish. The cake has good flavor with ice cream. \n\nOur entree are the 6oz filet mignon. The meat taste like sirloin instead of filet mignon. It is not soft enough. The meat also has no seasoning. We also has the grilled mahi-mahi. Again no seasoning. Both dish are not impressive.",
    "date": "2019-06-17 04:52:32"
  },
  {
    "review_id": "7g_61TZXUny6Q0omK_4b9A",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "5JiFbBsbUdb-caBZWRyMSw",
    "stars": 3.0,
    "useful": 13,
    "funny": 3,
    "cool": 7,
    "text": "This restaurant has good potential. They do have a lot of visitors during weekdays. It is a good sign that the restaurant is pack during Thursday. We came in with no reservation. Since we don't like to seat outside, the only seat available is the two couches chairs. We don't mind. It is just not our normal eating height. \n\nWe have order the Carne Asada Street Taco. This taco come with skirt steak, Cotija cheese, and pickle. We don't know the Cotija cheese is. Very similar to goat cheese. This kind of cheese either you love it or hate it for the taste. I think this is a wrong move for the restaurant. Because you may have 50% of people don't like it. Steak is a bit over cook. \n\nOur second dish is the Chimichurri Steak Frites. This dish is a lot better. We order the medium rare. A few thing can improve on is the temperature serving below warm. The dish is serve over wood cutting board is not my standard. I know they try to create the impression. But for me I don't like to eat with cutting board already being cut through with a lot of cut mark below. Even though the board is clean but never guaranteed if the cut mark is fully clean. I prefer it to serve of the plate. \n\nWith that price charge for the dish, we will have high expectations. However it was not met. Services is great. Good attentive service. I like the decoration and atmosphere. Parking very limited when the place is full.",
    "date": "2018-08-18 13:28:28"
  },
  {
    "review_id": "ksuapUzv_Z7R_Xr4BWA9DQ",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "a2ITIJRAY4Eo-xTH0vN95A",
    "stars": 3.0,
    "useful": 2,
    "funny": 2,
    "cool": 3,
    "text": "This my neighborhood Chili. Very Caliente. When we walk out at 8:30 pm, there are people waiting to get a table. Popular for the local resident.\n\nI always like chili fajitas. But lately they have change about the meat cut. The seasoning is still there. Today the flour tortilla is about a bit dry. Which mean they have not steam it completely. This just need a few second more and they will be ok. My wife have the chicken pasta. It is good taste. \n\nI always start with strawberry lemonade with my soft drink. At the refill, I am asking to change to blackberry ice tea then change to mango ice tea. Sometime they have watermelon lemonade. I have 3 different drink in one order. The strawberry lemonade also dilute down. They use to have the strawberry seed. Now they don't. \n\nThe service at the bar area is quick.",
    "date": "2016-05-16 10:49:54"
  },
  {
    "review_id": "nv7wvLYNYzEWthxr3GZ0nw",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "GyC36Pn0Q1-qHnqXys6yFg",
    "stars": 3.0,
    "useful": 24,
    "funny": 6,
    "cool": 19,
    "text": "We always love to go to Cracker Barrel on thanksgiving day. Because they are the few restaurants that open that day and serve thanksgiving meal. This year we did not do the sit down lunch due to pandemic. We know the restaurant probably pack. As a result we order to go. \n\nThey have make adjustments for the pandemic for how to pick out the the food. They informed you that there is a tent outside for the curb side pickup. When I arrived I went to a line for the pickup sign. Soon realized they do have two different line. One for the large meal tray pickup and the other for to go pickup. This area they need to improve. At to pickup, I ask if I should stay in the car, the told me line up at tent area will be faster. I think they really to to be effective and efficient which they did not do it. I still have wait at 15 minutes on line to pick up food where my food was ready sit on the counter. They could have changed ready pickup line and order to go line. \n\nFood is good with a lot of side for the thanksgiving meal. I like my tradition with the restaurant. They do need to improve the online order which crash that day.",
    "date": "2020-12-09 15:00:54"
  },
  {
    "review_id": "DKT8rG3vpwWxB8zsGWikXA",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "IjtKwA7njLjTvZr0nFSLeA",
    "stars": 3.0,
    "useful": 19,
    "funny": 4,
    "cool": 12,
    "text": "For food vendors in the heights market, they have a line during lunch time. The popularity bring good business to them. The food is good in compare to all vendors in the market. I know their breakfast sandwich is popular. Many people get that item. \n\nI just want to try their top item. The Palomilla Steak. It is most expensive item in the menu. The steak is good. But base on my previous stay in Miami for 11 years, this dish need work. That do not measure my taste buds. The steak needs to be thinner and more flavor. Need some burn taste too. The side item is better. Other than that. All is good.",
    "date": "2020-12-02 14:39:55"
  },
  {
    "review_id": "h4EUZSFDNKvbR1kJJIax4A",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "FKgkGKRJYppEGCYuK_DOGg",
    "stars": 3.0,
    "useful": 8,
    "funny": 2,
    "cool": 4,
    "text": "I was looking forward for to try this restaurant happy hour items for long time. This will be our progressive dinner stop 3. When I walk into the restaurant in Sunday, they still serving the happy hour items. Since this is stop 3, we order the appetizer. They has this deal 4-7 Tue to Friday, Monday all day, Sunday 2 pm to close and Saturday from noon to 7 pm. Very extensive. \n\nWe got the grilled oysters and the clam casino. The oyster is top with cheese. I said is just average. The clam is better. The clam bacon, pepper and onion. This dish worth the try and drive from far distance. I notice their happy hour items included fillet mignon kabab and other interesting app. You also can go full meal for $15 with crab cake, fillet mignon kabab, coconut shrimp and more. Good deal. \n\nSunday they have brunch for $20 including two drink. Not bad. The place is nice with bar. Seating area has it own TV. Nice treatment.",
    "date": "2017-09-01 01:16:20"
  },
  {
    "review_id": "4FM0tn_t4iTdzfKFLZDCjA",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "FYpfaVtAzEeSVB1-fU4L9Q",
    "stars": 3.0,
    "useful": 6,
    "funny": 0,
    "cool": 5,
    "text": "I have been many Latin Cafeteria, this one is average. However, they do have a few items that is stand out. The pig stomach soup and the whole pig Lechon - roast pig. The roast pig is good here. The skin is crispy if you for a piece to try. It must roasted in the long hours. The marinated sauce when inside the meat. Consider this is a must try dish if you visit. They may be the only one who serve the pig stomach soup I found in Latin cuisine. It is good and soft. The Chinese cook it with whole black pepper, the Latin cook it yellow base soup. It take some skill to cook this dish. \n\nThe reason they are three star is the rest of the item do not stand out. The rice is under cook. The plantain is not soft enough which mean the did not do a correct selection of how ripe it need to be. The octopus Ceviche is blend. Need more spice. Service is average since is cafeteria style.",
    "date": "2016-10-18 02:45:27"
  },
  {
    "review_id": "q6nPNib0tApR2he2w-LOsw",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "kVrugngpixLsf4pNu4uzrw",
    "stars": 3.0,
    "useful": 2,
    "funny": 3,
    "cool": 2,
    "text": "Lee House is Center located in Brandon . They have dim sum menu but we did not try it. My neighbors table order the Hong Kong style egg noodle wonton soup. They seem to enjoy it very much. I also notice they run out the last bowl of this soup that night. \n\nWe select the item at the last page menu with three courses for $25. Not a bad deal. We have the salt and pepper squid, grouper with XO sauce, and beef chow fun. The dishes is big and good for hungry people. The squid is in wet batter coating  which I am not a fan. But the other two dishes did a good job. \n\nI notice they have delivery. I have read one of friend review about 2.5 hour delay story. I think their delivery is not reliable. So come to eat at the restaurant. I can see not consistent in this restaurant since they run out of material. The day we visit is ok service.",
    "date": "2016-03-23 17:19:32"
  },
  {
    "review_id": "6lDoyDiayymH3LlPLEB17g",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "loWCMkmjtxyyEQqnb9l5_w",
    "stars": 3.0,
    "useful": 4,
    "funny": 1,
    "cool": 2,
    "text": "Very nice restaurant located between the two counties. It has very nice light green color theme. It has outside seating that is pleasant to the customer. \n\nThey are Mediterranean restaurant in Greek cuisine. They have good veggies dish. It include the grill veggies plate. The daily special for lunch is under $10. Kid menu is available also with little people pricing. \n\nI have grilled lamb feast. It came with salad and basmati rice. The lamb is not cut in cube at stick. It is big piece lamb meat. As a result, there is a lot of fiber in the meat and it is not tenderize. It is tough to bite. The salad is nice. The food smell good. I would try other dishes if I visit again.",
    "date": "2016-01-20 05:36:10"
  },
  {
    "review_id": "5uMlygc-ROVDcGB59IhliQ",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "oToFygrpTn3OUpFkPFMxfA",
    "stars": 3.0,
    "useful": 1,
    "funny": 3,
    "cool": 0,
    "text": "We saw this posting in yelp for this old ice cream store. There are limited parking spots near the store. Fortunately we came to the store when it rain and 9:00 pm at night. Not many cars. \n\nWe are thinking about the dip top ice cream that was posted in the Yelp site. My wife has the Dip Top and I try the snow cone. The snow cone has the choice of Orange, Blue Raspberry, Grape and Cherry. I have them infuse all four flavors. The taste flavor is good but the shave ice is not to the standard. This store shave ice is big pieces compare to many snow cone venders. The correct way of the shave ice is tiny pieces like puffy cotton. I believe they can adjust many revolutions with slightly press to create that. Unfortunately, the store tries to save energy, and make the shave ice not delight to eat. With that, they should have 2 stars.\n\nHowever, the Dip Top did the best job among the menu and save the day. The soft serve with the Cherry dip top is handsome looking and delicious to eat. I think they are the best in town. If I come back, I will have the dip top only. The soft serve can be vanilla, chocolate or swirl of two flavor. The dip top can be chocolate, cherry or butterscotch. I bite the dip top of my wife and they are excellent.",
    "date": "2015-08-02 15:00:10"
  },
  {
    "review_id": "y2X1P75YrUrGYII6pJe42g",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "RuLLrymzV6jtHMOhYmUs0Q",
    "stars": 3.0,
    "useful": 7,
    "funny": 2,
    "cool": 6,
    "text": "This food truck is strategically positioning themselves next to Futbol 5. It generates some business from the soccer player who play there. The night time soccer allow the food truck to open till late in the hour. \n\nThis truck sell arepa, cachapas and weekend special. I have the shrimp arepa. You have a choice of cold or hot arepa. The hot arepa is the skin will be fried. I have the hot arepa with shrimp. The shrimp size is big and they many count of them. The arepa is $7. However, the vinegar is overtop the good taste. I actually don't like too much vinegar on food. They should ask the customers if they like it. \n\nThe special of the night include black beef, quail egg, and some other stuff that is very interesting. The food need to eat immediately to gain the maximum enjoyment.",
    "date": "2016-12-24 04:41:59"
  },
  {
    "review_id": "WXJA9Bx9d06003NDL5W8Sg",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "642IgLN1a8kjDIeAkaps1A",
    "stars": 3.0,
    "useful": 8,
    "funny": 5,
    "cool": 9,
    "text": "Almost 3.5 stars restaurant but not quite. This restaurant do have excellent reviews but my experience did not match up the rated stars. \n\nThe Sun City has a lot Mexican restaurant that you can pick. Los Amigos is the popular one at local. I think they are highly rated because of the local.  We were here at 1:20 pm and they are still 80% full. People still coming in after we have sit down. \n\nIt was difficult to get the wait staff attention for getting a menu or initial an order. I have decided to take manner at my own hand to grab one of the staff and ordered immediately. After my order, I saw at least three tables customer walk out the restaurant without order. This is a sign of either not enough staff or lack of attention. \n\nWe have order the beef rib with green enchiladas and breaded steak. My friend breaded steak is average. My beef rib come with three pieces. At least 1.5 pieces is over cook or charcoal. I can see why they are popular because their food is good deal. \n\nA few things they can improve. Increase number of wait staff. The kitchen staffs may need to paid attention on cooking.",
    "date": "2017-05-06 12:34:32"
  },
  {
    "review_id": "7VAebYHgj40KBtQpVCzCog",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "Q2T7jA5l-uZu78TwSgcE9g",
    "stars": 3.0,
    "useful": 15,
    "funny": 3,
    "cool": 4,
    "text": "Zukku is one of the popular food vendor in the Heights Public Market. The lunch time is constantly build up the line. I would consider them is food court partition restaurant since they share the common area. This is trendy location for high end food.\n\nA few things I like. The deep red color of Ahi tuna. They have good chef knife skills. They can cut the avocado in very thin slice. The decorations for the sushi is attractive. \n\nI did not go for the sushi. I order a big poke bowl with two proteins. However, they run out of yellowtail. So go for the tuna only. A few things I don't like. The price is about restaurant price for food court mentality. You have stand in line to get food. The portion is small compared to many of you pick poke. The quality is in the mix review. The meat has good quality but it has a lot of tuna tip end. The meat is not cube size. \n\nFor the price. I expect more. As a result, they are three stars.",
    "date": "2018-02-13 21:54:06"
  },
  {
    "review_id": "9he0TTs0o1kf-gLyx0Dg8w",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "2oh4NJDtqTUO5ZuvCe0hWw",
    "stars": 3.0,
    "useful": 14,
    "funny": 4,
    "cool": 9,
    "text": "This Evo serve the Soho neighborhood. It is healthy choice for the people. However the shop is kind of empty when we visited. Not sure this neighborhood is up to the healthy food. \n\nWe got Mediterranean Lemon Chicken. This dish is a bit plain. The chicken is well cooked but lemon grilled is just average. I like their mahi mahi better. \n\nFood come out quick. Basically is warm. But I like to be hotter. Not much service. I always like their air fries. It is crispy.",
    "date": "2019-01-20 16:24:49"
  },
  {
    "review_id": "4l-QhR9XK3abzr9G73FY0Q",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "t132qqcNfr_3ZASDxhdn_Q",
    "stars": 3.0,
    "useful": 10,
    "funny": 5,
    "cool": 7,
    "text": "I have been here many time. I am here most of the time is for the snack and happy hour drink. Usually is about 3 pm. Their happy hour dollar drink over at 5 pm. The drive through is easy since the road construction was finished. \n\nThe wait for the drive through is good. Easy access. Not much of wait in the line. If you are at the westbound of the Ulmerton. You need a U turn to get to the location.",
    "date": "2018-05-26 04:29:58"
  },
  {
    "review_id": "ECGqcP1V0x3k49hUwNpJRQ",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "_78Lam9Jd0W6ZmnHTvdjMg",
    "stars": 3.0,
    "useful": 25,
    "funny": 5,
    "cool": 10,
    "text": "I cannot jump in joy wagon to give them five stars. Basically this place is a food court with trendy atmosphere. It is an high end food court if I have to classify them. \n\nPlus area - Parking is the best in the area. Plenty of the parking place. Variety of the food to attract people is very good. \n\nDown side - Giant food court. Line everywhere. The price of the food is not cheap. Restaurant level price. It is about 20% more than average. Only one water station. I don't like the table setting. A lot of share table. The table is not clean. We have to clean ourselves. \n\nThis place is a big warehouse for a lot of food vendor. It is a new vibe for the area. I wonder what the summer like in this area. It is going to be hot for the design and set up of the building. I guess we will find out. \n\nI would pick a place has sit down and order the food. Not sure about line standing wait for your turn.",
    "date": "2018-02-13 21:53:18"
  },
  {
    "review_id": "s_wo96bT5ehi1XXVojQTeA",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "bY55freuP8C_wr6y5Fid7w",
    "stars": 3.0,
    "useful": 4,
    "funny": 0,
    "cool": 2,
    "text": "This restaurant is a landmark. Local have eat here for long long time ago. Even today, many families bring their children and grandchildren to eat here. Many memories was in this restaurant with the picture plastered their entire walls. \n\nIt is not my regular visit restaurant due their odd hour and distance away from my work. I come here when I have an off day. We walk in at 1:40 pm and they are still very busy. If you see a gringo walk in 50% may be tourist. Obama visited this place in 2012. As a result a \"Obama\" Cuban sandwich in the menu with the way he like Cuban sandwich- add lettuce and tomato.  \n\nWe have order the Vaca Frita fried shredded beef and the Tripleta Sandwich. The Vaca Frita is prepare good. Only one thing if they can make the edge of the meat burn a little bit to create the burn taste over pan grilled is better. Compare to many Vaca Frita I have, this is below average. The Tripleta sandwich is good taste. I like the little fried in it. It come with three different meat - ham, pork and shredded beef. This is how it get the name. \n\nOverall my experience is average. I think the servers are run out of the energy to serve us. They seem tire at the last hour before closing. The whole store seem chaos. Not much to organize. Long line for to go order. Not much of parking space. I believe a lot improvement need to be done. However, the price here is very very affordable. That is how they got their customers.",
    "date": "2016-12-25 13:12:11"
  },
  {
    "review_id": "ZVr00iOyOep1tis2_xfDvw",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "3ulQuG_qOiN8kT3_nww0-A",
    "stars": 3.0,
    "useful": 16,
    "funny": 4,
    "cool": 14,
    "text": "The cafe is at American Airlines concourse. It occupies the prime center location. We are glad that finally the airport has some great restaurants for people. Mise en Place is one of them. \n\nThe menu is simple. They have flat iron steak sandwich or hanger steak dinner plate. This bring up the standard of the airport dining. I did not order any of that and I got the Mahi Mahi. It is grilled mahi mahi with sweet potatoes, corn and spinach. The stir fry veggies is great. The mahi mahi need work. It need to have burn a bit with less wash sea taste. Unfortunately the Mahi Mahi doesn't standout. If not it can be better. \n\nService is good since the bar has easy access to food he server. Food came out quick and allow me to boarding with plenty of time.",
    "date": "2019-02-22 16:01:48"
  },
  {
    "review_id": "vX-KkHbrRxxW6LOhokHEfw",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "vOXoM9W8-CpHbZUiGbL3dw",
    "stars": 3.0,
    "useful": 21,
    "funny": 7,
    "cool": 16,
    "text": "It is about 3.5 stars restaurant. The restaurant opened the door 10:00 am. I was the 10:45 for lunch. I was surprised they already serve lunch. They have the stand alone building with a lot of parking. \n\nI got the beef combination pho and the bean and jelly drink. The price is at the mean level. The combination beef noodle is good and refreshing. The soup lack off in compare to other place is the beef tender and beef brisket. These are the item you found on most combination pho. \n\nThe bean jelly drink is delicious. The mung bean is great. The red bean is whole piece. I rather it grind like paste. Overall the service is quick because I am the only one there.",
    "date": "2019-02-12 10:01:57"
  },
  {
    "review_id": "oSGgMbEzDZsnRLDiDqIj9A",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "cXm3EXarmMkvcoEwQgqilg",
    "stars": 3.0,
    "useful": 4,
    "funny": 1,
    "cool": 2,
    "text": "Arepa and Pitas make up the restaurant name. This is a new concept of the combination of two country food for the fast food. If they are successful, they can be like other fast food chain selling their franchise. \n\nI stop by for a snack to try them on. I have the arepa with the Shawarma beef. The beef is slice and in shawarma sauce. I have added the hamus, lettuce, and cucumber. The beef is a bit dry for me but the  marinated meat is there. My wife like it however I just it is just worth it. This concept of the selection of assembly may work or may not work. So I cannot fully said the restaurant do not have the right ingredient because the customer makes decision on the assembly. \n\nFor the reason above, partly is customer and partly is restaurant I cannot fully make the decision on the food. But base on the keeping the material warm and juicy I am grading it worth a trip with 3 stars. There are thing can be improve such as come out a suggested assemble item that is work and taste good so the customer will not make mistake. This is vital for new concept restaurant to survive and get repeat customer. Good thing is their price is affordable.",
    "date": "2015-04-04 12:03:52"
  },
  {
    "review_id": "vpWtUtNuS_-vAaVv2P_d2g",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "EfGEm1Z4fkUSb41NTG8Plw",
    "stars": 3.0,
    "useful": 17,
    "funny": 4,
    "cool": 15,
    "text": "This new place has promise future. Great concept for a dessert spot in the New Tampa area. They are in the Pointe plaza. They just open not long ago. I think this is a crucial time to attract customers to repeat visit. \n\nI like the concept of ice cream and cup cakes. They have an item with the mix of cup cake and ice cream together. We did not try that. We did try their ice cream. The price is at the high side of the ice cream per scoop. One positive thing is we like their ice cream flavors whit different taste than most of the ice cream place. We got the strawberry and salted caramel crunch. The flavor is great potentials. \n\nAs I said, they just open. The ice cream scoop up is just peeling through not entire scoop. It is kind of small for two scoop with almost $7. The price is at the high side. To attract more customer need to be generous at the beginning. Second, most item is almost sold out when we visited at 8:30pm. They need be able to have customers try everything what they can do. Need to have a good start.",
    "date": "2019-04-21 11:43:08"
  },
  {
    "review_id": "1GwvrEMoZtMqmTM7gULHrA",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "vLT1DBDuJpchewphXR6i0Q",
    "stars": 3.0,
    "useful": 4,
    "funny": 3,
    "cool": 2,
    "text": "It take a long drive from New Tampa to this restaurant just to try it out. Since we're are visiting the Citrus Park Mall, may be a good idea to come here for the book mark we have. \n\nArrive the restaurant at and the waitress ask us to sit any where you like. After sit down and ready for the order, four of the regular show up. The restaurant waitress came by and said since we have not order, can we move to smaller table. I am ok to move but there is another table can sit four behind me. Just don't understand why we have to move. I would said for this situation, they need to give us a free appetizer if we do a favor for them. \n\nForget about the situation. Let concentrate on the food it self. Our food come out after the four people who took our table. We have order the the lamb kabab. The food only have six ounces on the grilled lamb. It accompanied with fresh salad, hummus, roasted potato and rice. Among all the rice is the best. Overall taste is good. \n\nI would give a 4 stars for the food. But value is not there for $14.59 dish with 6 ounce lamb. A bit in the high side. Service is below average. Treatment for new customer 2 stars.",
    "date": "2016-05-15 16:07:50"
  },
  {
    "review_id": "63F6xd_BHYhTx0fcNWaVrQ",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "JhYqHLZLqLMsnbYveUuqjA",
    "stars": 3.0,
    "useful": 20,
    "funny": 4,
    "cool": 12,
    "text": "It is about 3.5 stars. The food is simple and easy to order. During pandemic, the social distancing was observed. The restaurant is located at the prime area of river. May be they can add outdoor seating with river view to increase attractiveness of customers for margaritas and more. \n\nWe got two taco, the Lengua and Cabeza. This two taco is good. Portion is small. I like cabeza better. The nest dish is steak quesadilla. It was not fully packed. But the price did match the quantity of the meat. Good melt cheese. The last dish is the mixed fajitas. It has chicken, shrimp, and steak. I would suggest if you order, just the steak is good enough. The steak has good marinated sauce in it. It come with fried bean, salad, and rice. \n\nOverall the price fare to match the quantity. In Chinese saying, one cent price match one cent goods.",
    "date": "2020-08-21 13:14:07"
  },
  {
    "review_id": "b_3y3vMTJhs5m06gGAaXLQ",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "sF0QuOuySsTEbYbIbu3bww",
    "stars": 3.0,
    "useful": 6,
    "funny": 4,
    "cool": 7,
    "text": "Before any mini donut, this shop has serve Gourmet donut for many years. As today it still serve the famous donut nut just to the high school across the corner, many has come here for the donut. They are famous on the bacon maple donut. This is their best seller. \n\nWhen we have visited the store, they run out of bacon maple donut. I choose other options. I have the new chocolate banana. It is drizzle with chocolate and the filling is banana flavor. The chocolate touch is ok. The infill is better. I am use to Bavarian creme but banana creme is better. \n\nMy wife has the apple fritter. This is a strange donut but interesting. When we visit them, they almost closing up the store. So the donut has been sit for some time. I will reevaluate them when I revisit them. The only complaint is they close at 12:00 everyday. This is only morning business.",
    "date": "2017-09-10 19:47:36"
  },
  {
    "review_id": "vbu6sbrRu1o9gN44QLhaKg",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "W57360g1e7xMGerm7wPW0Q",
    "stars": 3.0,
    "useful": 21,
    "funny": 5,
    "cool": 17,
    "text": "I like old Channelside better because of more buildings. The ideal with open space is good but the ship container really did not display the beauty of the place. I like the open view with seating and view for the bay water. Some how they have least to offer. It just look cheap with current look. I like the bathroom and security everywhere. \n\nIt is great for family with open space but we miss the courtyard. It is try to be hip but not totally hip. Something is missing. Food selection like street food and we have a few spot in Bay Area which compete off. Not sure change for good but definitely not better. May be great for new year eve fireworks. But just one day out of 365 days.",
    "date": "2019-02-09 15:25:51"
  },
  {
    "review_id": "Z0M_Ryh7kSUyz7acjntHmQ",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "Y6kqH6C50FFL_qC878ZNtA",
    "stars": 3.0,
    "useful": 21,
    "funny": 3,
    "cool": 17,
    "text": "I was attracted by their creative flavor. This is the branch ice cream store from YBOR city. They have the corner lot which is perfect for the customers to hang out and enjoy the ice cream at outdoor side lawn. They do have seat in the store and front of the store if you decide to stay at eat. \n\nToday they have the new flavors with frosty candy cane for the holiday season. I also heard the friend of my like their guava pastelito so we try one of that. I also go with the crowd favorite the chronic popcorn. Because of pandemic, they don't have the taste try. So I order three scoop. Not cheap for the scoops. But each scoop is big. I ask if they can separate it. They said we have to get all three in tiny bowl. If not I have to paid three individual scoop cost. I would said the three scoops mash together is not good. Flavor mixed up. With no taste try, I can tell you 2 out out of three are not my favorite. I would throw away the other two. The best is still the crowd favorite the chronic popcorn. \n\nWith above reason, the about 2.5 stars. Next give a bigger bowl when I ask for it to separate the scoop. The request is reasonable but they did not provide it.",
    "date": "2020-12-21 21:19:57"
  },
  {
    "review_id": "kXDD3X8X9yqXuYwQEIYTgg",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "jStt26nV-CBWRGxjqCzxUw",
    "stars": 3.0,
    "useful": 12,
    "funny": 4,
    "cool": 12,
    "text": "We are trying their lunch instead of breakfast here. Just want to see how it was incomparable to many breakfast place serve lunch. \n\nThe store location located in a very busy plaza during lunch. All this due to many restaurants are at the same plaza. Parking is a challenge during lunch. \n\nThe line was not long and we got our order in rather quickly. Many have come to here for take out. The food also come out quick. I got the jalapeño cheese bagel with egg, bacon and cheese. The food come out warm. I was thinking if I am eat here, I would at least get temperature hot sandwich. Not so. \n\nI like their ice coffee. I got the vanilla sweet cream cold brew. The size compared with the price to paid  is at the high size. Good coffee. \n\nOverall experience is a par. Can be better if you dine in.",
    "date": "2018-08-21 01:23:39"
  },
  {
    "review_id": "Jrr3XoZrhrLA_o71rHBRqA",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "EJ_ua43d33kN-rnc71LPLA",
    "stars": 3.0,
    "useful": 9,
    "funny": 1,
    "cool": 8,
    "text": "I like this restaurant because they are most affordable in the area. The price is reasonable with amount of food they have provided on each dish. Basically the amount is good mother and a child or two older person. For young adult is plenty. You will not go hungry after visit. \n\nThe downside of the restaurant is every thing take too long. It take more 10 minutes after they drop the menu and come to take your order. Often they forget to bring what you need for additional things. The service did take a back seat in this restaurant. It is not they don't have enough help, it just the mentally slow in this restaurant. \n\nI got the sautéed palomilla with Mofongo. The first taste is great when dig the outside of mofongo. After you get to the outer layer, it lost the best taste. The palomilla I prefer it to be grilled instead of sautéed. However, they don't have this option.",
    "date": "2018-10-27 21:58:03"
  },
  {
    "review_id": "FvBHSnXeT0wapgovjt8RKA",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "psOqIF1o1wEIMW-TmylBcA",
    "stars": 3.0,
    "useful": 11,
    "funny": 1,
    "cool": 7,
    "text": "I was here for a take out. They have BBQ grilled in the store. You can see your meat grilled in front of you. This restaurant is local favorite. Other than BBQ, they also has some southern food in their special menu. \n\nYou can get any BBQ meat and add in the rib with each bone with $2 extra. I got the half chicken and extra two bone of BBQ rib. This come to $15 with tax. Not cheap. The chicken I think is to dry and a bit of sit on the grilled for too long. Not juicy at all. But the rib was good enough to have. Our meat come with cob of corn and BBQ baked beans. I like the baked bean because it has southern sweetness. I would only recommend only the rib for this place. \n\nAfter order take 10 minutes wait.",
    "date": "2020-02-15 14:11:18"
  },
  {
    "review_id": "YvXu8OjqdQG7-e1ezn-dZw",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "lsO4nMqeEPIT5QZ9jQ9G5g",
    "stars": 3.0,
    "useful": 4,
    "funny": 1,
    "cool": 1,
    "text": "Endless sushi is truly endless if you going for the all you can eat. The interior decoration is very nice and modern. This is the place for two person can have the romantic date. This all you can eat concept is a copy from the other Japanese restaurant in New Tampa. They will be judged and compared to the similar restaurant. \n\nTonight we are trying this restaurant because they are recently open and new in the Bay Area. We have dinner buffet and they limited each person to 8 pieces of the sashimi if you have dinner buffet. The Sunday dinner buffet is $17.99 not $15.99 per the web site. Tonight we have order the following:\nSpicy Tuna Roll - 2 Stars\nSpicy Salmon Roll - 2 Stars\nShrimp Tempura Roll - 3 Stars\nRainbow Roll - 3 stars\nCrazy Roll - 3 stars\nLady In Red Roll - 3 stars\nSaki Roll - 4 Stars\nThe Coconut shrimp should not be calling in that name. Most recognize coconut shrimp is fried with coconut flake. This is just the wet flour coating fried with sweet mayo. It is different than my friend Rachel M. posted picture. I wonder they start changing their quality. The Hibachi squid is not near to the standard with most hot plate includes the minor burn of the squid. The sashimi is better since they are base on the cut. The best of the sashimi is the surf clam. This is the most value of the dish. The hibachi tofu is perfect for taste and texture. The fried scallop is not the true scallop - disappointed. Age tofu is OK. \n\nThis section is to evaluate the chef skill and material. The spicy tuna is process with food processor. As a result, they are lumpy. The correct way is to chop in pieces and mix with correct spice and quail egg. By chopping it create the texture of the tuna and preserve the quality. The food processor just a short cut. Same as the spicy salmon is process that way. After I eat the sushi, I can smell the fish smell around my lip, although they are fresh but they are not the best quality due to the smell. They should not call out coconut shrimp or scallop to give customer a misconception where they are not prepare in those ingredient. \n\nThis restaurant will require a lot of improvement not just the chef skill. They also need to improve the flavor of each roll to show it is not too plain. I am thinking this restaurant is 2.5 star bases on the comment above but I am given three stars. I hope they can have dramatic improvement for the next time I am visit.",
    "date": "2015-04-06 01:36:57"
  },
  {
    "review_id": "3D8d7wF4Mt2el4ZneGJ54A",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "X9e_btDPux6JGqqw8UF_Pg",
    "stars": 3.0,
    "useful": 3,
    "funny": 2,
    "cool": 3,
    "text": "I have been to this restaurant many times. Some time I bring my boss here since he like sushi. We have our office celebration here over the hibachi table. Some time we got good hibachi chef have a lot trick some time it just ordinary hibachi chef. Some time you catch the food that the chef threw at you. \n\nWhen I come here, I like to have the dancing crab roll, Koizi roll, spicy tuna roll. There is roll call sexy girl roll. This is spicy sexy roll with spicy tuna and tempura shrimp with spice mayo. No sure the name matches the roll. We usually come at lunch because is all you can eat with lesser price compare to dinner price. \n\nThe reason I give 3 stars due to current quality of the restaurant drop. Food is still good but they are not as good at the first year they open the restaurant. The service is still good. The hibachi chef is base on your luck. Sometime you get a good chef.",
    "date": "2015-09-03 04:23:48"
  },
  {
    "review_id": "rKgQchlEsVmP4R_ec_yjUg",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "9uRj85PviKNiMCYPwiJyIw",
    "stars": 3.0,
    "useful": 0,
    "funny": 0,
    "cool": 2,
    "text": "The outside sitting at this month is very pleasant. Blue sky no cloud and you not in hurry while you enjoy your lunch. Our office decided to celebrate a win of project at this restaurant. This restaurant is the seventh series of famous Columbia restaurant. The lunch menu is reasonable price. Since we have a big group, the outside sitting waiter have a lot to cover. He have a slow start to get our menu. Then the food come out faster then I have estimated. The speed of serving is good after the food is out.  \n\nI have the Mahi Mahi Cayo Hueso.  It is grill Mahi Mahi with mojo marinated. It is good. The soup of chilled gazpacho is taste better than lunch entree. I also ask a dish to go for the coworker that cannot make it. The order is done in 5 minutes. This mean this is cafe style precook items and assemble on site immediately. The temperature of the food is warm and further evident precook item.  This may not be the cook to your order place.\n\nFriday and Saturday night the y have live music at the river front. This may be the best time to take a sip and enjoy.",
    "date": "2014-10-17 18:17:59"
  },
  {
    "review_id": "ADpA5Ks8-NpPWXQlCUxQxQ",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "huta5nl96oXBxnFIQeMTTA",
    "stars": 3.0,
    "useful": 7,
    "funny": 2,
    "cool": 5,
    "text": "Been to this place several time but never give a formal review. It is due to undecided what to give this restaurant. Finally settle on the average of the review. \n\nThis restaurant located on the main entrance of the sawgrass mall. I have been here to wait for friend or a drink. It has a nice outdoor seating. It is very nice on the cool month. \n\nThe food is so so. It is actually not a wow factor nor bad. The service is good which keep this restaurant in business. But to compete with the two neighbor bar, they may need to step up on the menu or some signature drink.",
    "date": "2016-04-30 03:45:56"
  },
  {
    "review_id": "QfCC3ZvkzlGfC43hS0p6PA",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "ACHVRhkmpCuT7WQQjzt07Q",
    "stars": 3.0,
    "useful": 11,
    "funny": 2,
    "cool": 9,
    "text": "Some like Starbucks and some like McDonald. I will prefer Dunkin Donut coffee. They are most reasonable and provide the best taste and value to cup of Joe. Their reasonable price with right coffee bean is choice of selection. I also like their ice coffee and frozen drinks coolata. Those are my favorite. \n\nCurrently they have many types of coolata. One time I got the pumpkin spice coolata at the Halloween. The ice coffee with cream and mocha is my favorite. It is cool like cucumbers. I don't like hot drinks that much. But the frozen drinks and ice drinks are great here. Just like Southeast Asia. \n\nDonut is just ok. Some time I like their french curly donut. Sugar donut is the best. I really don't like the glazed donut. But the Bavarian cream infill is great. You can order online without wait if you in hurry. Once you have the app, everything can be done online before come to the store. Lessen the wait time.",
    "date": "2018-03-13 20:54:51"
  },
  {
    "review_id": "JnBJ8PFZl6EVrD9fPhJMuA",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "c8wnPWZJvsgei2O9PE71Mw",
    "stars": 3.0,
    "useful": 1,
    "funny": 1,
    "cool": 2,
    "text": "I have not been in the IHOP for a while. I mean a while is minimum 5 years. We decide to go there have the snack at 10 pm before the cranky night. We have the coupon with free four pancakes.\n\nWhat I have use to a dish with fried half hen is no longer serve there. The menu is change a lot. It went to tradition American cuisine. I found myself lost looking at the menu. However, they still have different type of crepes in the menu. I love their crepe. That may be the only thing not change. But they did add chicken florentine crepe. I got to try that and they my new found love here. The crepe is cook along side with the wrapping ingredients. The ingredients are chopped chicken breast, spinach, mushroom, onion. These ingredients are stir fry and add on top of crepe then top with Swiss cheese. The cheese melt away and the crepe top with hollandaise sauce. This is creeeeepy day for me. But they are good. \n\nOverall the pricing with the food some good value and some are not. Service is great.",
    "date": "2015-07-02 22:48:53"
  },
  {
    "review_id": "jAIKpuPZUS27OjRE4kpodA",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "yiE_Iym7A9wa6tyJHkWzhw",
    "stars": 3.0,
    "useful": 17,
    "funny": 6,
    "cool": 14,
    "text": "It was great to see new kid in the block. The name of the restaurant is sound interesting. This is actually a fast food set up. The six major things they are serving is wings, fish, shrimp, Philly cheese, burger and fried rice. Food price is in the middle of fast food chain. \n\nThere are three different fish you can choose. Whiting, Tilapia or Catfish. The catfish will have a dollar difference. I got the fried shrimp and whiting for $9.99 which includes the drinks. Ok deal. My wife have the Philly cheese steak and the six wings with teriyaki sauce. Cheese steak is good. The chicken is fried correctly. Not much can said about the food. They are not wow factor but does the job. No standout taste. \n\nI do like other than food, you can get specialty drink with boba. We have cappuccino and mango slush. It just need to add the upgrade fees. Overall is good.",
    "date": "2018-05-09 01:17:18"
  },
  {
    "review_id": "TprrG8ES1X_5nSohZta8pQ",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "DsPomqfQZ44v5wD-My6dIQ",
    "stars": 3.0,
    "useful": 17,
    "funny": 4,
    "cool": 8,
    "text": "Taco. Yes they do serve that. They also has the mixed in bowl. I would said the mixed in is not the the Mexican anymore. It is more into fusion. It is first new concept for the Mexican cuisine. \n\nI have order the bowl instead go to their taco. Actually I am not a fan of bowl here. The surrounding area already have many bowl systems restaurants. I got the two proteins with fried chicken and fried shrimp. I have guacamole rice and noodles as the base. The veggies are the Brussels sprouts and grilled broccoli. The topping is pineapple and cucumber cilantro. \n\nThe restaurant did attract a lot young crowd. The bowl is just average for the quantity. I can see the bottom of the bowl. So it is not cheap either with the quantity they have. Good for quick lunch. Other than that, no wow factor.",
    "date": "2018-08-25 16:36:45"
  },
  {
    "review_id": "xsaJZJN_6NZS8tz8BkZcxw",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "Bii6sQO2QNinBq9vdakNBg",
    "stars": 3.0,
    "useful": 6,
    "funny": 7,
    "cool": 6,
    "text": "Fancy place to dine. It has a good decorations and great entrance. The salad bar is impressive. With beautiful center decorations arrangement. It is very busy in week day. \n\nWe got into second seating. Our dinner start at 8 pm. Which is perfect for all you can eat. I like the salad bar many item including hearts of Palm, shrimp salad, grill pineapple, and more. I have the lobster bisque at the end of meal. But not impress on it. No shrimp or lobster. \n\nThe meat went on when they bring it to the table. The sirlion and the skirt steak are the best. That all. The rest are too salty. I could not taste the meat. If you pay $$$$ money, the steak or lamb should be better. No fireworks. \n\nService is great, meat are below average, salad is good. Been here done that.",
    "date": "2016-03-31 04:56:05"
  },
  {
    "review_id": "Kk0UxogExbiibsT3O4TYrA",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "zCS3t1ysH2WTuHxJVrRevw",
    "stars": 3.0,
    "useful": 7,
    "funny": 0,
    "cool": 3,
    "text": "It is good to see new branch from Outback Steak House. It want to serve like fast food as for the new concept. Unfortunately their food preparation not fast at all. I have to wait for 15 minutes after order. There is no line on order. But there is a line to wait for the food. This part of business may need to improve. \n\nAussie Grill open their business in food court of the Brandon Westfield Mall. It has advertisements at the entire hallways of the mall. It does get a lot of attention from mall goers. I got the seared beef tenderloin and crispy volcano shrimp. I got it medium rare. For the beef. The meat quality is a bit better than average. But I don't like the seared technique. I prefer grilled. Grill will enhance the taste. I do like their volcano shrimp. It was done right.",
    "date": "2020-01-13 15:53:07"
  },
  {
    "review_id": "SRz_Gy28BBOhNYguc74TWA",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "rl-3sALujU36QSHgYksKPA",
    "stars": 3.0,
    "useful": 13,
    "funny": 3,
    "cool": 11,
    "text": "The actual name of the restaurant is La Gloria Mexican Restaurant. It has Latin dish. But more into Mexican cuisine. The restaurant is quite on the opening hour. During that time, the English communication is limited until a manager show up. But the store clerk is friendly. They allow me to taste what I don't understand in the menu. \n\nI have carne Asada Plate. This dish come with grilled steak in Mexican marinated sauce. It also accompanied with rice and baked fried bean. The bean was well done. The steak is so so. I also got two tacos. One with the grilled tilapia and the other is grilled shrimp. Both of them look flat on taste. Not much of grilled mark.\n\nFood is average. But they do have some other authentic dish. May be try those. They do have their daily specials on the board. Check those out.",
    "date": "2020-12-24 15:25:53"
  },
  {
    "review_id": "ebbMEdsBFJH5PfsCwQzgXg",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "a8CrdVtlfa3JDoC_ADW8dA",
    "stars": 3.0,
    "useful": 9,
    "funny": 1,
    "cool": 5,
    "text": "This Mexican restaurant has inside and outside seating. The outside seating area is to accommodate the customers who smoke or with dog. The bar area is at inside serve extensive drink menu with TV. You can enjoy a gameplay there at football season.\n\nI got the Steak Monterrey. This is skirt steak marinated with and grilled. It accompanied with rice and stuff poblano pepper top with habanero pesto sauce. The stuffing is with shrimp, mushrooms, onion over melted cheese. The stuffing is actually my favorite. However, the main item skirt steak is very tough just to cut. It take me a good 3 minutes to chew a small piece. Meat quality is not that good. It the meat quality improved, this restaurant has potential. \n\nThere is plenty server on the floor. You always can get their attention. Service is good. Not sure about the drink. Seem like each waiter prepared their drink order which tell me no set bartender.",
    "date": "2017-09-20 21:06:30"
  },
  {
    "review_id": "gfvXzaq5HymQDhR68rkJRw",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "x5NLYIRLdhFBaNLLvl8Afg",
    "stars": 3.0,
    "useful": 13,
    "funny": 4,
    "cool": 10,
    "text": "Bar Louie is more open connecting to outdoor. But I do not like darker corner when you seat inside. This bar is second stop on our progressive happy hour tour. \n\nWe started with fried calamari. The calamari is a bit tasteless because the coating is not interesting. May be make more floppy and spice with be more attractive. The second item is the chicken quesadilla. This is more interesting. But still this two item are not attractive enough in compare to nearby happy hour restaurant. However I do like the martini. Their signature martini during the happy hour is very good. I have the Diva martini. I like that one. \n\nI think the drink is better than the food. They really need to work on the food to attract more customers during happy hour.",
    "date": "2021-05-22 23:00:05"
  },
  {
    "review_id": "aqH4I0z0LduDdcz6vCdx0w",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "aTBBfJKm8WnHvs0v_62Hmw",
    "stars": 3.0,
    "useful": 31,
    "funny": 8,
    "cool": 20,
    "text": "About 3.5 stars. We visited at 5:30 Friday, the line has not build up yet. We were able to get a table inside. There is not much of service. The person who take order is a bit slow. He just sit at register for taking order but still slow. The kitchen crew are more alert. They got your order and fried the chicken immediately. \n\nThe Nashville style chicken is using wet batter coating systems. Most of the fried chicken place use dry powder battering then fried immediately. This place have coating mixed with spice and wet it with water. The chicken then dip into the wet coating and fried. This system is more challenging. The Chinese fried chicken is like this system. Why they are 3.5 stars is because the coating getting compact and concentrated. Which mean the oil is old and repetitive fried. The fresh oil or change the oil so often will make the chicken better coating. \n\nOne best thing is the seasoning and the Nashville hot is very well receptive. This is not like Asian hot that numb you mouth and could not taste the food. The hot is acceptable by many Americans. You still can taste the hot heat and the food in the right amount of chili. This I would give them an \"A\". Price is about most fried chicken place. But I do like their fried and the pickle. It was good.",
    "date": "2019-05-04 12:05:49"
  },
  {
    "review_id": "o9-vqDc_qxT8FvsGlJhHyg",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "3RJbZk_yDY7D62Xt9t88IA",
    "stars": 3.0,
    "useful": 20,
    "funny": 2,
    "cool": 7,
    "text": "I think this Thai food has potential. It is at good location. The thing need to improve is the wok technique. Other than that, the interior decoration, furniture and service is measured up to 4 stars. \n\nWe started with squid Tom yum soup. Their Tom yum is lean to sweet side instead of sour. The soup is good. We order the Siam Noodle. This is their house special sauce with shrimp and chicken stir fry rice noodle. I think they are just average if this is a house dish. Not attractive. \n\nWe also order a drunken noodle. We order Thai hot but it is not measured up the heat. The noodle not even burn the edge show this stir fry is not quite high heat with oil. Basically they need improvement. If the cuisine can improve, they will be good Thai here in compare to Bay Area Thai food.",
    "date": "2019-08-15 01:25:48"
  },
  {
    "review_id": "etm6ylYkSgzut5uXL8JtzA",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "vEhuYWMnJq9XmWp6JOjYLQ",
    "stars": 3.0,
    "useful": 11,
    "funny": 3,
    "cool": 11,
    "text": "This restaurant has high ratings. Consider one of the popular in the area. During lunch time, the restaurant is pack. They are not too far from Highway I-275, as a result I stop here for lunch. \n\nI got the traditional dish. I got the Bandeja Paisa. It typical Columbian dish with samples of all cooking. The dish includes grilled steak, sausage, chicharron (fried pork belly with skin), sunny side up egg, arepa, rice and bean, avocado, and sweet plantain. This is to show case the entire cuisine. \n\nWhy three stars. The steak not even close to warm. The sausage is powdery. The egg yolk over cook. It is not liquidity. The best of the dish is the chicharron.  It is crispy and good. \n\nThe service is great. It is not bad at all for the price of the dish $13.50. The service is good. If the cooking can improve, they can be easily 4 stars.",
    "date": "2018-08-17 02:09:11"
  },
  {
    "review_id": "yddL0AOZ9rKqe71JhtB8ag",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "tGNuMvHoHcPShruQIYKQnQ",
    "stars": 3.0,
    "useful": 16,
    "funny": 5,
    "cool": 12,
    "text": "It is an interesting Lao's grocery store. I was hope to get some cook food deli like it show on the store front. Seem like the deli did not operate. We enjoy our shopping there. We pick up few item we have not seen before. \n\nWe got crispy fish chip. Interesting looking. They do have meat department. You can get all pig intestines, stomach or kidney in this store. The store also have some homemade dessert you can pick up. The veggies section is small but sufficient. A lot of frozen seafood. \n\nOverall this market is small. We like some item we have not try before. Good experience.",
    "date": "2021-08-02 18:42:43"
  },
  {
    "review_id": "uYsVOos4QAwS-qpSBBVuZA",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "QZqNkjxX7xNg1RPFFVhB5g",
    "stars": 3.0,
    "useful": 9,
    "funny": 1,
    "cool": 7,
    "text": "This is the first gas station exit for I-275 northbound after Sunshine Skyway. If you need gas after the long bridge, this is the place. Price is reasonable by considering this is at the southern part of the Pinellas County. You may guess they can charge arm and leg but they did not. \n\nThe total have twelve pump. Enough to handle the surge of demand. It is easy to get in and out here. It also has plenty of space to maneuver your car around their parking lot. Security cameras is pointing to the direction of the pump which makes this place safe.",
    "date": "2018-08-31 00:59:17"
  },
  {
    "review_id": "xd8VzVCzSvo0Gpbum7CMtw",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "kwC1oEbmYx4r3xLCd6rYSQ",
    "stars": 3.0,
    "useful": 7,
    "funny": 4,
    "cool": 8,
    "text": "Tung- Tung is one of the few Chinese restaurant that do deliver. The food is average but the deliver is very convenient. We work late in night and few hungry this is a good restaurant to call. They are few restaurants in Temple Terrace answer a call for delivery. \n\nMany of my friend order veggies or chicken fried rice. Mostly American Chinese food. I actually go for true Chinese food. I got the beef chow fun. It got the sauce and correct wok heat to make it delicious. However some of the noodle has not separated on about 5 % of it. However, they are still good. The beef is flavorful but not tender enough. \n\nOverall they are still good. If we have the delivery again, I will still order the same thing.",
    "date": "2017-12-11 05:02:05"
  },
  {
    "review_id": "DxuTxNq8tzSsalF-Qi5y0g",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "3qW1zZydmtZMA6RIsaoGrA",
    "stars": 3.0,
    "useful": 23,
    "funny": 6,
    "cool": 16,
    "text": "Very close other big oriental supermarket. Some of my friend like this place due to great price and good amount of veggies. Thankfully they open during pandemic. They do control amount of people can enter the store to avoid crowded situations. \n\nThe store have only basic oriental items. Definitely is local favorite. Not for me who are out of town people. It has item I need. I would said it is good carry on the butcher section for type of meat you want.",
    "date": "2020-05-20 23:50:25"
  },
  {
    "review_id": "sbfvWk8JD5XuHdEB1qIkgw",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "PRsj49qMOyW9fbztKrRglg",
    "stars": 3.0,
    "useful": 9,
    "funny": 2,
    "cool": 6,
    "text": "This is the second PDQ that I have visited. It still good on People Dedicated to Quality. The place is clean and neat. The food is still good but not as good as the first one I have been to.\n\nWe got BBQ bacon and Hawaiian chicken sandwich.  The Hawaiian is still good. The BBQ just average. It is a bit too sticky. The Hawaiian chicken is still the best.\n\nThe side order of zucchini fries was to soggy. It can be better with extra cost for the combo meal. Other than that, everything is good.",
    "date": "2017-11-06 12:38:46"
  },
  {
    "review_id": "6tSc3fa9IEbIypsucTAJQg",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "q_dCXxrhNDMEpc71CVL4Kw",
    "stars": 3.0,
    "useful": 14,
    "funny": 2,
    "cool": 10,
    "text": "Tara is not allowed dine in during pandemic. But the take out is available. The store open to customers who want generous on the quantity portion. \n\nI got the the stew Oxtail. This dish come with one side of choices and rice. I have the cabbage as side. The oxtail is stew in high pressure to separate from the bone. Number oxtail given was three big pieces and one small piece. The rice was given generously so you will have full stomach. Great for dinner portions. \n\nOverall experience is at average. Food is ok. Definitely is budget place in compare to many restaurants.",
    "date": "2021-05-18 17:17:56"
  },
  {
    "review_id": "xaea1ZuMUv7h5zUxD3fRug",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "PbTQTEWkuJ3Rmql18lGQsw",
    "stars": 3.0,
    "useful": 5,
    "funny": 4,
    "cool": 6,
    "text": "Dominican restaurant that provide a lot vibe and economic dinning for the local. Many people are here for a meal in saving price. We are here to try out the food for the first time.\n\nThe restaurant has the two choices for the food. You can pickup by cafeteria already cook or from the menu. We have order two dishes from the cafeteria and one from the menu. The first dish is a soup with tripe, pig feet, and veggie. Most people only cook tripe soup by it own. It is good twist with the pig feet. Good soup. \n\nThe second dish is a tomato base whole fish. It look awesome but it not my liking taste. Fish meat is too loose. The third dish is a cook up dish of grill steak with onion. I can hear they pound the steak at the kitchen. I like my steak grilled with no sauce. But Dominican steak has sauce on top but a bit salty. \n\nThe food is average. If I choose Latin food, I would go with Cuban style bistec. Service is cafeteria style.",
    "date": "2016-05-06 03:21:24"
  },
  {
    "review_id": "HmvDdox1-UA3BV37O8a8hw",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "DSrRt2Fcrj0bQv8SC3P-3w",
    "stars": 3.0,
    "useful": 16,
    "funny": 7,
    "cool": 14,
    "text": "La Hacienda is popular among the local. The plaza parking lot always pack. Most car come to this restaurant. Parking is rime here. We were here at 2 pm. The place still pack. We were lucky to get a table. People who behind us have to wait. \n\nThe food is good. I have Paisa Bandeja Hacienda with upgrades steak. This dish has steak, chicharon, blood sausage, regular sausage, rice, egg, plantains, bean soup. A lot to offer. The chicharron is a little tough to bite de to the skin is or crispy. Like rubber. This can improve by changing the frying oil and keep it crispy. The rest item is a little above average. My wife love her dish. She has Filete de Pescado al Ajillo. The Ajillo sauce is great. I would highly recommend this dish. It is one of the kind. \n\nThe reason they are 3 star is the wait for the food is too long. We waited almost 40 minutes. No wonder the restaurant always pack because everyone is waiting for their food. The chicharron is a typical dish which they must master before anything else. I hope my next visit they can improve on that. They have bakery section. To me is just ok. Bit my wife like it.",
    "date": "2021-01-29 15:03:00"
  },
  {
    "review_id": "LVHestqTSy06b6AM4fIIpA",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "SLuak4P9JyB_T6DsksOIIQ",
    "stars": 3.0,
    "useful": 17,
    "funny": 1,
    "cool": 8,
    "text": "It is just ok for the BBQ. This place is kind of new at Brandon area. The store front was decorated with Christmas item when I was visiting there. The draw some new paint on the windows showing the Santa clauses and Mrs Clause. \n\nWe got the sampler platter. It got Saint Louis rib, pull pork, brisket, quarter chicken and two sides. The chicken meat is too powdery. The pull pork is too dry. Only the brisket measure up to the standard. The rib is average. May be is off day for them. It is not up to par.",
    "date": "2022-01-06 00:34:41"
  },
  {
    "review_id": "kj2frs3hOKh_nNInbWxzbg",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "DA_h6Kz5382NcSm4D6r_lQ",
    "stars": 3.0,
    "useful": 2,
    "funny": 3,
    "cool": 2,
    "text": "Drive through is sloooooow. It take 3.5 minutes to move a car. If you cannot wait, just walk in to the counter is faster. I figure if you see more than 5 cars ahead of you, just walk in. This store clerk need to process a bit faster. \n\nFood is good, just service is slow. I believe they can improve on this front. This store now receive a face lift. It was remodel to modern look. It should a new face resolution for this store\n\nThey take my order but have to wait for 3.5 minutes. The cooking process also need to speed up. I hope they can improve since they have new look.",
    "date": "2016-03-24 02:47:37"
  },
  {
    "review_id": "p8INDAscwGl7AAcqb5ztbg",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "p2j5sADK9ucYX5eRmfZw1w",
    "stars": 3.0,
    "useful": 21,
    "funny": 9,
    "cool": 15,
    "text": "Sarge is very close the University of Tampa. They are in the food court sharing with three other restaurants. With their location close to the university, they got a lot of college student visits. \n\nWe got the smokehouse club. The meat do pile up like mountain. This sandwich has the pork, chicken and brisket. It top with bacon strips and the claw slaw. The bacon is not quite crispy. Meat is a bit dry. The sandwich can better if they improve on it. Price is matching the amount of food was given.",
    "date": "2021-02-11 20:38:12"
  },
  {
    "review_id": "arTYRNpNxzoai3uHEWDe5w",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "tUhPxpzjApBrr51K0QYbfg",
    "stars": 3.0,
    "useful": 15,
    "funny": 1,
    "cool": 7,
    "text": "This restaurant is like Philippino cuisine with upscale dining. This restaurant located at clubhouse of the tennis club. It is surrounded by 17 tennis court. Mainly serving the people who play tennis here. It is kind of tuck away from main street. \n\nThe restaurant is well set up. Restaurant name is Match Point Grilled. It also call Karma coffee. I was confused at first when I walk into the restaurant. We ordered Kare Kare. This dish serve with traditional oxtail. It come with rice. The quantity of oxtail is less and not matching the price listed. The other dish we have is the Beef Afritada. It is tomato base stew. This dish give a little more beef. It is come with rice. \n\nWe feel the price list are not measure up the food that serve. Food is a bit less of the taste. Service is good. Atmosphere is great. It is kind been there done that restaurant.",
    "date": "2021-09-07 09:08:44"
  },
  {
    "review_id": "uEmZIrGxBVRSIgXRfxDVWQ",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "F-ruW27CJT-s5WBOLKhVjQ",
    "stars": 3.0,
    "useful": 9,
    "funny": 2,
    "cool": 6,
    "text": "May be the dish I have order didn't impress me. I have book mark this place for some time. I was having a high hope for it. Tuk Tuk is rickshaw in Thailand. So this is mobile food.  \n\nThe menu show interesting selection. One thing catch my eyes is their crab fried rice. I got one of that. I also got their Thai ice tea. The Thai ice tea has strong enough tea in it. I like it the milk and tea mixed. \n\nI have the crab fried in Thai hot. It does bring on the heat. But the dish did not impress me for several reasons. The rice is too watery. The tomato put in there actually damp the wetness of the dish. It is not a good combo. The crab meat it spread in thin pieces. It can be chunky. It has crab taste but not really crab meat taste. May be they use the blue crab instead of dungeons. \n\nServices is average. The initial contact is a bit slow but the close up and paid is quick.",
    "date": "2018-10-19 04:15:14"
  },
  {
    "review_id": "JqWBMTlUYjF0I8OK8kfycg",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "UwI-vRH7Mu6PmsPR67MXyw",
    "stars": 3.0,
    "useful": 13,
    "funny": 5,
    "cool": 10,
    "text": "This is for the review strictly about the Poke. Obviously this market located 1 mile away from St Petersburg downtown. This restaurant is located at the neighborhood of Old Southeast, as a result, they call themselves the same name. \n\nThe grocery store's alcohol wine collection has a lot of choices. They do have a wall of soft drink and special drinks in the refrigerator. In the grocery store it has a few seat for anyone who wants to eat there.  \n\nFor the poke, since they are situated on the non compete area, it becomes the local favorite. In compare to Tampa Bay Area, they are in the middle of the pack. This is due to competition store has unlimited choices in compare to three choices on the added on. The other place can mixed and match on the sauce. This place has pre set sauce with your choice to add into poke. I have to give them credit some of the sauce are home mixed that other place do not has it. Overall the quantity is just at average in compare other. Add on is so so not quit interesting.",
    "date": "2018-12-09 23:27:01"
  },
  {
    "review_id": "LRDxt0cDF5Zb_4sYu39vmQ",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "QzwtJd7pF9fBY8WHVQfKfw",
    "stars": 3.0,
    "useful": 14,
    "funny": 1,
    "cool": 5,
    "text": "Very new restaurant. I decided to try them on. The restaurant seating is about a little challenge. Inside the restaurant mostly high top except a few is normal level table. If you want to sit at normal level, you may want to choose the outside patio seating. Obviously they try to imitate the beer hall type atmosphere with high top seats but it will be challenging for lady with dress. \n\nThis restaurant is open about a month. They still did not get the kink out. The food wait is about 35 minutes. Waiting staff afraid to approach you since you are waiting for the food. We got the habanero wings and the short rib. The wing is actually Buffalo wing with honey ranch type dipping sauce. I am not impressed due to 8 wings for $11 and is just regular buffalo wing. I expect more for the price paid $1.5 a wing with tax. The name not measure up. \n\nThe short rib is a fan. I like it when they braised it or slow temperature long hour grilled. The out side was crispy and nice. This short rib top with sweet mushrooms sauce with cabbage and place over pancakes. This is a great dish. \n\nOverall the service need to improve, the food waiting time need to cut down, may be grilled the wing with honey after the buffalo sauce was applied will make this wing worth $1.5 a piece. Happy hour half price weekday 2-7 is a plus.",
    "date": "2018-02-24 15:50:56"
  },
  {
    "review_id": "R_GMmO-g_xKSzf2KW8U_yQ",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "tOBpyk5SKKgU4MAgX2xaEQ",
    "stars": 3.0,
    "useful": 1,
    "funny": 0,
    "cool": 1,
    "text": "This restaurant is a Thai restaurant that serve sushi. This restaurant locate near my office. This is a place if I have run for the next meeting after the lunch hour. At night time, live jazz music is performed here. \n\nToday I have the garlic pepper squid and a cup if the tom yum soup. I always order Thai hot. It is really spicy - sweaty hot spicy. You have to be able to tolerance for hot food is you order Thai hot. I am use to it. To most American, the Thai restaurant medium hot mean very hot, mild mean ok hot. The tom yum soup have ingredient of scallop, shrimp, and squid. The tom yum style soup have the tamarind spice with sour and salty taste. It is perfect, for most people just order the regular so you can enjoy and taste the soup. If not it will be too hot. \n\nThe garlic pepper squid is a stir fry dish. The chef need to prepare the garlic sauce with high wok heat to create the burn of oil and the garlic to create the burn taste. This restaurant is ok on this skill. However, overburn create charcoal taste which you don't want. It is a battle of the risk of the chef not to under cook it or burn it. \n\nI have sushi here before, I can said that I am not a fan of it.",
    "date": "2014-12-20 03:48:22"
  },
  {
    "review_id": "PFo8xEoWU3XV_Kae9zK0Xw",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "hpfYTWeTkoX6dQEEfWowKQ",
    "stars": 3.0,
    "useful": 20,
    "funny": 2,
    "cool": 16,
    "text": "It is about 3.5 stars. A few things can be improved. Overall is a good restaurant. It is food truck standard in a building with control temperature. Chef has good skill. \n\nI got the two meat large bowl with steak and chicken combo. The steak is the New York Strip meat. But it is thin slice meat. The bowl is bed with rice. The meat is cook over grilled with Korean BBQ sauce. I have added sunny side up egg. I also got spicy pork to go. I eat half over the restaurant and bring home other half. The food do not sit in my stomach well. I have to go to bathroom. I believe is the egg because I finished the egg in the restaurant. When I eat the remaining, it was good. \n\nIf I am there, I will go for the Bibimbap. Cafeteria style. Not much of service. I would prefer the steak to be dice than thin slice.",
    "date": "2019-05-20 22:20:39"
  },
  {
    "review_id": "o35cdDthG8odFRp3XOzPlQ",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "0ZsqqzHu1HHkDdIKoivi5g",
    "stars": 3.0,
    "useful": 18,
    "funny": 9,
    "cool": 12,
    "text": "The nowait online is good to put your wait list before arrive to the restaurant. It definitely a good help to know when your table is ready. Even with nowait check in. They also loss our reservation. Fortunately they back check it when we were there and give us next available. \n\nThe restaurant is busy because they are the most affordable in Hyde Park. Many teenagers who live nearby are hang out at this place. This restaurant look like old dinner. It has the sixty look. You almost can feel the swing dance party is happen any time. \n\nThe food is average compare to many dinner. I guess that have so many customer due to their affordability. We have order the grilled grouper and Goody goody cheese burger pox. The burger is just average. The grouper is good size but they are pan grilled not flame grilled. The fry come with is soggy. This is not a good fry. I believe the fired oil was not change over time and make the French fry soggy. \n\nService is not there. Our waiter was missing for good period of time for our close up. Not sure is worth for the visit. However, been there done there.",
    "date": "2017-01-07 04:02:02"
  },
  {
    "review_id": "k2cV3KslF1Vitl6ERt_AbA",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "NIScXMQfXt-l0mRfsa1VRA",
    "stars": 3.0,
    "useful": 11,
    "funny": 3,
    "cool": 6,
    "text": "It is vey small farmer market. It has some art and craft, food, service, clothing and specialty. It located at Centennial Park of Ybor City. It is at the corner of 9th Avenue and 19th St. Parking is easy along the street side. They have parking lot with the fees apply. \n\nIn the park they are some shaded area with roof cover. This area have a lot vendors and pleasant to walk. Across the street is Ybor City Museum State Park which make this Saturday Market a one stop visit. Among the vendors I like the vendor who sell the indoor plants. This indoor plant has multi color and easy to take care. Just a few spray and close the glass enclosure, the steam form on the glass and create natural indoor steam room. \n\nThere are some clothing, buttons vendors. It was very interesting. Some vendor sell gluten free cake. Not many vendor but have something to offer for everyone.",
    "date": "2018-04-26 04:02:48"
  },
  {
    "review_id": "AqFPK3CQZaoL72zNclJ8yA",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "W4GZejrhakYdJC20m657mQ",
    "stars": 3.0,
    "useful": 14,
    "funny": 6,
    "cool": 8,
    "text": "This restaurant use to be a different Vietnamese restaurant. The interior did not change. The traffic for the patron is good here at 5 pm. At least I see 5 table occupied. \n\nI got the Hu Tieu. It is a seafood Hu Tieu. It has the squid, shrimp, fish ball, shrimp ball. This dish cost $7.50 for small. I have ask them to add the fish cake also. They have charge me extras $2. It is a 25 % mark up. It is a bit steep. The noodle is good and the seafood is fresh. I think the soup is a bit let down due to lack of flavor and the enhanced of fried onions and fried pork fat.  If they can stir fried the pork fat ant onion before adding the soup, it will enhance the taste. \n\nOverall is good. Services is average. Nothing to boast about. It is been there done that deal. Pinellas Park has too many good Vietnamese food. It will be a good competition.",
    "date": "2018-08-11 21:44:42"
  },
  {
    "review_id": "IH7lOLUiygopB7trUSlFSw",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "q2iS794-52tFAC2ScQFTug",
    "stars": 3.0,
    "useful": 1,
    "funny": 1,
    "cool": 1,
    "text": "Interesting decorations and furniture for interior set up. I would said this is a people hang out place. I saw people play with their iPad or smart phone there. However, it did not give me a feeling of great atmosphere. \n\nThey do have two choices of adult only ice cream. I mean not in the film X rated movie. If you think about that is all you...haha. The adult only is alcohol content ice cream. You need to show the ID before you order. My ID is the grey hair :). I have ordered the pumpkin spice rumchata. The alcohol is actually from the rum.  I would said it is tasty. \n\nThe price is a bit in the high side. If I come back, I would try the porky delight and some of the menu items. They located approximately 2.7 miles from the exit of the I-75 and SR 60. Easy to find.",
    "date": "2015-11-26 12:04:29"
  },
  {
    "review_id": "CB3tNvdo4YL7m8_RbZlM5g",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "or4XkblYRyXHxKJuKbhx_Q",
    "stars": 3.0,
    "useful": 15,
    "funny": 4,
    "cool": 10,
    "text": "I was eyes on this restaurant for long time. Every time I pass by there is a long line. Finally a weekday that has no much customers. I was able to walk in and order without waiting. I have it to go. \n\nI order a palabok fiesta with one non spicy chicken joy. The palabok is rice clear noodle with shrimp, ground pork and egg. It is just an ok dish. The fried chicken joy is better. I also has the spaghetti with two spicy chicken joy. The spicy of the seasoning is actually skin deep. Spaghetti is average. The best among all is peach mango pie. This is their best dish. I would recommend this. \n\nThe order was prepared fast. I really don't like the packaging. It is paper box that is not secure. Especially the food is more heavy than the box can bear. This will be their set back and easy to spill when they not secure properly in the plastic bag with two three order.",
    "date": "2020-09-30 00:37:32"
  },
  {
    "review_id": "Z2QEZDecZ66U6DJZCQi7mQ",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "7whDgmvqQYFUidvzd9t9UQ",
    "stars": 3.0,
    "useful": 13,
    "funny": 1,
    "cool": 6,
    "text": "My experience is base on the price they charge and the pasta available that day. That day they run out of many things, only two type of pasta available. We got pasta with meat sauce. The process is simple. The only advantage of this restaurant is make the fresh pasta. \n\nThe food is come with paper containers with pasta. Sometime can be messy to reach the last pasta at the bottom. Overall the taste is jus average. I don't see much advantages other than convenience. Price is high for the dish.",
    "date": "2021-09-08 18:04:42"
  },
  {
    "review_id": "AXFQo0DWhBdjJtYf_BXlEA",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "5h4M4YhF9H3-6kfXv4eLew",
    "stars": 3.0,
    "useful": 12,
    "funny": 4,
    "cool": 9,
    "text": "This is a 3.5 stars restaurant. It is not yet 4 stars. In compare to many Korean restaurants in Bay Area, I would said they have the most competitive price for their food. Although they are not cheap but is about a dollar to 2 dollars lower different in the Bay Area. \n\nWe have three dishes tonight. We start with Galbi the Korean grilled short rib. The dish is $23 with about 11 pieces of short rib. It was great marinated sauce to the bone. The second dish is the Eemyoonsoo the fried Atlanta Mackerel with lightly salted. This is a whole fish. The size is medium for $17. The edge and top was fried to crispy and crunch. A very good dish to go with beer or rice wine. The last dish is Dolsot Bibimbob. The rice serve in stone bowl. That make the rice burn to crispy at the stone touch edge. This dis has egg, veggies, beef. But I think it is less flavor. They need to work on this dish. \n\nThey are better than most Korean restaurants in Tampa. You still need to wait for the food for a while but the wait time is shorter than the Korean restaurants in Tampa. I still say they need to work on the speed to deliver the food to table. Don't let the customers wait too long. Service is typically as bad as most Korean restaurants.",
    "date": "2018-03-24 05:32:31"
  },
  {
    "review_id": "iATJBPUmfPBKD8BSzTRKnA",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "8ryZMrjvJ02hPgweQ53-3w",
    "stars": 3.0,
    "useful": 2,
    "funny": 1,
    "cool": 4,
    "text": "New Culver with new building, new location, and new market. This will be a challenge to many culver store. It does bring easy comfort food to the area and next to the mall. I have been to 4 culver, it will be comparison among them. \n\nWe are here for buy one get one free ice cream. The coupon is sweet. I have the flavor of the day. It keeps changing every time we're here. The only comment I have is the ice cream melt very fast compared to other location of culver.",
    "date": "2017-04-20 01:31:16"
  },
  {
    "review_id": "YTVwWG_nhD9C3Hvzdup1lw",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "n87Tmmxh65yv1EN6az6bkA",
    "stars": 3.0,
    "useful": 10,
    "funny": 4,
    "cool": 8,
    "text": "Cool name to start the sandwich store. Very systematic to select the sandwich that you want. First identified the name. Then the sandwich of your choice, next type bread, then sauce, last is ingredients include veggies. \n\nI would said this sandwich store is in the middle of the pack. Because they are systematically layout, they are not flexible to change for their meat selection. For instance if I want just capicola ham only, I will not be able to buy that. I have to select the entire Italian cut including pepperoni, salami. The reason they give is each portion is precut and assembled. You will not be able to twist and change. If I want extra meat, you have to paid entire assembly. \n\nThe sandwich is good taste for Italian, the balsamic sauce is great. But I feel sandwich assembly is thin not wide enough. A meal combo is above $10. It is above medium price range.",
    "date": "2016-12-10 12:47:33"
  },
  {
    "review_id": "nuv8G74VMm7lyEC_WVLuRw",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "SZNnDfhSryMHfZCfifHl7w",
    "stars": 3.0,
    "useful": 3,
    "funny": 3,
    "cool": 2,
    "text": "Happy hour time with friends in this location. We meet up after work to celebrate. Certainly this Winghouse is the hottest location in Bay Area. \n\nTonight is a special night gathering. While we wait for all the friends, I have order a bluemoon. They do not carry Coppertail. Bluemoon is good and cold. We brought a cake to celebrate and the waitress is nice to but it out for us. I have order a smoke BBQ grill wing and two pork chop. The chop is a bit over cook and dry. The chef do not have skill to seal the juice. It accompanied with broccoli and mushrooms gravy with mash potatoes. Food did not impress me. \n\nThe more need to be improved in this winghouse. Table need to be clean, food need to improve and the parking need to be available.",
    "date": "2016-03-12 06:08:35"
  },
  {
    "review_id": "msorhotYooF0_O2r40wxwA",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "GVWcwqUD-ekCMQ0x2Ke6Ww",
    "stars": 3.0,
    "useful": 7,
    "funny": 3,
    "cool": 4,
    "text": "I am excited to try this restaurant. I like to try this hype restaurant with $$$$ for sometime. I hope for top dollar with very good experience. You have a choice to valet for $5 when you are arriving or looking for empty parking in the lot. \n\nWe were planning to try the happy hour before our show in the performance art center. After we have sit down, the hostess tell us the happy hour item is at the bar area or lounge. But they let us sit at the dinning room for happy happy hour item. We have waited them to bring the menu. Later the waiter has come to ask us again then we wait again. We could have gone to lunge area and be done with it. \n\nWe have ordered the lamb lollipop, lobster roll, and the charbroiled oyster. The lamb come in three big pieces with good quantity. The oyster is only three pieces a bit less. The lobster roll I have better elsewhere. The taste did not wow me. \n\nThe ending to pay the bill is quick no wait. I was expecting a lot from this restaurant but did not get the value we paid. Good restaurant but they can be great.",
    "date": "2016-05-14 23:14:13"
  },
  {
    "review_id": "F-w5fuHKI5hFABHg52Fw7Q",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "OnlFBPc0aCmzXjbYXKfnTA",
    "stars": 3.0,
    "useful": 8,
    "funny": 3,
    "cool": 5,
    "text": "The BBQ place located in a rough neighborhood. If you want find a good food and don't mind the place, this can be your adventure. King BBQ just off Armenia and I-275. There no place to sit. It is a to go place. \n\nYou may not experience the full menu. It is what they are cooking at that day. Today they just have the regular rib and the chicken. The price is good for the meat you get. I got half slab regular ribs for $13. It fill the entire box. The middle low part of the rib was grilled to crispy and not burn. It is very tasty. They do have the BBQ sauce selection with mild, mixed or hot. I have them put the sauce on the side. Since this is full size rib not baby back, the half slab look big.  \n\nThe BBQ store is walk in and the grille just in front of you. You can see what you order. They will chop it for you for easy bite.",
    "date": "2016-08-20 03:14:01"
  },
  {
    "review_id": "9ti47D21IMsCzIxY3-5wRA",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "O00tp5KyzMPqnvjRLhGSKA",
    "stars": 3.0,
    "useful": 5,
    "funny": 2,
    "cool": 4,
    "text": "I want some snack after the exercise. It is also the football Monday night. So I decided something quick with wings. I think Kentucky fried chicken may be a good choice. \n\nRecently they have the $10 bucket with a choice of fried chicken, popcorn chicken or wings. I have selected the wings. The drive through is easy since there was no one in front of me. I got my order in two minutes. Nothing better than that. \n\nThe wings are fried correctly. Occasionally the have thick crust. The wings is a bit small compared to many wing place. I have 12 wings for $10 and with tax is about $0.90 per wing. It is average cost. In compared to I have Dry Rub wing for $0.80. I would said this is a three stars.",
    "date": "2016-12-15 02:43:42"
  },
  {
    "review_id": "Y1m0OMpdgD8TLRV6q1otuA",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "-5psHqEISccHDdHaWF2-6Q",
    "stars": 3.0,
    "useful": 5,
    "funny": 3,
    "cool": 4,
    "text": "This is Vietnamese fast food in the mall. This is first of it kind. It you have to choose a mall fast food, I would go for the pho which is more healthy and easy. They are located next to the carousel in the mall. \n\nThey have quite a selection for the type of pho you like. It include the seafood or fish ball noodle soup. I have the meat ball and slice rare beef noodle soup. Soup is good. They may not be the best in the Bay Area but it is good enough for the mall.\n\nThey also carry different type of boba smoothie. I did not try their boba but my neighbor boba look very good. \n\nThe service is good. The sale person very patient explained to me each item. The only down side is each item is prepared in package. I like to mix and match which will make thing more interesting.",
    "date": "2016-05-20 02:43:57"
  },
  {
    "review_id": "OHrWXL1PUAs16-W4-zvmYw",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "YWHjn0eLLtdj-w0v4XoNkQ",
    "stars": 3.0,
    "useful": 7,
    "funny": 3,
    "cool": 5,
    "text": "I would said this is the best Philippino restaurant in the Bay Area. It is a mix with grocery store and the restaurant. I can see the problem of this restaurant is the response time to the customer. We sit down for 10 minutes before anyone come to ask what I need. In fact, there was no one out at the front for good 10 minutes. We help ourself for the menu. \n\nWe got our orders immediately once we have someone come to our table. The food came out very quick. We order the Binagoongang Baboy - pork with shrimp paste. It you are not use to shrimp paste do not try this dish. I like this dish since the pork are well braise and soft. If they cook this dish with hot chili, it will be much better. \n\nOur second dish is the most popular dish of the restaurant. It is Da-Long-Tocilog combo. It is a breakfast dish that serve all day. It has fried pickle fish, cure pork meat, pork sausage serve with garlic fried rice and fried egg. This is a very good dish. \n\nThe food is 4 stars, but the service and attentive of the store front is 2.5 stars. So 3 stars for the restaurant. Do I come back. Yes, for the combo breakfast dish that was not serve else where. It has better menu compare to the Bay Area Philippino food restaurants.",
    "date": "2016-05-03 04:29:35"
  },
  {
    "review_id": "nfFEqXKI_U5Rj8FvMRAZdA",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "B2Rk_FNhgFF-XOwesQw7FA",
    "stars": 3.0,
    "useful": 21,
    "funny": 5,
    "cool": 16,
    "text": "The restaurant service is good. The server paid good attention to our table. She also have knowledge of the menu and daily special. The restaurant is at prime location at the mall entrance. They got very good customer base. The restaurant is 80% pack in the early dinner hour. \n\nWe got two items from happy hour, we have the oysters and the medium neck clam. Both dishes was fresh and delicious. My wife have fish and chips. The fish is in good large piece. It also has crispy coating. It is good dish with the fries. I have the crab cake. I think the crab cake is below average. I think it has too much dough than crab meat. It do come with string beans and rice. The side dish is a choice from menu. \n\nOverall experience is good. It is about 3.5 stars. I still think if their menu can be re-engineering with attractive dish in use seasoning, cook method, or flavor, they will do very well.",
    "date": "2021-01-13 13:39:26"
  },
  {
    "review_id": "EnTR69F3-NdJihAqMXggwQ",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "eSHOzoSapng1c7BN3CBn9A",
    "stars": 3.0,
    "useful": 13,
    "funny": 4,
    "cool": 7,
    "text": "My first take of the pub is great gathering place in Tampa Palm area. Generally it has good seating area. Most chair is high top. May be a bit difficult for the ladies with dress. This pub not populated with TV. It can be more but enough for each corner. \n\nThis pub food and drink price a generally a dollar more than the other pub. The wings after tax is about $1.3x per wing. Average wing price at USF and New tampa is about $1.00. As a result, we expect to be spectacular. I have blacken wing. The wing is fried correctly. The blackened spice is not so. I think can be improved. I wonder if they have grilled stove. If they do the grilled will add flavor into it. That can be improved easily. \n\nI like new business because they really bring value to the community. In the same time, they need to be reasonable. I know they invest a lot in a business. So far they have the customers and it is time to correct.",
    "date": "2017-07-23 12:05:13"
  },
  {
    "review_id": "fdt5N0pa-NgKcAyLJMaJjw",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "1IuLzYvrAleNSIc-FVgIYw",
    "stars": 3.0,
    "useful": 16,
    "funny": 4,
    "cool": 10,
    "text": "I would give them a fair average restaurant. With that said, they did a good job during pandemic period. They put napkin dispenser for you get a piece napkin to open the door without contact. The food are paid online and no touching in the store to exchange payment. Food is put on the table as barrier from kitchen. Base on your order and name you can pickup your order. \n\nI order the broccoli beef, Kung Pao chicken, mushroom chicken, fried rice, noodle. The broccoli beef I barely see the beef. I do got a lot of the broccoli. The Kung Pao chicken is better. At least 50 to 50 meat and veggies. The mushroom chicken meat is less veggies is more. All dish has a lot of sauce. Which mean the chef wok a little less and has a lot of water sauce. \n\nOverall experience is good. The online order need to be pick up in the store instead of drive throu",
    "date": "2020-04-22 20:04:50"
  },
  {
    "review_id": "2zWQrBIYXBd0hoSSHoszRg",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "Sa09GY2yv5gn15qfZ5JKsA",
    "stars": 3.0,
    "useful": 17,
    "funny": 5,
    "cool": 13,
    "text": "His bakery cafe and sandwich store is local favorite. We were in the area and try something for my book mark. The interesting item will be the the Tomato pie. But we did not go for it. \n\nWe have the carrot cake. The cake is moist and good. I would said they have good dessert. It includes the banana cream pie, red velvet cake and more. There are some good sandwiches post by other including the Cuban sandwich. May be you want to try it. \n\nOverall is I good. I would call it average.",
    "date": "2020-11-26 23:04:20"
  },
  {
    "review_id": "M0ikdsb_VTT5_T8At9KGfQ",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "J7VK_TE42OAcV6VVWj1tJw",
    "stars": 3.0,
    "useful": 17,
    "funny": 4,
    "cool": 13,
    "text": "Basically is a take out restaurant with computer order. There were a few tables to sit. No restroom facilities, only bottles water. It is designed for take out. Menu easy to read. Very simple. \n\nWe got the beef kimbap. This is like sushi roll with bulgogi beef. It has, egg, pickle veggies. Consider this is a large roll. We also got the spicy pork lunch box. It has fried pork dumplings, kimchi, rice and spicy pork. Food is good to have. For take out, they are good. For dine in probably need to consider the situation.",
    "date": "2021-08-02 19:34:17"
  },
  {
    "review_id": "7SRWhmMQ0vTiX54iAcj2nQ",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "Awkrb1wzFxz5w1Ixc9W3FA",
    "stars": 3.0,
    "useful": 6,
    "funny": 4,
    "cool": 5,
    "text": "It is about 3.5 stars restaurant. Being at downtown Tampa, it should be busy.  We were there at Friday around 11:30, this place only 35% fill. These should be easy for them to serve us. By the time we walk out at 12:15 pm. The place is full. \n\nThe lunch special is attractive. I saw the chicken chimichurri hash at lunch special menu is attractive. The dish serve in skillet with potatoes hash, grilled chicken, grilled onion and top with two egg of your choice. Sunny side up is definitely the best to break the egg yolk for the mixed of the hash. This dish also has the chimichurri sauce make this dish decorative. \n\nFor the energy, I have morning meditation drink. It is orange, lemon, turmeric, ginger, agave nectar, and beet. What a drink and nice presentation. \n\nService is a little let down at the end.  Food is good.",
    "date": "2017-05-13 18:35:53"
  },
  {
    "review_id": "1XNwFckxlDGlOJKN_Ius7g",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "3dQaEBDWOyqDYhP3-ac7NQ",
    "stars": 3.0,
    "useful": 18,
    "funny": 5,
    "cool": 11,
    "text": "It was great that I revisit the restaurant since we have a bad experience in the first time. A lot of things have been changed. We were here after late night movie. \n\nA lot of improvement has been made. Food come out a lot faster. The noodle was prepared correctly not glue together. I have order the devil spicy ramen. It is spicy not super spicy. The soup is still salty. The egg need a bit work - over cook. The noodle need some sesame oil to make flavor better. \n\nOverall is good. It is big improvement.",
    "date": "2018-08-09 03:15:23"
  },
  {
    "review_id": "DNEfekbW4TRGEXuyA8bY8A",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "gw68ejeDgZZ2kCAHvFroNQ",
    "stars": 3.0,
    "useful": 10,
    "funny": 0,
    "cool": 5,
    "text": "It is a fast food joint. Order and paid at counter. Nothing fancy. Just like mall food. Except more personal touch with cooking after order. Seem like fried rice and noodle being pre-cook for assembly. \n\nI hope for Bento to be here at Bay Area and now they are here which has not impress me. The best thing about this place is their bento box with many items and reasonable price. I would come back lack of time to eat but not for date night. \n\nWe got the Korean beef and the Katsu bento box. The Korean beef did not fare well. But the katsu is good. The string beans has no salt in the bento box. We also got the spicy tuna small with 4 pieces. This item is a bit expensive. However, it has good flavor. \n\nWe got the boba tea which is fun to have. Something I don't understand is when you paid and order at counter, the alway have a tip box to check for 18% to 20%. The only service is bring the food on table. That always doesn't make sense for cafeteria type food service industry.",
    "date": "2018-11-01 18:33:02"
  },
  {
    "review_id": "6kaXKqx39gtnUtEAVxYjkw",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "aiD1s5zPzi4nPZXaEa2mTw",
    "stars": 3.0,
    "useful": 6,
    "funny": 1,
    "cool": 3,
    "text": "Mi Bandera has been in my bookmark for sometime been want to try it. This was the second Columbian restaurant of the week. They definitely a solid 3 stars and above average. \n\nTypical Columbian restaurant. I always like Columbian candy they give at the bill. Each restaurant has different candy so do this restaurant. We have the tripe soup, black sausage, churrasco Bandeja paisa. The tripe soup is ok. The churrasco is good flavor, the pork belly do not has salt, the sausage is average, it does give a good portion of food for good price. My wife want to try the black sausage which is blood sausage. It can be better with correct seasoning. \n\nOur experience here is good. Nothing stand out but solid. The server know a bit English and enough to take your order. Even change the TV channel for you. Overall many Latin people eat there. Many have look at us and curious what we have order. They were surprised we know our order :)",
    "date": "2016-09-19 12:36:15"
  },
  {
    "review_id": "WmaIY6qrIhY4KW6wF20gNA",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "F__yT5i7C2t-IfzyXYscKw",
    "stars": 3.0,
    "useful": 5,
    "funny": 2,
    "cool": 3,
    "text": "Ha ya- karate chop. No it just the tea. It has some kick in it. No hand chop:) \n\nKung fu mean martial art in Chinese. When they use together with food mean their specialty food. I have been to this place 4 times and gather my conclusion of this place. The tea place is upscale. Nice sofa and seat. They have the regular tea mix. You can add toppings of your choice that is when they get you with up charge. The have good enough tea taste. Other than that. They have a lot of toppings or inclusion selection. \n\nI have the pina colada with mango jelly. Not bad at all. We were here 35 minutes before it closed and we drink to the last minute. This will be the eat around 4th stops. We enjoy our moment with friend here.",
    "date": "2016-07-17 04:24:56"
  },
  {
    "review_id": "z0fGW71pMa9As9V1sTZ_tA",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "un1uBFgmY42fP8vmGo8zMw",
    "stars": 3.0,
    "useful": 2,
    "funny": 3,
    "cool": 2,
    "text": "Neighborhood Taco Bell for drink and snack. I have never use their food for meal. But I do like their select item over Mc Donald for snack. \n\nI here mainly for the happiest hour soft drink. During 2pm to 5pm each day, the drink is a dollar. I usually get the Baja blast freeze. They do have other choice like the pomegranate water, other flavor of freeze. Taco Bell generally is healthy choice than Mc Donald in the fast food chain. I remember an old futuristic movie \"Demolition Man\" shows the only surviving franchise in the future is Taco Bell. The movie shows the people with healthy living and change society and the Taco Bell is the high class restaurant. Imagine that is all we eat in the future???\n\nI also like their snack for the crunchy taco or the steak quesadilla. Love the steak quesadilla here. If they can only using just the Swiss cheese, I will know at their door often.",
    "date": "2015-07-11 13:42:25"
  },
  {
    "review_id": "40AKYVU9rCmd4p0JZCfg4A",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "oMi9d1wPQpLj_3n8ZzfCRQ",
    "stars": 3.0,
    "useful": 0,
    "funny": 0,
    "cool": 1,
    "text": "The Domina's pizza is actually located inside the gas station. I am not much a pizza lover, but if I have to chose the pizza chain domina is my choice. I like old thick crust pizza, I am not a fan of tin crust. If you have to pig out, please go all out with no reservation. At that point you have blown the calories count any how. \n\nTonight they have the $5 two topping deal large pizza. It is enough for me and my wife. We have order the pepperoni and bacon. I call in 10 minutes before my pickup and they are ready on time. The two topping deal only on the carry out. Please make a trip to nearby pizza place. The total come to $6. Great value. \n\nThey lay the pepperoni then the bacon on top. The pepperoni is great and crispy. With bacon on top the juice of bacon further cook the pepperoni to give extra crispy. The bacon is great in this sense. Everything go well with bacon. \n\nPlease catch the deal while they last.",
    "date": "2015-02-28 16:14:33"
  },
  {
    "review_id": "BEqcQsBKF2d2YZv4_bPwkQ",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "pRF-yUpOG2YbzA767CLqQQ",
    "stars": 3.0,
    "useful": 17,
    "funny": 6,
    "cool": 13,
    "text": "3.5 stars restaurant to my book. This new Rice Bean has been building their new hop for long time. Finally it opened for business. It does bring crowd in from the area. There are not much good mom and pop restaurant in the area to compete. They are really located at good spot for business. \n\nWe got the Churrasco and Bistec Empanado. The churrasco is the skirt steak. Their skirt steak cut like a strip with about 1\" diameter and 7\" long. I prefer to thin and at Falda cut which they don't carry. The marinated sauce is good. The steak is cook to medium not like my order medium rare. Overall is a good dish. The Bistec Empanado is breaded thin steak. The breaded coating has no taste. I have been many Latin restaurant have better coating than them. \n\nOne other thing. We walk into the restaurant and there was no line on Tuesday night. The hostess still saying we have to wait for ten minutes for table. I see there is open table. At the end we choose the bar instead of waiting. Service is not attentive. Many area of the restaurant need to improve. Service, hostess, food.",
    "date": "2019-09-11 09:54:16"
  },
  {
    "review_id": "RmJ7J8PUx6X7fFNP6t-R5Q",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "_QkJXxFedFQSp8U6rDICtA",
    "stars": 3.0,
    "useful": 7,
    "funny": 6,
    "cool": 9,
    "text": "I like our food here but not necessary we have best time. First the wait, the hostess tell us 10-15 minutes. It turn up another ten minutes. I walk around and found empty tables but they are not occupied by anyone. I went to check when is our turn, they lead me to the same empty table that I found 5 minutes ago. The seat is just below the AC vent. I can feel the drip of the water. They definitely need to check this vent on their off hour. Make sure water molecules is contained. \n\nThe only thing I like about this place is the service on the table and the food. Which is the most important. My wife has the Thai Coconut-Lime Chicken. It a bit lime heavy at the end. The best is the Hibachi Steak. It is the hunger steak with shiitake mushrooms in slice, caramel onion and sprout. It also included the wasabi mash potatoes and tempura asparagus. This steak is cook with the ginger sauce which is a good match. \n\nService is good over the dining time. Food come out the right time compare to my last visit. I would said the hostess need to paid attention to the empty table. Customers is less patient when exceed to the wait acknowledge time. The AC vent need to be clean and make not dripping water. Who know what dust has the water has collected.",
    "date": "2017-07-24 04:22:52"
  },
  {
    "review_id": "t-I1CNNzSE5-oRGfPmeuag",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "-oLUNNkVi0Wdikuc4LlQ_Q",
    "stars": 3.0,
    "useful": 18,
    "funny": 7,
    "cool": 12,
    "text": "Columbian restaurant that open not long ago. It was on the neighborhood paper. Decided to give them a try. At the front of the store, they display the Latin pastry and finger food and chicharon. It was beautifully displayed. We got some of their pastry. The pastry is definitely 5 stars item. I would love to buy their pastry again. Pastry are delicious. Love it. \n\nFor the entrees, we have the Carne A la Plancha. It single grilled steak. The other dish is the grilled skirt steak. I would said they are not the expert of the steak. The control of the steak temperature or marinated sauce is not there. The technique is average. \n\nService is good. Food come out quick. The table and seating is basic set in the restaurant. They have a few booth you can have more privacy.",
    "date": "2019-07-18 01:13:11"
  },
  {
    "review_id": "jOB2oNCmajoZ2VgmYLkr6w",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "1Tb7ION52mf2I7wXJY9HAw",
    "stars": 3.0,
    "useful": 10,
    "funny": 7,
    "cool": 8,
    "text": "Fast food in restaurant setting. \n\nThe restaurant is big with a lot of seating. When it was just open, it is almost like the attraction of the Brandon. It has nice deco in the interior. It still busy even now. Now is not like pack crazy. \n\nI am just wants to get the experience of it. We have the fried halibut, grilled tuna sandwich and chocolate cake. The halibut do not impress me. It is a small sandwich compare to Burger King or McDonald fish sandwich. The grilled tuna is excellent with taste. The chocolate cake that day is not moist but it has the softness and good mix of cake. \n\nOverall, they are average. They do have a lot help on kitchen. However, the food still take 10 minutes. Compare to many fast food, they are considered slow to deliver.",
    "date": "2016-06-23 11:58:48"
  },
  {
    "review_id": "KihAjkzqBVbovX5_HlCgIA",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "e8VlQHJYDyfMo5J--qyY9g",
    "stars": 3.0,
    "useful": 7,
    "funny": 4,
    "cool": 7,
    "text": "No many Krispy Kreme left in Tampa Bay Area. Definitely not many hot now doughnuts store. I love hot now sign because it is just make it. The doughnut is fresh out from kitchen. The Dough is still warm and the sugar glaze just harden. Krispy Kreme offer that in their doughnut store. \n\nI am here for their special coupon for a dozen glaze donuts for $5. Only the email sign up user have that coupon. It is good deal. I got the hot now freshly made donuts. It was so yummy and I have to open my box and eat them immediately. It definitely allows me to go for second donut after I have finished the first one. \n\nThis location is my first visit. I think the wait can be shortened since there is not many customers during 3 pm.",
    "date": "2018-05-12 04:50:01"
  },
  {
    "review_id": "mEHL0-QjHWgYVQn42W84Mw",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "FzZ2U0gLuhKVarDdXVWBQw",
    "stars": 3.0,
    "useful": 20,
    "funny": 4,
    "cool": 13,
    "text": "This sandwich is a historic sandwich store. Many my friends gave god review here. As a result, I have bookmarked this place 4 years ago. I am happy to be here. \n\nI have the Cuban sandwich. It was great the sandwich was prepared very fast. I do ask the sandwich to be toasted. After first bite, I think the whole sandwich is sour compared to most of the Cuban sandwich I have. I think the pickle was put there with the pickle sauce was dip into it. The sandwich did not has the mojo pork. Not sure which version of Cuban sandwich is this. I would is Americano sandwich not Cuban.",
    "date": "2019-09-02 01:16:53"
  },
  {
    "review_id": "s2b_3FMzdvyEvUlg4Dukpg",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "kjhNdkVVWqAURf_4UPpJzQ",
    "stars": 3.0,
    "useful": 8,
    "funny": 2,
    "cool": 12,
    "text": "I was here Thursday night. The place have good crowd considering it located in community plaza. The bar area is empty and since I am eating a lone, might as well have the bar and watch football game. \n\nThey have the free lime margarita with purchased a meal. So I go for the free margaritas. Unfortunately they don't have margaritas. Since when a Mexican restaurant doesn't serve margaritas. May be only the food truck. \n\nI got the seafood fajitas. Seem like the picture in yelp show this dish very intriguing. It has scallops, shrimp, mussels, crab meat and fish. This is the first time I have fajitas with crab meat. Very interesting. I actually like this dish. I like the seafood over caramelized onion. The taste is good. I like the fried bean and rice come with it. Except the salsa is too little. Food is 4 Stars. \n\nThe service is average. Waiters are arguing who to help. It will be ok for the common good. Food come out quick enough. The chip on the pre-meal smell like fried in the old oil pot.",
    "date": "2018-08-31 23:11:57"
  },
  {
    "review_id": "KWlrVjUSf90ebEbdDa1icw",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "Rf-p0k0HpqtD7L4YBfWjPQ",
    "stars": 3.0,
    "useful": 20,
    "funny": 6,
    "cool": 18,
    "text": "The Tampa Bay has an explosion on the poke restaurant. This poke is kind of close to town and country area. I like that most of the restaurant spread out the Tampa Bay Area. I like the building has high ceilings but. \n\nHere you can have their preset menu with ingredients and sauce arranged or build your own. I got my base as sushi rice. I also got all ingredients except onion and edamame. I also added an add on seaweed salad dressing addition scoop of protein. It turn the add on and tax is close $15. It is at high side for poke. A assembly food is a bit high. \n\nI would they are in the middle of the pack for poke. Reason below. Many place offer multi scoop proteins. Many of the added on is part of the deal with no additional cost. Some other place even mix the sauce, protein and ingredients before putting in the bowl. This extra step will help instead of putting the sauce drizzle on the top.",
    "date": "2019-04-25 17:33:26"
  },
  {
    "review_id": "xPSCElUql-vRPJKd03xLnA",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "6kGguKQkmMITO3n8H8EKOA",
    "stars": 3.0,
    "useful": 22,
    "funny": 0,
    "cool": 13,
    "text": "It is 3.5 stars restaurant. I am here to get the drink after exercise. I like boba so I check the are who has boba. This store is famous on poke. Not sure boba also good or not. I give them a try. I got the coffee slush. The slush is kind of watery. The boba is not the chewy type boba more like the jello. Also the boba has not flavor. One good thing is they have good coffee mixed in it. \n\nFor boba they are average. But I saw customers in front of me got the poke which has good mixed up. It look delicious. May be poke is the only thing to go here",
    "date": "2021-06-12 15:01:25"
  },
  {
    "review_id": "xrh5kJZPyl3RBPI4I1Wuyw",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "H26zRyQkXXYzUZUOtppFcA",
    "stars": 3.0,
    "useful": 19,
    "funny": 13,
    "cool": 21,
    "text": "My friend like Green Lemon for Tuesday Taco. I can see this is a hip place due to the atmosphere of the place. Many young people love this because affordable food with booze. \n\nThere are few things that the restaurant is just an average. Number one is wait for table. Number two is wait for the food. Number three is very tire server. Number four is in experience hostess. All this actually give them 2.5 stars. Wait for table is 45 minutes, wait for the food after order is 25 minutes, waitress is beat up and tired. Not sure how many table they have to take care. Hostess tell you 30 to 45 minutes wait is definitely 45 minutes. They need to clean up the table sooner and allow to clear the queue wait line. Since you have to wait for the food, it make wait line longer. \n\nOne thing they can improve dramatically is make sure each order come out quickly which will reduce the wait. It definitely effects the tip because of the wait and cause the waitress look tired and not happy. Kitchen crew definitely need to come out the food more efficient. Mexican food should be easy assembly and able to deliver quickly.",
    "date": "2019-01-10 02:28:12"
  },
  {
    "review_id": "QQPJyuEFHdmw3v6jdCYgpQ",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "x4CzqJ75DhtZf_RmZwyH_w",
    "stars": 3.0,
    "useful": 12,
    "funny": 2,
    "cool": 7,
    "text": "This an average Roll ice cream store. I have better on other places. With that said. I have to give them credit on the only one in New Tampa right now which we don't need to drive too far to have one. \n\nThis is only base in the roll ice cream. They have many item such crepe choco Coro new item and Acai. This items was not reviewed. Base on their roll ice cream, the selection is good. But the toppings is little. The charge is high. \n\nWe have the on snow in the assembly menu. The toppings are chocolate roll cookies and top with coconut flakes. The ice cream is creamy than other roll ice cream. Which is a good thing. I only don't like the pricing and so little toppings. Overall experience is good. I would give them at average among the same business. However, I do want to try their crepe. It look interesting.",
    "date": "2018-05-26 23:57:56"
  },
  {
    "review_id": "adGlB27effLbxnRYj-cF4g",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "otJAPyE7thHcLuFCM8Wtvw",
    "stars": 3.0,
    "useful": 10,
    "funny": 2,
    "cool": 7,
    "text": "I have been eating their food very often. However, I have never review them. Our company lunch meeting often order from this place. Some time is good and some time is off. This is about 3.5 star restaurant in my book. \n\nToday I have the calamari and Tazza Istanbul Shrimp. I have order the appetizer of the calamari is for me to chew while keep me awake during the lunch seminar. It is working. Although it is not the best fried calamari, but it didn't cost that much either. The Tazza Istanbul Shrimp have a good Turkish sauce to go with it. It accompanied well within the rice. The shrimp size is about 36 count per pound. It is not the big size. Food is ok. \n\nThey offer very complete menu and many choices. Start with appetizer, salad, soup, sandwich, wrap, seafood, platter, burger, and their specialty.",
    "date": "2016-10-22 03:50:40"
  },
  {
    "review_id": "cwELlAwi02zYh1TqA8_9dQ",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "HfJeU5-MzRGiO3nIJwnEqQ",
    "stars": 3.0,
    "useful": 15,
    "funny": 2,
    "cool": 7,
    "text": "This Thai place is local favorite. A lot of take out. Not many dine in customer. The wait for take out is 20 minutes. We also got the take out. This restaurant is located on last corner building plaza. \n\nWe got the Cashew Nut chicken. The sauce and ingredients is there. Good wok technique. We also got the Penang curry pork. Sauce is good. Ok curry. The only thing I would said is the quantity is small compared to many Thai restaurants. I would not suggest this restaurant if you really hungry.  \n\nOverall is the food is ok. Just average restaurant among the Thai restaurants I have visited.",
    "date": "2021-11-23 03:50:10"
  },
  {
    "review_id": "H06aGW9TDO_XLREI2EIdjA",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "nm--zdNL0zWvUNE2uMK5_Q",
    "stars": 3.0,
    "useful": 5,
    "funny": 2,
    "cool": 5,
    "text": "My Malaysian friend has told me about this restaurant about the Malaysian food is modify to American version. I have to confirm how close they are on their cuisine. It take me one year to reach this place since I have book mark it. \n\nI have opportunity to travel to this area for my vehicle maintenance and decided to try them out. We have the beef rendang, chicken stay, and fried Koay Teow. The rendang gulai need a bit sauce. It need to be a bit wet conditions sauce. The yellow ginger is good but need to be a bit heavy spice. The stay is not close. It not close the Malay satay or Penang satay. The satay need a bit sweet. \n\nThe Koay Teow is the best dish but compare to the street vendor in Malaysia, the is a lot room to improve. I agree with my friend their Malaysian food is American in style. It is made to the local favorite but not Malaysian liking. This is a been there done that deal for me.",
    "date": "2016-07-05 21:31:15"
  },
  {
    "review_id": "hAEqGCC7DybuKV3T_7Lw1g",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "5m6gQ3BwWi8QXcZmD4yulg",
    "stars": 3.0,
    "useful": 24,
    "funny": 10,
    "cool": 18,
    "text": "The dessert look Paris item but not for the Banh Mi. The restaurant look nice and bright lay out. Social distancing is observed. One thing I like most is their pate chaud. This item look like Cuban pastry but with oriental seasoning meat in fill. It is delicious. The pastry crust also very good. I recommend this dish. \n\nThe drink is good because they give close 20 drink. Price wise is about $.50 cheaper than most. I got the coconut slush with grass jelly. The grass jelly was did a good job. Soft and jelly. \n\nThe banh mi is below average. The bun was to tough to bite. I think it need to be toasted for easy bite. Seem like the bun was sit there some time. We got the special combination banh mi and grilled pork banh mi. One compliment can give is the grey paste did a good job. The meat for special and grilled pork are just average.",
    "date": "2021-01-20 19:44:32"
  },
  {
    "review_id": "MAOmoTXpb0A0CPR6-0w0cQ",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "CQD7-sfUiADa6KyTYJT2NQ",
    "stars": 3.0,
    "useful": 4,
    "funny": 3,
    "cool": 2,
    "text": "We were stop here before the the Yelp CMYE. Since the CYME will only have snack and we decided to eat here. There is a lot customer in and out here I hope it will be good. Unfortunately, there is no fireworks for this pho place. \n\nI order the Pho Viet Northern Combination. The server brought out the soup but he insists the soup is not our table while we should be the next group to get the noodle soup. He could not find the order is belong to us and he set our soup noodle in the empty table. The manager then verified and brought the soup at our table. Very confusing. By this time our rare beef in the soup is cook through. The soup is in the sweet side. The shrimp is fresh and bouncy. \n\nBecause they are not located in the pho hub, they have no competition. They can survive the business because far away from the hub. It would not be able to survive if it is located at the Dale Mabry or Pinellas Pho hub. The soup is average. Not the top notch. I could have given them two star because they mixed up the order.",
    "date": "2015-12-25 04:07:35"
  },
  {
    "review_id": "w0aF5Tl1AkBdKqcNbKjRaA",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "EVmCBFlY0Hy_62bDRizmGA",
    "stars": 3.0,
    "useful": 5,
    "funny": 1,
    "cool": 5,
    "text": "Friday night happy hour at 5:30 is good. Easy to get a sit without reservation. However, one thing you need to know Friday night happy hour has a lot of people visit this place. Even they have eight sushi chef, it will take 30 minutes to deliver the food from order. So if you are in hurry, Friday happy hour may not be a good ideal. \n\nThe restaurant certainly a big step out from the old location. The open space concept and decorations is definitely a 5 stars rating. Out seating has small waterfall and fire place create many good atmosphere. They also has a private room for 20 people that is well decorated. \n\nFood on happy hour may not speak the same language. Although they are good value but the taste is just not measured up. Only the gators roll and eel roll measure up. The rest of the roll taste the same. Good sushi grade fish. I would go for the nigiri or sashimi. I think they are still rushing on the roll preparation.",
    "date": "2016-10-23 12:20:35"
  },
  {
    "review_id": "LexQb_lkML23NXfmhQFPkA",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "az4WbjTUNkMS0XCSALpMtQ",
    "stars": 3.0,
    "useful": 7,
    "funny": 1,
    "cool": 2,
    "text": "This mall provide shelter for hot weather in Florida. It was great to walk under roof with cover and climate control area. This mall has typical store and not so typical stores. The typical stores include the Old Navy, H&M, Victoria Secret, Rue 21, and more. \n\nBut I am more interested on the not so typical store such as Play Live Station, SP Shoe Palace, Spencer Gift, Naples Soap Company, Torrid, Atomic Tattoo. These store are the fun part of the mall. Play Live Station is cool set up with black light set up. The Spencer Gift has some unique gift item that is interesting to visit. Torrid is a plus size dress that look good on the plus size women. \n\nThis mall is still enlarging to include dick sporting good, pet store and more. Movie theater is at different building that not connected. Food has some selection on the food court. There are some restaurant chain located here.",
    "date": "2017-09-04 23:45:28"
  },
  {
    "review_id": "UPmimKIFY0U-MdAIiFTcEA",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "wr4tUYkhdlWs6HJNbiipSg",
    "stars": 3.0,
    "useful": 19,
    "funny": 7,
    "cool": 19,
    "text": "I would said this is an old folks restaurant. The reason I said it because of the way they cook the food. Mostly broil and less sodium. It is an Greek restaurant with many history in Bay Area. \n\nThey an not advertised rack of lamb. Only ask and you shall have it. It is not in the menu. We did not go for it since we are getting the early bird special. We have the broil octopus and the broil dole fish. The octopus is not grilled. If the grilled it will be much better. It is serve with sour sauce. The sole fish is only broil with stir fry veggies. I think all dish lack of salt or seasoning. Great for senior people. \n\nService is good at restaurant. May be the happy hour is less people.",
    "date": "2019-05-15 01:13:01"
  },
  {
    "review_id": "4rwO3hyxMdcbD3_-Tn-b2g",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "eDqPBPit4nCy_qLEE6AA9A",
    "stars": 3.0,
    "useful": 17,
    "funny": 3,
    "cool": 11,
    "text": "Cool place with outdoor seating and some game board for customers. A lot customers come here for burger because so far there was not a burger place is decent enough except this one at this area. This place is good after sun is set and the weather is better with cooler conditions. \n\nI have the shroom burger. This is a marinated burger patty. It has some spice in it. I think their patty is cook through. Meat is good with marinated. Mushroom on top was sautéed. Good flavor. The mushroom is the best part of the burger. Fried is normal. The bun is good. \n\nJudging the price to the food value, this is 3.5 stars. Patty can be bigger. The burger is expansive for food truck and outdoor seating. For the amount of money many, we are expecting more from the food.",
    "date": "2019-09-23 11:19:41"
  },
  {
    "review_id": "l3m3vSO3cBKQibnJf7hwYA",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "znK6tMeegKf9YnGutYaG7Q",
    "stars": 3.0,
    "useful": 15,
    "funny": 5,
    "cool": 12,
    "text": "It is about 3.5 stars for this restaurant. The best thing is their rib and the good combo plate price. May be when I visit is late before they are closing, the meat just average. I would said this is a neighborhood restaurant. \n\nWe got two combo of three items for $16 each. The price is fair for dinner. My plate is the sausage, rib, and the brisket. My two side is the baked bean and parsley potatoes. The meat is just average. The rib is the best. I like side parley potatoes. Other plates is with rib, chop pork and chicken. All item is just average. The meat is more to original taste. They encourage you to use the BBQ sauce with the meat. \n\nServices are good. We were able to finish at 40 minutes. The lunch special is worth for a visit. If you like BBQ. This is good option.",
    "date": "2018-12-19 04:18:11"
  },
  {
    "review_id": "wMndZ3-CbxR6awQpd3A5-g",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "ZoI1Nj3uoSper4l5q5nrng",
    "stars": 3.0,
    "useful": 3,
    "funny": 1,
    "cool": 6,
    "text": "I have been to this Starbucks several time. But each time they just give me a so so impression. The reason behind is every time I am there the trash can is full, the table is dirty, the floor is not up to the standard. Seem like is a management problem. They need to tidy the store. I always seen a lot of them employees but did not see they actually care or clean the store. \n\nThe shaken tea with pineapple black tea is refreshing. It is better and cheaper than their coffee. They do have other drink like infusion lemonade and chai tea latte. They also has strawberry acai. I thinks they are branch out from just coffee.",
    "date": "2017-09-24 00:16:47"
  },
  {
    "review_id": "eOAdpxX9rMSHApwEdJPiYg",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "4dYOqNZHEcUMfngnomYM1A",
    "stars": 3.0,
    "useful": 22,
    "funny": 6,
    "cool": 14,
    "text": "The restaurant open for sit down during pandemic. But I see a lot of take out on the take out table. I also got take out. The restaurant has patio seating since they are at the corner of the building. \n\nWe got the garlic pepper squid and Siam noodle. The garlic squid did cook the Thai hot that I was asking. It has good sauce. But the squid feel like previous frozen food and defrost and cook. The quality is not quite there. I also feel their wok technique is not there too. May be is off day. The Siam noodle is a bit better. However the noodle seem like not cook to high BTU burn edge. If the noodle done that way, I can do it at home. \n\nThis is about 2.5 stars restaurant. The items they can improve is improve their overnight food frozen technique and longer wok time to get the high BTU effect. My order was on time to pick up and they are ready.",
    "date": "2021-01-15 13:32:29"
  },
  {
    "review_id": "A--r8BpMNdfaTMSGvwvKfg",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "nnOltt-OawITdHSr9PqaBA",
    "stars": 3.0,
    "useful": 11,
    "funny": 3,
    "cool": 6,
    "text": "This seafood market and restaurant is a interesting combination. You actually can buy the raw seafood there and cook it yourself. You also can ask them to cook it for you. This option combination is great for the customers. \n\nThe Seafood Select cook shrimp by pound, by number of shrimp or by their combination platter. It is convenient. Some time you feel like eating by the number of shrimp. 15 mid size shrimp for $7 is good deal. You also can get combination as a meal deal. The have fried or scampi. Their fried shrimp include powder spice over the fried shrimp. The only thing to improve is butterfly the shrimp and fried. \n\nI also got fried scallops there. Their scallops is bigger than bay scallops. I also notice they has fried crab. I also think the have peel shrimp. So go check them out yourself.",
    "date": "2018-05-31 03:07:56"
  },
  {
    "review_id": "L30ASsyyS6Qsz8YQ14bPyQ",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "ezB8e2rijjViprrcTdIiQQ",
    "stars": 3.0,
    "useful": 7,
    "funny": 6,
    "cool": 5,
    "text": "I have been to La Teresita  Restaurant several time. This restaurant is a Cuban charm in Bay Area. You can be restaurant or cafe side. The also has the bakery and cafe next to it for overflow. \n\nFood here is affordable. You can enjoy a steak for less than ten dollars. The serving speed is fast and you don't have to wait long and the food is ready. We have the steak Palomilla Steak and the Thursday special Pescado a la Marinera. They give you a big piece of grill steak. If you ask medium rare, they usually mid well because this steak is thin. \n\nThe Pescado a la Marinera is grilled fish in tomato sauce with little shrimp and veggies. Fish is good. Come with two choices of side. \n\nFood here is reasonable but taste is just average among the Hispanic restaurant. If you like budget and fast, this will be your place.",
    "date": "2017-01-31 13:32:02"
  },
  {
    "review_id": "FNgyLAdiVg6su9LFH3FQNg",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "uiptTJHbqohOvCbKGJL2-Q",
    "stars": 3.0,
    "useful": 13,
    "funny": 1,
    "cool": 7,
    "text": "This food truck caught our attention due to Puerto Rican cuisine. They have some interesting selection. They have some thing that nobody has it it's called trifongo. It is a combination of three different types of plantain smash together. I am highly recommend it to try this trifongo. \n\nOverall the menu includes shrimp, octopus, steak, chicken. If you'd like to have the combinations I would suggest try the matador. We got the trifongo, pulpo octopus, and the plantain steak sandwich. The plantain steak sandwich is excellent. This sandwich wrap with plantain skin. The steak is well prepared. The octopus also very good. Unfortunately I have a piece of bad octopus and cause my stomach ache. The trifongo is delicious. \n\nThis food truck definitely is about 4.5 stars. Unfortunately I cannot give them that due to one bad octopus. However, I am still recommending this food truck for the unique food experience. Especially the killer frape that they serve.",
    "date": "2021-12-02 16:32:43"
  },
  {
    "review_id": "bu2wPYTNr_eCUc5XasGtwg",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "FXsu9JqnLl2D0wqeQP4QKw",
    "stars": 3.0,
    "useful": 3,
    "funny": 2,
    "cool": 3,
    "text": "This restaurant use to be Lee Roy Selmon BBQ. Now it is Glory Days. It is sport bar. I was surprised that not many watch the opening ceremony of the Olympic in this bar. \n\nI have call ahead for a pickup food. I got the 12 pieces dry chicken wings. It accompanied the tangy  buffalo sauce. These wings is seasoning and drizzle with spice. The wing is not bad but do not have wow factor. It is about $1.10 per wing. Average in pricing. However it come with celery and ranch sauce. It has some value in it. \n\nThe take out should be on time when you call and you got the pick up time. They told the food should be ready in 20 to 25 minutes. And I show up at 30 minutes and still have to wait for another 13 minutes. This need to improve for the take out process.",
    "date": "2016-08-08 19:45:06"
  },
  {
    "review_id": "6X-uNqmSjP7Vm9DyqfqQTg",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "TIp9kHzG9bbjwI4bIHffUg",
    "stars": 3.0,
    "useful": 7,
    "funny": 1,
    "cool": 3,
    "text": "I have been to Mise en Place pass three time. I have not write a review because I was not a Yelp member then. For the pass three time, I enjoy the food there but there was long time ago. \n\nNow I have revisited this place after our light party at HCC. As a result, I decided not going with the main dish. So I have two appetizers small dishes. I have the pork belly and the fried quail. Before the dish come out, there was a complimentary dish with crab meat with sauce at bottom. This is truly a good dish. The seared pork bell came out fist. Since this is first course, I think it should be quickly. But it take some time. Fortunately we already have food at elsewhere. The dish came out and the chef is clever to separate the skin from the pork belly. The skin is deep fried and the remaining is seared. It taste like Chinese crispy pork. Not impress. The bean olive oil purée is good. \n\nThe second dish is fried quail. This dish is disappointed. The quail is deep fried. But the batter is tasteless. I have to use the salt and pepper to make it more flavor. It serve over the waffle and some ketchup like sauce. \n\nThe service is ok. I think it can be a bit faster. The food delivery need to way more faster. Not sure will be back.",
    "date": "2016-10-07 00:25:52"
  },
  {
    "review_id": "BOSz7GZ5P_xg_pZsEDk9qg",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "VOucXaivbLo5WLQbkFRiNQ",
    "stars": 3.0,
    "useful": 7,
    "funny": 1,
    "cool": 8,
    "text": "This Cuban restaurant close to Apollo Beach is one of the high ratings restaurant in the area. We like to check out if it live the rating as many Yelpers have posted. It was interesting to see so many businesses in this area once I drove off the I-75. \n\nWe have order the baby churrasco and the Cuban wannabe. The churrasco may be need a bit less lemon or no lemon. Let the customers added by themselves. I ask for medium rare, it comes medium. Meat quality is average. \n\nMy friend Cuban sandwich or Cuban wannabe is very good. Crispy and tasty. Sandwich here is good. \n\nService is ok. But the water cup is empty never refill. This area can be worked on. Price for lunch is reasonable medium range. Table may need to be replaced. Close out is good. Since one good dish and one below average dish with below level service is about 3 star. Average.",
    "date": "2016-12-03 21:09:30"
  },
  {
    "review_id": "Y6_GCu0NwoSr0JMgqjE9SA",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "xvKv0S6QIlI9lm1Y9ea0FQ",
    "stars": 3.0,
    "useful": 3,
    "funny": 2,
    "cool": 4,
    "text": "I has been want to try this chain for some time. This is Greek and seafood place. I was in hurry and saw them on the street. I have checked them out on the Yelp and feel it is good for a try. \n\nThe food order is delivered at average wait time since I ask my fish to be grilled. I have order seafood platter special. It come with choice fried or grilled on shrimp and fish. I have selected the fish grilled and fried shrimp. It come with French fries. The fish is not open flame grilled, it is cook over the hot plate. It does have good flavor. The fried shrimps have spice in the coating. It is pleasant to eat. Although they are not as seafood market fresh, but they are good enough. \n\nThe platter come with drink for $10.99. Average deal. It is quick and easy to dine in the restaurant.",
    "date": "2016-09-24 04:42:55"
  },
  {
    "review_id": "F3jqOx3atK5fv0KpCNadBw",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "QQ02pqXWE08rOkxfKk67xQ",
    "stars": 3.0,
    "useful": 2,
    "funny": 0,
    "cool": 0,
    "text": "Casa Mexicana = Supertaco. \n\nSupertaco is actually part of the restaurant - Casa   Mexicana. I was there at 6:00 pm and they get all the ingredients to their taco truck. I just don't understand why they park their truck outside of the restaurant and sale the same type of taco. In fact the restaurant taco is $1.75 and the truck is $2.50 per taco. Guess what, I choose over roof with air condition in the restaurant. It come with free chip before the food come. \n\nThe taco is good. I like the carne Asada. The pastor has piece of grill pineapple on the top is the best taco. \n\nOverall they are good, I like they have the salsa on the all you can take corner to load your taco. The have music jewel box for the selected music. Seem like they may have the dance party if they clear the table in the middle.",
    "date": "2016-04-21 18:44:14"
  },
  {
    "review_id": "bbCDmWnOry7nFLTYRWPs3g",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "nYsNsyIppe_DTueBha1x9A",
    "stars": 3.0,
    "useful": 4,
    "funny": 1,
    "cool": 3,
    "text": "We were near the St. Pete downtown and my colleagues suggest the red Mesa for lunch. I was here before and I was having dinner last time. This is the first time I having lunch. \n\nThe location is convenient for the downtown St. Pete. They have the outside and inside sitting area. Today is heavy pollen time with the oaks tree is blooming, sitting out is not a good idea. The setting is very modern. It may be a good place lunch bite get on the way to work. The food came out quick for this restaurant during lunch time. \n\nI have order three taco. The duck, steak, and ahi tuna taco. The ahi tuna is seared and mix with green, wasabi and soy sauce. I feel that the tuna is not well season. They did not seared long enough to allow fish burn taste. The steak taco is mixed with Rajas and jack cheese. I am not a fan. The duck taco duck is orange duck. By adding the goat cheese, it destroys the beauty taste of the duck orange sauce. Sometime thing should not mixed together and this one of the example. \n\nAcoustic guitar live music was performed here. Overall the serving is great and the food came out fast make they deserve 3 star.",
    "date": "2015-03-14 05:48:30"
  },
  {
    "review_id": "MEEd_f6AciW5Qltn9Ybwrg",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "L5LLN0RafiV1Z9cddzvuCw",
    "stars": 3.0,
    "useful": 7,
    "funny": 3,
    "cool": 4,
    "text": "The location of the restaurant as part of the city water park make the unique setting. The backdrop sunset can be better to tell the story of restaurant. \n\nWe arrive at the restaurant at Sunday night 5:50 pm and the wait line is already require 50 minutes of wait. We decide to sit at the oyster bar and have our dinner. The menu is interesting. To start we have the pulpo carpaccio - shave octopus with spicy source. While we were sitting there, there are worker open the oyster. After we have finish the octopus while waiting for the entree, we decided to order the oyster. I ask the worker can we select the oyster for the charbroil. They allow me to select. I have select the bigger and nicer oyster and the send to the kitchen to cook. \n\nThe oyster is definitely the best dish of the appetizer. For the entree we have order the Florida Pompano and the Chief red Eagle Duck. The duck is ok and they try to imitate the French cuisine Duck O' lean. The pompano is tasty however the fish is not salty enough. I believe they can be better. For our entree we have wait for 30 minutes after the appetizer was finish. The time to wait is too long. \n\nOur fellow elite yelp member is overrated this restaurant. The price range is expensive but the food is  mediocre. The only dish that impress me is the charbroil oyster. If you notice, half of the entree menu items are open grill cooking not stir fry or pan sear. This tell you the skill of the chef and their capability.",
    "date": "2014-10-13 00:01:45"
  },
  {
    "review_id": "wxDuMTb1vWTUlC3btEcHZg",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "FqSsVgbOxedTevshj0bfIQ",
    "stars": 3.0,
    "useful": 10,
    "funny": 4,
    "cool": 9,
    "text": "This Wawa has is not the cheapest in the area. The gas station is clean. During my visit, many has visited this place. It has plenty gas pump to handle the rush traffic hour. They have free air to the vehicle tires. However, it is cover for out of service. Not sure when will it back.",
    "date": "2018-08-15 19:46:04"
  },
  {
    "review_id": "mdrb1Q_PLB3KESNHkvqsLQ",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "bR3TcTiLN5UzQA7zvPu0vQ",
    "stars": 3.0,
    "useful": 15,
    "funny": 4,
    "cool": 10,
    "text": "I have this restaurant book mark for a while. Finally I found a time to visit. The restaurant tuck away in a busy plaza. Parking always challenging here. The restaurant has inside and outside seating. I went straight to the bar since I am solo that day. The bar has good display of alcohol bottles. \n\nThe menu for the brunch hour is extensive. Selection is wide range. Base on the yelp picture, the steak and egg is popular. But one of the menu item changes my mind. I got the lobster omelette. This dish has lobster, provolone, tomato and wrapped in the egg. The side is potatoes hash. The lobster is three little lobster crawl. I wish it has some body meat for the price we paid. \n\nThe service is good. Food come out quick. But the food didn't sit well with the stomach. Something not quite correct about the freshness.",
    "date": "2018-12-25 15:42:59"
  },
  {
    "review_id": "9fMxCfBDGiqojBlDuANJaA",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "h8orJ40GJZU2uxJTxLLp7g",
    "stars": 3.0,
    "useful": 13,
    "funny": 2,
    "cool": 10,
    "text": "This restaurant has high ratings. However, I found that not match the experience I have there. I visited the restaurant after 8 pm. Still have table waiting for food and some people order the take out. Not too busy. \n\nI have order the spicy drunken noodles with shrimp. I have specific order. I want my noodles dry which mean don't let the juice come out. I also order it to be Thai spicy hot. While I wait for the food, they do have special day combination or pre prix dish on holiday. Look interesting. \n\nWhen my noodles come out, there are wet sauce every where. Which mean it was not on the wok too long. Because no burn mark at the noodles. The dish is medium spicy. Not even close one step below Thai hot. This too difficult to fixed. One good thing is they have good size fresh shrimp. I didn't ask for redone due to time. \n\nThis is been there done that.",
    "date": "2018-07-25 18:22:35"
  },
  {
    "review_id": "BGWjpsDjQLKOMdl2FmYCKg",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "HO1KJ6Jwk3sU_UTIJGOLDA",
    "stars": 3.0,
    "useful": 18,
    "funny": 5,
    "cool": 10,
    "text": "This new Indian cuisine is located in the heart of Carrollwood. If you find Chili's, they are just next to it. They offer weekday lunch buffet for about $10 and weekend buffet $13. There is a lot Indian customers dine there when we were there. \n\nWe were there for the weekend buffet. It has good selection. If you are meat eaters, there will s a lot of choices. During the Saturday lunch buffet, they have goat, chicken and shrimp. The goat curry is fantastic. The tandoori chicken is marinated to the bone. It is quite tasty. The tempura shrimp may be with tikka sauce ( not sure ) is good. \n\nWhy three stars. A lot of improvement need to be made. 1. Services need to paid attention when customers water is empty. 2. Temperature of the food is at warm condition not temperature hot. 3. The food is too American. Not spicy enough. May be the spice need to improve a bit to make it stronger.",
    "date": "2018-08-15 03:37:08"
  },
  {
    "review_id": "vddSHg_cOSjBX1gZ3Z_n_w",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "XDEgMLsnL9u4qPV_bNCZHQ",
    "stars": 3.0,
    "useful": 5,
    "funny": 3,
    "cool": 7,
    "text": "Close to 3.5 stars restaurant. I applaud their good price for people who craving for sushi. Although they may not the best, but judging for the affordable, I will give them a repeat visit which most of the owner is asking for. A repeat customer. \n\nThis is close to cafeteria style with order at the counter and bring the food to the table. Their regular sushi is under $5. Specialty sushi is about $9. They have hibachi for your order. \n\nI have order the appetizer as fried rock shrimp. This is good size of shrimp. Each piece is about a dollar. Our main entrées are the stir fry beef noodle, spicy tuna, volcano roll, and Hawaii roll. Spicy tuna roll stands out for the taste. Good flavor. The specialty roll are drop behind the good name. \n\nI would try their lunch special if I am here. Better than fast food chain for the same amount of money.",
    "date": "2017-04-18 02:58:23"
  },
  {
    "review_id": "A2iozWmCQERxSTehRoTwKw",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "4lq9BmUFUOU8eQXdJ1naog",
    "stars": 3.0,
    "useful": 2,
    "funny": 1,
    "cool": 4,
    "text": "The food here is cheaper than many Americans fast food. If you are going spend money in the McDonald might as well to check it out for the better choice other than Hamburger. For the same price you can get a meal for less than $8. \n\nThis is my first visit for the restaurant at the mall. I have visited many Panda Express at the Airport food court. Time to time they have the new product. Today they have the Peking Pork. It is boneless pork cover in Peking sauce after deep fried. It is delicious. The noodle may be need some work to make it less drier and boil it longer. \n\nI like Strings beans with beef. Overall this good value. It has all the nutritional need. If you are hungry, you can choose more protein. The price just slightly expensive for you hungry stomach. Service is good.",
    "date": "2017-11-22 16:25:21"
  },
  {
    "review_id": "MbcUPiefexUf6BX3W_0i1A",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "Mgcgy5ZCZvwzggV5xausug",
    "stars": 3.0,
    "useful": 6,
    "funny": 5,
    "cool": 5,
    "text": "Grocery store??????? A pizza and beer restaurant is more like it. The name of the restaurant is base on historic grocery store was here. It do has some craft beer. \n\nThe pizza we order tonight is bring the noise. It has all kind of meat items such as bacon, pepperoni, sausages, meatballs, ham. The smaller pizza is 16\" is good for 4 people. It also has fresh veggies ingredients to go with it. They claim the pizza is stone bake and suppose to be healthy pizza. We also add a bake chicken wings without the hot sauce. It has herb on top but is salt less. \n\nThis restaurant is about 3.5 stars for the food and performance. A few thing can be improved such as take home box should not be single plying cardboard. It should be pizza box. Because the oil of the pizza will sip below the box and oil your car seat. Weekend may need more help since many show up at the restaurant.",
    "date": "2016-02-27 02:30:34"
  },
  {
    "review_id": "PVCjDq3rxkzqniQgbLcv3w",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "93UD654AB6IzMPFlQgwfOg",
    "stars": 3.0,
    "useful": 12,
    "funny": 3,
    "cool": 8,
    "text": "Chuy is new Tex Mex in the Wesley Chapel. They have the new building that design into their requested ambient. The interior decoration includes the Elvis 60 style set up. The space is beautiful. It is comfortable. \n\nOne best thing about this place is the price and food quantity. This I no doubt the generous restaurant we have seen in Wesley Chapel. A lot of items have good value. \n\nFor the taste is what they need to improve on. I feel they lack of taste. We got the steak fajitas. It come with 3 flour taco. It has guacamole, cheese, salsa, sour cream, rice, and caramel onion. The second dish is the combo special with taco and green enchilada. \n\nService is average. Food come out to the table on time. I did not try the drink. We don't need to wait for the table when we get to the restaurant.",
    "date": "2018-07-19 19:39:00"
  },
  {
    "review_id": "uy0jjOyqmZfDfyPpWsLfbw",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "S3JZCYWaflDWRY9eiGZs2A",
    "stars": 3.0,
    "useful": 12,
    "funny": 4,
    "cool": 10,
    "text": "Dickey BBQ is middle of the pack among the BBQ joints. If you have coupons, the deal is very sweet. Dickey grill and smoke the meat. It has different meat to offer. The best are the pull pork and brisket. \n\nYou can order plate (combination meat), sandwich, meat by 1/2 pound. The plate has good deal and you can choose two or three meat plate. It come with drink, two side and the price close to $12. You also can enjoy the soft serve for free. We got the burn end brisket and pull Pork. It was very good the day we have visited them. They were going to throw away the side fat and o ask them just put in my plate. \n\nThe BBQ franchise was established since 1941. This restaurant is young at Wesley Chapel. This was our third visit and it still good. I think they need to increase number employees since this area is just lack off.",
    "date": "2018-01-07 13:36:41"
  },
  {
    "review_id": "1jSHua8z1bGrvoUZIbjELQ",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "dKLfvJaR-dCk84TCdTMWnA",
    "stars": 3.0,
    "useful": 6,
    "funny": 0,
    "cool": 5,
    "text": "This is second Mellow Mushroom we have been to. Basically is pizza, calzone, burger, wing, and salad place. Really is nothing fancy. In compare to some of the wood fire pizza at nearby restaurant is just average. \n\nWe got their house special pizza. The meat is nothing special. The crust is too thick. We also got their wing.  But there are better wing place nearby. It is oven roasted. But the marinated is not impressive. House salad is good. \n\nService is better. May be this is only good thing about the restaurant.",
    "date": "2020-02-14 02:22:31"
  },
  {
    "review_id": "qLxga6kY35fWWJ6zCZ551A",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "a6J0Jq1GJ6Shk-L10Bp6Cw",
    "stars": 3.0,
    "useful": 10,
    "funny": 3,
    "cool": 8,
    "text": "We were so happy to revisit the ramen place I like. I was look forward to try the seafood ramen and crispy duck ramen. The seat was easy and quick since they are not busy. Our food come out right time without too much of waiting. The food are presentable. All this are good. \n\nTwo minutes into the food we immediately find the noodle is not right. Some of the noodle are glued together. Seem like 5 Strings becomes one string. My wife noodle is very gooey. This is not acceptable. I think my noodle was sit for a while and my wife noodle was not processed correctly. In Asia, the noodle need to be broil and put in the cold water to cool off and the same time wash away the extra flour that attached to avoid gooey. This is the basic. I think their chef has not pay attention to our bowl and skip step. That cause the entire noodle are not good at all. If this happens in Asia, they will not be acceptable. \n\nI think with each bowl we paid $16 a piece. It is not to any standard and not to the art of ramen. Not worth the money. Inconsistency does cause this restaurant to be changed my opinion of number one ramen in the Bay Area to I am not sure to revisit again. I have drove 38 mile just because I have the best experience on the first encounter. Now, I am not sure their future.",
    "date": "2017-07-30 03:31:22"
  },
  {
    "review_id": "cdhKuls8iLtJXktB-hzyqA",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "5H5mKgROIfmYKHjFMCePCA",
    "stars": 3.0,
    "useful": 21,
    "funny": 7,
    "cool": 16,
    "text": "The food deliver safety for the restaurant is an A grade. They have you order online and pay online without touching. The pickup also touch less because you roll down window of the passenger side for them to drop the food. The check in also touch less by said that you are here to pickup. \n\nThe Carside pickup simply doesn't work. I have put my order in the restaurant at 1pm for 4:40pm pickup. I arrive and check in at 4:39. I was assigned a parking spot for pickup to wait for them to take the food to deliver to the car. I was wait there till 5:07 pm for deliver the food to my car. 28 minutes wait at partial shade area. Some car doesn't even have shade area. For taking so long to wait for the food I thought they must be cook the food when you check in. It was not. It is warm food and seem like seating at the kitchen. Obviously the my early put in order was cook on time but the communication from check in to food delivery to car was not coordinated. I also see an customer who missing a sauce and they take about 10 minutes to get the missing sauce to him. The execution is a F. \n\nWith that said. Their grade could be D. But I give them C because the food still tasty.",
    "date": "2020-04-30 12:03:51"
  },
  {
    "review_id": "JGOAJvWJ_0oClaZ3ZPLxwg",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "69ccjOpx2iFvr1y2qas9uA",
    "stars": 3.0,
    "useful": 15,
    "funny": 3,
    "cool": 9,
    "text": "Caffeine is an Internet cafe. Many of the customers hang out there with computer. May be school homework to work as group.\n\nThe cafe is comfortable. It has a nice set up. They serve some interesting signature ice coffee. I got the Ice Caramel Delite. It is $4.5 for about 12 oz. for ice coffee that size is considered on the high side for the price. Most ice coffee serve in 16 oz due to ice was added at 70% of entire cup. With 12 oz. you will have less coffee in it. 5 big sip and all gone. \n\nThe coffee is good taste. Especially the caramel in it at the bottom. It interesting to have that. The coffee is very concentrated which after the ice melt, I still like to drink on it.",
    "date": "2018-08-21 18:28:03"
  },
  {
    "review_id": "X5kBwrp7zJlZIsaoDnIWzg",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "xBAieAvUBy4xKE3hBAawbg",
    "stars": 3.0,
    "useful": 10,
    "funny": 5,
    "cool": 12,
    "text": "Average among the Kung Fu tea chain restaurant Bay Area plus Sarasota for the food. It is about 3.5 stars. Drink may be ok. I like the new space of the Kung Fu tea. Somehow this supposed to be open at Belcher and Ulmerton but take year to change to this location. \n\nI got the ninja chicken to go. The box is half box with lettuce at the bottom. Quantity is only 13 pieces of chicken. Coating is not the best. No five spice seasoning. Chicken feel like processing meat. Not sure any good thing about the ninja chicken. Price for that many pieces is pricey.",
    "date": "2019-09-07 13:36:21"
  },
  {
    "review_id": "HBP3F-Atxta9pWrjUT4jdQ",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "fNjozYBX0X4ES3ME7WVgXQ",
    "stars": 3.0,
    "useful": 12,
    "funny": 3,
    "cool": 11,
    "text": "I was here to try their new items. KFC now have a lot different types of buckets deal. But I am here for their combo meal. I got their two pieces dark meat original fried chicken. The combo meal come with one side and drink. I still like their potatoes with gravy side item. \n\nI have try their new product- Nashville Hot Chicken Strips. The Nashville hot is good hot. Chicken strips are crispy. I would love to have this dish. The last dish is the popcorn chicken nuggets box. This $10 deal is good for movie night. The chicken get bigger pieces than old popcorn chicken. It is a improvement. \n\nDuring the pandemic, the drive through is one window with person handle the money and the food is one person. I think this is the area to improve. No mask is found on the person who at the drive through window",
    "date": "2020-04-26 00:26:12"
  },
  {
    "review_id": "GEcSi3qyR_bN6_eF-qnUnw",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "RZCLY_q25X3oNq4gkM8aIA",
    "stars": 3.0,
    "useful": 12,
    "funny": 4,
    "cool": 9,
    "text": "This restaurant is 3.5 stars in my book. It has the vibe of fast food concept. Food should be easy to order. Due two employees collecting money and assembling your in the evening hours, it will be a challenge if the line has 7 people. When one is assembled the phone order which mean down to one to take care of the front counter. Delay happens. \n\nWe have the carne Asada, pastor, carnitas, grilled mahi mahi tacos. The carne Asada is the best seller. A lot of people ordered it. The beef was cut into good size of beef cube. It has quantity even thought they charge over 3 dollars for a taco. Worth the money. The fish has good grilled mark. The other two just average. Overall is not a bad deal. \n\nThere are a lot of young people come to enjoy the dinner. I also like the guacamole with chip. It has good guacamole. The taco has unlimited toppings which make many return to revisit.",
    "date": "2018-04-10 23:42:20"
  },
  {
    "review_id": "cpTBSYBbicCbqPEaGi_EZg",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "-x2B-rrTqqLMrcnzYuQlpw",
    "stars": 3.0,
    "useful": 26,
    "funny": 6,
    "cool": 17,
    "text": "This may be the first poke spot in New Tampa Area. I am excited new business ideal to be build on the neighborhood. It is perfectly located at The Seven Oak large community entrance. It serve New Tampa and Wesley Chapel. \n\nAfter so many poke place pop out in Bay Area, this one is in the middle. Reason as below. When you decided for the protein, they determined two or three scoop. The difference is $2. However the scoop they are using is extremely small than the ice cream scoop. In addition, they scoop up the fish and press against the wall. So you got half of the scoop. Not like scoop up the meat and let it fall scoop. \n\nThe add on is not impressive. Just like typical poke place. They premixed some of the protein like marinated tuna, spicy salmon, and spicy tuna. Ok enough selection. The sauce need to have some choice of oil base and ponzu sauce. \n\nThing l like is choose any topping except avocado for $1 extra.",
    "date": "2019-02-06 18:21:16"
  },
  {
    "review_id": "-__mUoLCjmNWdAYZlvqHQA",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "5H5mKgROIfmYKHjFMCePCA",
    "stars": 3.0,
    "useful": 1,
    "funny": 1,
    "cool": 2,
    "text": "This is our neighborhood Olive Garden. I have been to this place many time when my kid is young. He loves the Chicken Alfredo here. This Olive Garden at New Tampa is better than the Brandon and Bush location. It provides more quantities of food than the other two locations. \n\nTonight they have a promotion of 4 course meal from $14. The entree on the $14 is not attractive. As a result, my wife select the four course with Shrimp Alfredo entree $17.50. I have the rosemary garlic chicken that is not in the four course meal. The four course meal came with chicken meatball with tomato sauce. It is good. My meal came with a soup Zuppa Toscana.  I love this soup with fresh kale, Italian sausage and  slice potato. It is good when you dip your garlic bread and let it sit for a few second and allows the soup sock into the bread. Then you eat the socking bread. Yum. The rosemary garlic chicken is ok for it price. No wow factor. \n\nToday I am disappointed on the service. They are slow. It almost want me to give them two stars. Base on the past experience, I give them 3 stars. They could have been 4 stars, unfortunate they do not earn that tonight.",
    "date": "2015-01-28 00:54:59"
  },
  {
    "review_id": "JDcekuqiOepp9a-T2Qzyng",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "s0yq79nfOrJEYoGKQLoxkg",
    "stars": 3.0,
    "useful": 11,
    "funny": 2,
    "cool": 7,
    "text": "This Greenland is sister store with Greenland at Temple Terrace. I think their Temple Terrace location is better. They are very close to 3.5 stars in my book. The food is good. The decoration is basic. \n\nThe menu is very simple. Just enough to choose from. I got kabab that day. They have three different meat to choose. Beef, lamb, and chicken. Their meat is not actually open flame grilled. It may have grilled on flat steel plate. However, the marinated flavor is there. I got the lamb and beef. The lamb is actually best and tender. The beef is a bit over cook and become tougher to bite.  I like the baba ganoush. It go well with the pita bread. The rice is too wet. Can be a bit drier. \n\nOveralls good value for $10.99. The food order at the counter and bring to your table. Quantity is enough for one person.",
    "date": "2018-10-16 20:55:05"
  },
  {
    "review_id": "bWl0I4uBQ2r0dghfllQZnA",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "ywIO9dHL3JbcsGHgG9LJvg",
    "stars": 3.0,
    "useful": 13,
    "funny": 1,
    "cool": 6,
    "text": "Some gourmet burger place. But I don't feel gourmet much. I think their burger just average. The burger is small. If you are big hungry man, this may not be your place. The meal deal won't be able to feed you. \n\nShake Shack is a yuppie restaurant. The burger patty is press to flat and grilled to crispy. Is is different kind of burger preparation. I would definitely give them a A+ on the sauce add on especially the truffle burger. The fried onion is just a bit on their truffle burger. Overall their best burger is the truffle burger. Bacon avocado burger is ok. Definitely is a good mixture of material. \n\nWith the size of burger and price paid, it is in the expensive side. I think they need to do something about the size of burger. Especially the new business to attract repeat customers.",
    "date": "2021-11-12 12:42:55"
  },
  {
    "review_id": "EmbQgbfynt9xq_IA5fzxEQ",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "ChMcfx_cnuKZQYT4tE3arQ",
    "stars": 3.0,
    "useful": 6,
    "funny": 3,
    "cool": 5,
    "text": "A fast food joint in very nice color for the building. I have not seen a Pollo Tropical like this building color. Very Art Deco color. When you walk in the restaurant, the grilled was displayed on the side. The chicken is golden grilled. Look yummy. \n\nWe have take from this place before. They are a bit charcoal or burn. I decided to come in here and try. We have $10 coupon for whole chicken and two sides. Very good deal. The chicken is well cook this time. The comment I have for this place is the mojo marinate is too less. The marinate only skin deep compare to other pollo tropical. It need to go to the meat. \n\nThe service here is great and clean. Salsa can be obtained and taken at the salsa bar. I like the good deal. Order is quick. I like the color of the building.",
    "date": "2017-04-22 13:15:33"
  },
  {
    "review_id": "jXb4lr_R_uLcCqREC1cKCA",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "veRnE8SVhE8l9TiWvPjfVA",
    "stars": 3.0,
    "useful": 19,
    "funny": 2,
    "cool": 12,
    "text": "In the Bay Area, they are average in food. But in Brandon, they do have the best German food around that area. They do get a lot of local support especially their lunch special is attractive.\n\nWe got schnitzel Berlin and schnitzel Jaeger Art. Both are fried pork with sides. The Berlin Schnitzel is come with pepper corn sauce, red cabbage, bread dumplings. But I think the Schnitzel Jaeger Art is better. It is top with creamy mushroom sauce and spaetzle. However, both breaded pork are not crispy on coating. Taste is there, I feel they are in hurry to put pork out and not fried it longer. Coating also can be improved with more tasty spices in it. \n\nOverall is good. Popular for lunch. Service is good.",
    "date": "2021-03-16 18:08:35"
  },
  {
    "review_id": "1I9aXAM12dbTuU3yfvE3DA",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "iki4_URxOXd8h0mWHt_xJg",
    "stars": 3.0,
    "useful": 6,
    "funny": 0,
    "cool": 3,
    "text": "We were here for the burger week. We did not go for the shuffle board games. The shuffle board games is ten dollars per person. They do have good indoor shuffle board facilities. The restaurant dining area has few tables for food. We sit on bar for easy service. It is almost look like dive bar. \n\nWe got the only burger in the menu. The burger come with potato tots. The burger top with melted cheese. This burger is average. I also got the can of beer. The visit is nice. But I feel like this bar is neighborhood bar. This bar will not able to mixed complicated cocktails. They don't have mixologist. But for margaritas, they can mixed it for you. That pretty much of it.",
    "date": "2021-11-18 19:08:27"
  },
  {
    "review_id": "z2IKRQoQ1UmK0ffwAVallw",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "lPyH4YUsqRYsYcti4-jhcg",
    "stars": 3.0,
    "useful": 8,
    "funny": 4,
    "cool": 8,
    "text": "I am trying out the jerk place I have never been too yet they are not too far from my house. This place is close to university. I have call in for my order. The pick up was no wait when I am arrived. The timing is good. \n\nI am determined to find out the good wings place near me. Jerk Pit provided different season spice option. The grilled wings with marinated jerk spice is interesting. Wing is about $0.85 per wing with tax. The taste is average compared to many jerk chicken around the tampa. Wing is a little bit charcoal outwardly. However the marinated spice is into the meat. \n\nThe food is good. Delivery of the food is as promised. Solid restaurant.",
    "date": "2016-12-22 19:58:49"
  },
  {
    "review_id": "0yMHcqrYG11vgQ8EjDtE6g",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "KiwskluQ7tMqZqvuf872vg",
    "stars": 3.0,
    "useful": 1,
    "funny": 0,
    "cool": 1,
    "text": "Finally a short distance to drive to this BBQ joint. I remember every time I make a trip to Orlando, I have the carry out from this smokehouse BBQ restaurant. Now I can sit and eat the food at the restaurant since they open one in tampa. It Is long wait but worthies for the wait. \n\nTonight (Friday night) is one of the longer restaurant hour night that they have until 9 pm. We arrive at 6:27pm and the wait line build up to sidewalk of the restaurant side. The wait on the line is 25 minute. The different of this restaurant is they built their sweet item at different side of the order line. This actually reduce the wait time compare to the one at winter park location. This is a improvement. While we were waiting on the line the server bring up the small ketchup cup size try item six shooter for the taste. \n\nWe have order the Santa Maria Tri-Tip Steak and Smoke Prime Rib. We have added the half pound signature brisket. The side are the collar green, corn, sweet potato smash, and the bacon wrap jalapeño. The taste did not change from the original restaurant (Fairbanks Winter Park). The prime rib is juicy and tender. The brisket is well seasoning that enter to the meat it self. I love their their side because they extra effort to process it. If you fist time here, you should start with their brisket. \n\nIf you come here to have a nice dinner, this is not the place. You should come here just for the food since your food is serve on top of paper on the tray. It is BBQ joint that you need to get down or chow down. Expecting line will build up to the door.",
    "date": "2014-12-27 01:01:06"
  },
  {
    "review_id": "oZJngudCFQt35jKMgEwZaA",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "yTTxelcMvMoJvBoVoNkuzA",
    "stars": 3.0,
    "useful": 5,
    "funny": 0,
    "cool": 4,
    "text": "Just average ice cream store. Nothing special. Other than they conveniently located at Central Ave, St. Petersburg. It is easy walk distance for the downtown residents. Urban Creamery is part of URBAN local food chain. They have BBQ, southern food and deli. With ice cream add to their extended food variety that make them complete. Just need the appetizer restaurant complete the chain can offer. \n\nWe have the rum raisin and strawberry chocolate chip. Since the 12 oz is only 2.50 more than the 6 oz, we went for the Grande. The strawberry chocolate chip is just ok. I feel they are not creamy enough. Half to the Italian ice frozen texture. The rum raisin is better. The total is close to $7 for 4 scoops is kind in the high side.",
    "date": "2017-09-28 01:48:36"
  },
  {
    "review_id": "hsf6nJZp2oKJZ91wPFVB7Q",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "K_JuuazFvgiXkTFg61DfdA",
    "stars": 3.0,
    "useful": 5,
    "funny": 1,
    "cool": 2,
    "text": "Our friend like to try shabu shabu and we pick this restaurant since they have closer one to our Chinese taste. We normally don't do shabu shabu is due to the assembly material can be obtained in any oriental market and cook it yourself. \n\nWhat is shabu shabu. My family celebrating Chinese New Year with this cuisine because it can add anyone anytime by add additional material without involving heavy cooking. The New Year also fall in the winter time and they are cold outside and shabu shabu is the best part. There is a Chinese term for shabu shabu- hot pot. We actually have the charcoal in middle to broil the soup and heat up the pot. Now we have the electric broiler that not required charcoal and easy to control the temperature of the pot. \n\nThe material is easy. Just but the chicken and pork and remove the meat. The bone of the pork and chicken put into the soup and broil for the broth. This restaurant did not do that. All their soup is come in package of spice and added into the pot. They have the selection of the slice meat, meat or fish ball, dumpling, veggies, type noodles. They are not authentic since their soup is in package. \n\nEating the hot pot is topic the sauce correctly. The right sauce is important to dip on after you have broil your material. The service of the restaurant is slow. But they have each pot for each person. Something I don't understand is why they charge the soup to broil in addition to the material. I would suggest only charge when you want to upgrade the soup.",
    "date": "2015-09-19 14:17:18"
  },
  {
    "review_id": "ncq8cjThSDMG5_h8gkTkOw",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "eNTVSEO6dQVXQg7D8XMsbA",
    "stars": 3.0,
    "useful": 6,
    "funny": 4,
    "cool": 3,
    "text": "We went back to this restaurant since my boss have a good experience last time. This time we have a different experience. Seem like the restaurant change the owner or the chef has changed. \n\nAfter the waiter took our order, the accompanying appetizer came out in different group time. We all have the same appetizer but they came out different time. Some of us have it and some have to wait. \n\nThe garlic squid that I have order is different from I used to get. They are not as perfect garlic sauce as I know. I hope they can improve.",
    "date": "2015-12-23 03:28:12"
  },
  {
    "review_id": "x2Crr_-efUYZXSFrghS5Vw",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "AxfB3gE1kWlRhcD5tGZY_A",
    "stars": 3.0,
    "useful": 1,
    "funny": 0,
    "cool": 2,
    "text": "Mobile food truck most is some quick and easy assembling. But I have not seen a pho truck before. This is my first. \n\nDuring the Generation Food truck event for the Taste of Asia the Pho Truck was there. I have a chance to try their pho. Their pho is bit different than other Vietnamese restaurant pho. It is a bit lighter and more into cilantro taste. The price charge is typical Vietnamese restaurant pricing. It is good to have good bowl when they close to your work or venue. \n\nI have tried their sandwich with grilled pork, vermicelli with grilled pork and egg roll, and fresh roll. They are average. You walk to the back of the truck to see what the actions in the kitchen are. They are bunch of hard working people, two assembling food and one take order and deliver food. I would order the pho again if I see them. The line of the event for this truck is loooong. Good business when you see the line long.\n\nAfter talking to my wife. I feel the pricing is in the high side.",
    "date": "2015-09-07 19:20:58"
  },
  {
    "review_id": "cdFW6SHib_et91IhajBl3g",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "Bxmhm659VqrQYHc0hiku5w",
    "stars": 3.0,
    "useful": 3,
    "funny": 1,
    "cool": 4,
    "text": "I am ok with this place for quick bite. Grab a slice of pizza for snack or lunch. This place is busy after 8 pm. Seem like they have good business. I believe the price is affordable that drawn the crowd. \n\nMany choice to the type of pizzas to chose. Each slice no more than $3.50. They do have some specialty pizza that you normally not seen at pizza fast food restaurant. I would said they are better than the pizza fast food. All pizzas were made and display. You pick the one you like and ask them to heat up. Heat up is good, I prefer the freshly cook since I am in the restaurant. \n\nThe place is popular, outside seating is available. It is fist come first seat situation. Just wait for someone the get off is easy since most people grab only a quick bite. Seat is available very soon. The problem is wait to get your table you have claim to clean up. Eventually it will be clean.",
    "date": "2017-04-12 03:26:14"
  },
  {
    "review_id": "WihZCJgyKZkMfi1MNhTXBA",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "jG9_Ug1nziNgD2JESl2Pfg",
    "stars": 3.0,
    "useful": 16,
    "funny": 6,
    "cool": 13,
    "text": "This good truck is about 3.5 stars. We were here after dinner and decided to try their food truck. Their taco has 4 selection- ground beef, chicken, pastor, and chorizo. The regular taco is $2.50. Is kind of above the average price. \n\nI got the chorizo and the pastor. I feel their meat is chop to fine. It feel like very powdery. However, I do like their toppings. They will ask you want a Mexican way or US way. I got the Mexican way. It top with cheese and sour cream. \n\nTuesday, they have taco Tuesday for a dollar a piece. By then, it may be worth the price. Others than taco, they have quesadillas and burritos. May be that is better.",
    "date": "2018-12-14 21:10:19"
  },
  {
    "review_id": "6yMzzQMeFtW0DH9rSJgA5A",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "EYw42-YsnMr0pbqM5YXRxw",
    "stars": 3.0,
    "useful": 13,
    "funny": 1,
    "cool": 10,
    "text": "I think it is a solid four stars restaurant. Why I have three because the food did not sit well in my stomach. Other than that. They are solid 4 stars. \n\nEngine No 9 is visible restaurant on the MLK. They have many famous burger type including the one with crawfish tail. I did not go for their strongholds. I got their entree item with Sriracha Salmon. This dish well presented. They have good pieces of salmon steak with skin. The salmon is seared. Top with bacon and onion rings. The bed is broccoli slaw with Thai chili sauce. It is very good. The presentation of the food is top the chart. \n\nThe service is excellent and attentive. The price for the food is reasonable. The atmosphere is bar type. I would like to try their crawfish burger next time.",
    "date": "2018-08-30 01:31:19"
  },
  {
    "review_id": "5zjijRVWlLSDAEvZjMk5Aw",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "J9Bc1bZuxGo2VtAo-txgRA",
    "stars": 3.0,
    "useful": 19,
    "funny": 6,
    "cool": 16,
    "text": "A converted gas station to restaurant now is popular and hip place in Seminole Height. This restaurant is close to I-275 and easy to get to. Parking is available at the restaurant make it convenient to visit. It is a popular place for brunch and coffee. Night time it turn to gathering beer place. \n\nI got the Cortado to start for coffee. It is thick espresso. This type of espresso is actually origin from Spain or Portugal. Then we have BBQ pork sandwich. I think their sandwich is average. However, I like their salad that accompanied it. \n\nSo far they have the right ideas for the hip place with garage seating and outside gas station seating. If they can add some gaming material will attract more people. Service is extremely good. Their waiter and waitress are well trained.",
    "date": "2019-10-14 02:34:11"
  },
  {
    "review_id": "y9TnRMp_cOrai41f05B_rQ",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "YHrP-o3aTo1JJXGsQovU0A",
    "stars": 3.0,
    "useful": 18,
    "funny": 3,
    "cool": 11,
    "text": "I was there around 4:30 pm on Sunday. The shelf for the pastry is almost empty. I bought the last guava pastry. The last pastry seem like very oily smell at my first bite. Not bad for the price just a bit over a dollar. The guava taste good. \n\nThis place is famous on their fabulous Cuban bread. It is long mean very long bread. Many come to here just to have that. It is good value. The entire store has no ac and good to raise the yeast.",
    "date": "2018-08-21 20:02:06"
  },
  {
    "review_id": "gA9B_XEElheGqVY_qKiPBA",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "-bR_RgtKytmFOHGPVUBcWg",
    "stars": 3.0,
    "useful": 13,
    "funny": 1,
    "cool": 10,
    "text": "The visit was pleasant. The restaurant is located in a very nice plaza and they are kind in the center attractions of the plaza. Parking is free but the plaza is a bit busy to share parking among all other businesses. This is a minus for the location for customers to find parking. \n\nThe interior is great pen space. Plenty of light to see what you eating. I likes the system order your food at counter and they bring it to the table. It is convenient for the customers. \n\nI have ordered the tuna sandwich. I ask if the tuna is seared. And she acknowledged. However, they serve it fried with coating at outward of tuna. It is different than I was ask. Which is good with me. The tuna is just average because they probably fried from frozen. \n\nI think their counter clerk need to know what they serve if a customer asking about the the food. Overall is good experience.",
    "date": "2018-03-28 17:54:06"
  },
  {
    "review_id": "34UXHRyAhaA2l1WrcC0VjA",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "j3kGicU3mPG_ciIKG1Vuyg",
    "stars": 3.0,
    "useful": 18,
    "funny": 3,
    "cool": 11,
    "text": "Brooklyn Water Bagel is 3.5 stars. The yelp review is on target. The 3 to 4 stars is all base on when they take the first bite on to go order. If the customer take the bite there will be close to 4 stars. If it is to go, it may not be the same experience. \n\nI have the chorizo bagel. For the price is about at the high side. Like the scrabble egg in it. The chorizo is ok. Food is definitely a breakfast style. As a result they close at 3 pm. May be changed a bit here and there will bring them to better product.",
    "date": "2021-05-19 19:32:01"
  },
  {
    "review_id": "kq6WnKa7pl1787KfO7lL5w",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "ny1N_Py01kVoGOvL9oKjMQ",
    "stars": 3.0,
    "useful": 7,
    "funny": 3,
    "cool": 4,
    "text": "Come here for a drink and checking this place out. Typical bar setup at soho area with one half facing the outside street and the other half facing inside the building. \n\nWe have not try their food. Can said too much about it. However the set up of the bar is nice. The have some selection of the local draft. The beer is in the high side on the happy hour price compare to south Tampa. They do have the foot ball bucket during the game time. They do have good selection of Pinot Noir. \n\nThe only thing I don't like are their complimentary valet parking. If I don't want them to park my car, I cannot park on their lot. I have look for street parking. Sometimes if don't plan and go to this place and you don't want valet, you cannot park there. I do like their service. However, overall cost of drink is a bit higher compare to normal bar.",
    "date": "2015-11-23 01:46:39"
  },
  {
    "review_id": "ATRf6bWVLpgrEviZrzoF5Q",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "yb2vAoH3E-R11yWmnT570w",
    "stars": 3.0,
    "useful": 3,
    "funny": 2,
    "cool": 3,
    "text": "In search of taco, i decide to be this place since the other taco place is too busy. This place been in my bookmark for some time. This taco bus is the oldest in the Bay Area among all the taco bus. I thought they must has something special item from other taco bus. They did not. \n\nThey open very late to 4 am in the morning. If you cannot find a place to eat at late hours, this place may be open. A yellow bus is a order center. Then you can take your order number and they will bring the food to you.  \n\nThe taco is below average from our current taco fever. They may need to improve since Tampa already has many mobile taco open and better. Meat seasoning need to step up. The meat juicy need to preserve when they serve. Overall, I would say this is a jewel in Tampa to symbolize the Tampa.",
    "date": "2016-04-14 22:45:36"
  },
  {
    "review_id": "Fco-i1SGkDWcafRai_HJkA",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "G_bi7l0nU74I4Vr1V7IcMg",
    "stars": 3.0,
    "useful": 7,
    "funny": 3,
    "cool": 4,
    "text": "Bobacup is getting a bit slagging today. A few week ago I find out after 9 pm they don't cook the Hong Kong waffle and we turn away. Last night they completely remove from the menu. Don't understand it. Their reply is not popular item. \n\nNow they serve crepes with fruit and whip cream. I have order the one with strawberry and banana. Not my liking. When they roll the crepe and try to pack in the fruit in cone shape. It doesn't work. I would rather they lay it flat fold three folds with the fruit inside. It turn out they give out their best product and go to somethings they are not good at. \n\nAlthough the boba menu is still there, but the service with no smile, and the quality is not there. A drop of star from my previous review. I wonder some time what define their identity.",
    "date": "2015-12-27 15:28:43"
  },
  {
    "review_id": "W2V1Tf-W0KPkwsGnQXbbAg",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "0vTc7-wiDBDKKmGvC0EzFg",
    "stars": 3.0,
    "useful": 6,
    "funny": 4,
    "cool": 2,
    "text": "This will be the last restaurant to try during the St. Pete restaurant week. We call ahead today and they indicate no reservation is needed. Their outside sitting is very popular. The inside has plenty of room. \n\nOur first courses are the ceviche and chicken stay skewers. The satay is the best dish tonight. It herb grilled with chilies sauce and peanut glazed. The ceviche is the mahi mahi in lime juice. It just ok compare to most of Peruvian restaurant. \n\nTo night they don't have duck leg so we order two grilled Cobia fish as second course. The Cobia is grill and top with pineapple salsa and avocado purée. I like the accompanying almond rice. Is is very tasty. \n\nOur final courses are the cheesecake and the strawberry rhubarb pie. The crust of the pie is perfect. The cheesecake is most and good. \n\nOverall the service is a bit slow. The reason they have 3 stars is no stand out dish. No wow factor and some seafood chain restaurant is better than them. The menu may need to improve to attract. For the price we paid, they may not be the best choice.",
    "date": "2015-12-14 01:53:55"
  },
  {
    "review_id": "_I_oYl9lI8aQMj5cCXmZzg",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "0a9Miij7BFmKm83Iqni5sA",
    "stars": 3.0,
    "useful": 7,
    "funny": 3,
    "cool": 4,
    "text": "With all the hype, I finally make it to this place with a group of yelp friend. This is the second capital taco that is open other than the original from the Land O Lake. I am fan for the original capital taco.\n\nWe arrive one hour before it close. The capital taco has strange hour. They close at 8 pm and it is early to my standards. So far they only open 3 day a week. They are planning to open more than 3 days a week. \n\nI have order the west coast special with tiger shrimp my favorite at the original capital taco and the Johnny Reb. The shrimp is over cook. It is not bouncy. The Jonny Reb is a bit better. Somehow the food on second capital taco do not measure to their original store. \n\nOther not positive note is they got this big space. However, the seating is too less. Why they want the customer to take it to go or wait on the table since they can have more table. Since they are in the corner store why not add some out door seating. The line is also long, I would said they can take the order on the line like Chick fillets. \n\nThere are many area they can improve. I hope my next visit they can improve.",
    "date": "2015-11-25 01:28:10"
  },
  {
    "review_id": "uepEEEKyD4jDww1SHSBmnA",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "yecLfvB2rSvm0p_vkEkDsA",
    "stars": 3.0,
    "useful": 1,
    "funny": 0,
    "cool": 1,
    "text": "This place is located very remotely. It got the space it need to hold large group. The kitchen and the order center are separated. Every time they take an order they when to back room to prepare it. It leave the front counter empty. \n\nThe smoothie they prepare is a bit in the sweet side. I think may be the juice they have is sweet. Overall the wait is short. I order the pomegranate plunge. It has good taste. Love the nature drink.",
    "date": "2016-03-14 23:30:17"
  },
  {
    "review_id": "M2WKalATEG2tcLfiGpre3w",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "k5q9hgRV2MPdWQChe9NSXQ",
    "stars": 3.0,
    "useful": 7,
    "funny": 5,
    "cool": 5,
    "text": "I cannot believe I am actually writing a review for Arby's. in all goodness, I do like their new product. The new pork belly sandwich has attracted me to be here. I have pork belly sandwich at BBQ place before. I just want to see how they fare with their new sandwich. It give you 2 slide of thick pork belly, crispy onions, and smoke cheddar cheese. This combination sound very good. The pork belly was cook harmony and it go well with the crispy onions. It create crunchy taste. The sauce is good. As I did not have lunch and have the late lunch everything taste good. \n\nI was only one at three o'clock drive through. After paying, it still need to wait for 3 minutes to cook. The drive through lane need to be reconstructed in this location. A lot pot holes that cumulate the dirty water. May be make it more desirable for the drive through experience.",
    "date": "2016-10-23 20:01:22"
  },
  {
    "review_id": "k0ZnQvb4LJ99T4__z5PXEA",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "eHcaicXwRk58wUvsmlm_dg",
    "stars": 3.0,
    "useful": 1,
    "funny": 1,
    "cool": 1,
    "text": "Great drive through. The wait is good but sometime they have hang out with customer and delay the deliver time for the drive through. I like to get the dollar menu during the happy hour time 2-5 pm. I have the Baja freeze and the spicy chicken crunch. The food is good for afternoon snack.\n\nTry their cinnamon ball. Sweet Cream inside",
    "date": "2015-01-03 19:59:20"
  },
  {
    "review_id": "2gCQUk-Mr0K_qb99yYqmig",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "q5hWyVx2NfaqDWvdlLTG8g",
    "stars": 3.0,
    "useful": 11,
    "funny": 2,
    "cool": 6,
    "text": "There are not many Boston Market Chicken in Tampa. This location may only one in Temple Terrace. I like the one in New Tampa and decided to try it on this location. \n\nI think the rotisserie chicken may need some work. The marinated spice did not go enough to the bone. It is important to get the marinated spice into the meat. The other things is the chicken need to grilled a bit more to crispy the skin.  It is the crispy and tasty skin that make the name of the Boston Market. One thing they done very well is the maintenance of juicy meat. This may be due to their good technique. \n\nI have the three pieces dark meat which is good enough for a meal. It come with two sides of your choice. I had the sweet potatoes yum and the mixed sautéed veggies. This is a good choice. Overall my experience is good.",
    "date": "2018-05-04 01:54:18"
  },
  {
    "review_id": "horA1Bb3ACGaKCoy2pVJKg",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "mY4i1N0Hm2fjIgU0Eyn11Q",
    "stars": 3.0,
    "useful": 9,
    "funny": 4,
    "cool": 6,
    "text": "The Greek goddess always have good healthy food. This Acropolis has been here for long time. But I was surprised to see a slow Friday lunch crowd. I have been to this place on weekday and they have more crowd. \n\nWe were early at 11:30 am. I have order blacken salmon salad special of the day and my wife got the grilled chicken wrap. It take more than the normal air time for the food to come out. The salmon was grilled to perfect but the blacken can be better. I like the salad dressing. The potatoes salad on top of the salad is creative. The grilled chicken can improve a bit better by marinated over night to enhance the flavor and add some salt. \n\nThe decorations of the restaurant is contemporary. However, the booth seat need a new leather refurbished. Service is slow.",
    "date": "2017-07-26 03:18:34"
  },
  {
    "review_id": "_Iujmm4CKG6vgg-oDUk_qg",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "E_gs5LBMr7SlNDbbq4_05Q",
    "stars": 3.0,
    "useful": 10,
    "funny": 4,
    "cool": 9,
    "text": "I always like Popeyes fried chicken. When first landed in this country, the place I went for college is Louisiana. That time I am not use to burger for my oriental taste. But Popeyes fried chicken is well accepted by my taste. Especially those spicy fried chicken.\n\nI got the spicy chicken strip combo with popcorn shrimp. I like them spicy. The chicken strips are very nice and bread coated. The popcorn shrimp is just so so. I went with the combo. My order is close to nine pm. They already not brew any sweet tea. This store is a bit lazy not accommodate the customers need. I have if they have some on the drive through. They also out of sweet tea. \n\nA southern food cannot provide sweet tea is not quite accommodating. Not wonder the rating is not high. Many of the waitresses know what I need but walk away from my request. I have been to some other Popeyes and they're not like that.",
    "date": "2018-04-26 04:09:49"
  },
  {
    "review_id": "SBrzZBBLKvcZYJ2QImgF5Q",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "BY-du320SIHBR9MYUrZSZg",
    "stars": 3.0,
    "useful": 10,
    "funny": 2,
    "cool": 7,
    "text": "Keegan have been show on food network when Guy featured in one of his episodes. They have some item that Guy want to try. If you visit their restaurants, there is Guy signature poster in the restaurant. \n\nThe famous dishes include blackened grouper sandwich and charbroiled octopus. This two dishes are the best of the restaurants. I have ordered this two dishes to try. The blackened grouper come with mango chutney. The blackened is one of the kind. It is southern style spice. I like that better. The fish is in good portion.\n\nThe normal charbroiled octopus is about two tentacles. They give you 4 tentacles. The chargrilled is good but need to perfect it. The marinated spice is perfect but the grill technique need improvement to seal the tentacles juice. \n\nThe services are good. I like food. They have good quantities.",
    "date": "2018-07-25 03:02:34"
  },
  {
    "review_id": "2fg73tu_A_5tJ8aw3Elhvw",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "dklubxj6cBzMi7mY2Qes1g",
    "stars": 3.0,
    "useful": 17,
    "funny": 2,
    "cool": 12,
    "text": "One of the few oriental grocery that open during pandemic. Mainly Vietnamese customers are visiting this store. Most food are also gear for Vietnamese food. The store is kind of strange. It link to jewelry store next door. \n\nThe items are not as complete compare to larger grocery store. But is it convenient for the local to pick up item they need. Aisle is a bit narrow to save space for more good to display. The munchies aisle is limited. I could not find the items I like. \n\nSelection of item is good enough for you to cook a meal.",
    "date": "2020-05-16 11:14:32"
  },
  {
    "review_id": "o7Gru4Qx8Mky9LQ2GiAGiA",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "KX4MseOnBKE3pSsJjXHd-w",
    "stars": 3.0,
    "useful": 12,
    "funny": 4,
    "cool": 6,
    "text": "I have been to many burger join, the smashburger is the first. I was excited to try out some new burger. They carry burger, chicken, salad and shake. Very simple menu. They have options to order online and they also have options to create your own sandwich. \n\nI got the Swiss Truffle Mushroom. The burger is juicy and seem like cook with butter. It is definitely moist and great mushroom cream sauce. The charge above $7 a burger. Pricy. The bun and burger is tinny. It is like burger junior. For the price, I may not want this burger. \n\nThe open late till 10 pm. Not many customers during that time. I only have wait 5 minutes for them to cook. The meal is add additional 5 bucks. I decided not to. The whole combo may be difficult to attract customers. But their side is good choice. It include grilled Brussels sprouts.",
    "date": "2018-03-31 16:57:41"
  },
  {
    "review_id": "EytKEoxJtCP-260tHKi_NQ",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "3XDHJmmBZ6TaqHTykXG7pw",
    "stars": 3.0,
    "useful": 17,
    "funny": 6,
    "cool": 12,
    "text": "I would said this restaurant is in the middle of the pack. May be their high star rating is due to the local favorite. The restaurant is located on the corner of the plaza. It also serves sushi. They no longer take yelp 15% off coupon. \n\nWe started with the Tom yum chicken soup. It has some flavor of Thai but not strong enough. Soup a bit salty. We have the chicken satay appetizer. I think this is their best dish. The entree we have pad Thai. I think they can do a better job on this one. The peanut sauce is not a lot. The noodle is ok. We also got the drunken noodle that not in the menu. But I am disappointed for not spicy enough when I have order the Thai hot. Second, they noodle in the wok seem like just a small BTU technique which I can do it at home. If I order this in restaurant, I expect high BTU wok with burn oil cooking. I cannot find it here. The last dish is the duck basil. The duck is filet. The dish is sweet. I would said is a ok dish. \n\nOverall my experience is average. The dishes are  too Americanize. They need to paid attention to customers requests of how spicy the dish. Chef technique need to improve. I would said is take out quality.",
    "date": "2020-04-13 21:06:05"
  },
  {
    "review_id": "YySvknAcfeDjisFtcCp9zg",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "EwEwG4vFa8TIeUGmNJSzKA",
    "stars": 3.0,
    "useful": 13,
    "funny": 4,
    "cool": 9,
    "text": "Oh well, this is average among the restaurant over here. Marrow do have some Americans cuisine. However, what I take for this restaurant may not measure to the value you paid while other restaurant may be do better than them. \n\nWe were here to try their food first time. We have the Tavern 'slammin' steak sandwich. With upgrade side to grilled asparagus it is close to $20 dish. I expect this should be smashing dish. It turn out the meat is is just few cold cut on hot bun. I have give them with nice skirt steak. But it is cold cut. The upgrade asparagus only come in 4 strings. \n\nThe second dish is better. The chicken stack. It is grilled. Also about same price I have for steak sandwich. In compare to near by restaurant, I think the nearby restaurant may be better. I know the competition is tough. But I think they can do better. \n\nOur service is good. Just some time they waitress not paid the highest attention to our table during meal. But when get paid, it was quick.",
    "date": "2019-06-26 23:33:54"
  },
  {
    "review_id": "ZO31JVoEE5uI8IkkhYpHwQ",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "GfRhcofYZGPP4iRXe-Vw8w",
    "stars": 3.0,
    "useful": 13,
    "funny": 3,
    "cool": 10,
    "text": "If you come drink is good. If you come for food, this may not a good choice. World of beer surprise me that they serve food. However, the food come out of the kitchen is too slow. Menu do not have good choices. \n\nI got one of the special mojito. But I feel the cocktail is too light on the alcohol percentage. The drink feel like soft drink. Unless you go with their draft beer or bottle beer. Other than that, I not recommend their cocktails. \n\nWe order three tacos for snacks, it take 30 minutes to come out. I think this area need big improvement. The shrimp taco save them one stars. If not it is 2.5 stars.",
    "date": "2020-08-28 01:17:25"
  },
  {
    "review_id": "vfqYpwMM1ETgUgZObToU0w",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "H0unmI-lJTazbPh-Lt6lBQ",
    "stars": 3.0,
    "useful": 20,
    "funny": 5,
    "cool": 18,
    "text": "This Kung Fu tea is in the middle of the pack. We got the coffee slush with boba and the winter melon milk tea. I agree with Vivian that they need to improve the mixologist of the tea. Somehow it do not have the taste of harmony. The ingredients is good. The honey boba is still very good. But the the tea bitterness need to tone down. Caffeine is well maintained but the the tea bitterness somehow need to reduce. Milk is a bit heavy compare to many milk tea I have tasted. \n\nThis restaurant has token ramen section. We did not try their food this time. But will plan next visit to try their hot food. I like the open kitchen with glass wall allow the customers see their food preparation. It has increased the interest of the food.",
    "date": "2020-07-13 22:02:56"
  }
]