[
  {
    "review_id": "afCY9M_8rGsVO0f18wWr-A",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "_HcAoG6Jj_XTj4-XNEbo6Q",
    "stars": 1.0,
    "useful": 12,
    "funny": 2,
    "cool": 6,
    "text": "Many can go wrong with technology that sum the restaurant problem. \n\nLike - I like restaurant has opening look. Good wall art. Nice party look of the bar area. Seem like everyone have a good time. \n\nBad - Service less restaurant. The order is made at the counter. An electronic buzzer is issued to let you know your food is ready. Then you pick up the food your self. Yes it save a lot of money to hire service people. Is you food cheaper? No. \n\nI have order to go and issue a buzzer. When I pick up the food, there is brown bag of your food is ready. I ask is this buzzer 18. The service people in the kitchen said yes. I took it home and they are not my order. Do I drive back round trip 18 miles for exchange. Probably not. I eat what is in the bag. And it is bean with ground beef burrito. The bean and ground beef below average. It is bad that I not even want to post the picture of the food. With food order wrong, now they have two not happy customers. Customer that have the wrong order and customer did not have the food. \n\nBelow can be improved. Put some service waitress. 1. Do not have the customers to pick up the food themselves at the counter. I cannot tell how many other customers has touch my food. This is not professional. Please hand the right order to the right person. 2. Put identification on the brown bag since each order look alike. Identify the right order staple with order ticket. 3. Train the kitchen people with proper order is make.  \n\nToo confusing. Burrito is below average",
    "date": "2017-04-23 22:38:18"
  },
  {
    "review_id": "3A8nh5FVt97JmfatMUszAQ",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "qW9npNox-AJ0jFfhfJu13Q",
    "stars": 1.0,
    "useful": 3,
    "funny": 3,
    "cool": 3,
    "text": "It has been a while I actually give 1 star on the review. This is my first time here and we don't have good impression but bad experience. \n\nWe have coupon that allow us to buy one master Peanutty Swirl and get one free. We like to experience the 1960 roller skate window serving like the movie. The experience turn out not worthy for the food.\n\nWe arrive at Sonic and park on the station of order. The button has been push to call for order but no one has response. I have my engine on and they only have one car on drive thought and one car on station. I can see a lot of the sonic people in the building but none has come out to take order. We turn off the engine and waited for a while. Florida summer is hot even with the window down. We decided use the drive through. The drive through is responded faster than the station parking. We put our order with buy one gets one free. The total come to $8.98 and the discount is $3.59. We told them the incorrect total and ask why the discount is not half. The coupon clearly state BOGO buy one get one free but they only give you 40% discount. The swirl was given to us but spoon was not given to us while we were disagreed with the final total. \n\nManager came out and said this is the price. I told my wife it is not worth to argue since the gas spend on waiting for the price correction is already paid for it. Spoon was finally given to us and we drove away. \n\nIf you look at the food they are like ordinary fast food. Mc Donald has enclosed AC space and why I have to wait in hot weather and eat in my car or spent the gas money to be cool and eat in the car. Doesn't make sense. The concept may be work on 60's but not with AC generation. \n\nOverall coupon is not fully honor, not an AC dining, server stay in building cool themselves and ask the customer to wait, food is not the best or healthy in fast food, bad attitude server, wrong accounting, poor management. I am sadly given the one star.",
    "date": "2015-07-24 23:05:00"
  }
]