[
  {
    "review_id": "HapNLY5B77hFtTx-MfHW2A",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "Swjkmg5qAHT6hwXQRWQoHQ",
    "stars": 2.0,
    "useful": 18,
    "funny": 5,
    "cool": 11,
    "text": "This restaurant is evaluating for their food not their local brew beer. The two star was given due to after food experience. After dine their food I have to go to restroom several time. It take me a day to clear my stomach pain. Some of the food is not up to the quality. \n\nThe restaurant do have a lot of customers. Seem like a good joint. Especially the private local brew beer. It has the brewery just next to it with tour. I did not try it. I am straight to the restaurant. \n\nI got the blackened rock shrimp and the Belgium Blonde. I like the Belgium blonde beer. The rock shrimp dish include the spinach fettuccine, mushroom, andouille sausage, yellow bell pepper. The sauce is creamy. The rock shrimp is firm. Not sure which item did not measured up cause stomach diarrhea. May be the sauce. Anyhow my experience is not good with the food.",
    "date": "2019-10-20 19:37:56"
  },
  {
    "review_id": "4pmnTfgQSGypz99WEmhcrQ",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "DFymbOEhIpWVE_d6BnHFmw",
    "stars": 2.0,
    "useful": 12,
    "funny": 3,
    "cool": 4,
    "text": "I walk in this place try to compare with the one in Brandon. Surprisingly they were not busy at Friday night. I remember the Brandon location take about 4 months to slow down from crazy line to normal busy line. This place is not very busy at all as they told me on the phone when I call to check. The dog house is still there if you want to have the picture. \n\nWe have coupon for a free fried. I have order the half slab baby back a la carts and fried halibut. The baby back is below average. The temperature is warm and is not right. It is dinner standard compare to many wood grilled place. The halibut is definitely disappointed. The fast food fish sandwich place can do better on the crispy coating than this place. The accompanying lettuce is soggy. All food temperature is not good other the fried is right.  The food delivery is way behind schedule. Too slow at a slow day. \n\nAm I going to return. No, done from my check list. Not even the coupon can bring me back.",
    "date": "2016-10-08 07:09:21"
  },
  {
    "review_id": "_YauBBrUUlCxaZjq2eCFiw",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "9EoNx6yHsmiCe43XscJzDA",
    "stars": 2.0,
    "useful": 17,
    "funny": 2,
    "cool": 5,
    "text": "We excited for new kid in the block due to our past experience with fresh kitchen on other location. Finally there is one just close to the mall. It make the location easy before I go to the movie to fill my energy. Parking in the front is limited but there are plenty of parking space at the back. \n\nI like the theme with pink color. Pink color stand for sweet, nice, playful, cute, romantic, charming, feminine, and tenderness. This may be why they found their food. I got the six. Which mean 2 protein, 2 bases, 2 veggies. That is the biggest bowl you can get. After that just add addition. I have Ahi tuna poke, Herb grilled steak, green bean, roasted mushrooms, coconut ginger rice, sweet potatoes noodle. I have add on as pesto tomato. You think by now you have big bowl. That was not. It was not even full to the top. \n\nAfter two hours, I have to run to restroom several time. The food didn't seat well. It is just not fresh. Because this incident,  I think it will be 2 stars. In compare to other Fresh Kitchen, this location need some work.",
    "date": "2018-04-04 03:45:23"
  },
  {
    "review_id": "BENV7DLrTNbS0hwIYgFS2w",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "tyxDsvtQkTDDy-e-psidEA",
    "stars": 2.0,
    "useful": 15,
    "funny": 3,
    "cool": 6,
    "text": "I was exiting to try a Puertorican Bistro. This place is small and not much of parking space. But there is a empty lot behind the building that you can park there. The plaza parking on the side of building is limited. \n\nThe restaurant has vibrant music. The music are nice and Latin flavor. I am not sure how it work so I walk to counter order and wait for my food. I have order the roasted penil. A Puerto Rico roast pork shoulder. I waited for my food for some time and the people who order the food after me already got their food. At least three tables. Finally some come to table ask me what I have ordered. They when back to the kitchen and comeback to me said they sold all the penil and they can offer me the beef stew combination. I got that. \n\nSeem like the beef stew is over cook and when you press the meat it shatters to powder. They not the same as fresh cook beef cube. \n\nFour mistakes on this restaurant. First mistake did not have a hostess and call themselves Bistro. Second inform the customers late about run out of food. Three, no make up or complimentary item for their mistakes. Fourth is offer a dish that is not popular. Seem like the item cannot sale on the night. This is done and done restaurant.",
    "date": "2018-04-21 05:22:40"
  },
  {
    "review_id": "86i7wD2Qo1fZLhttyRaTaQ",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "3dQaEBDWOyqDYhP3-ac7NQ",
    "stars": 2.0,
    "useful": 18,
    "funny": 6,
    "cool": 7,
    "text": "We have a very off night from this place. We have a group of four went to this place for the ramen. We hope to try some of the new and hot place in town. However, we do not have the good experience tonight. \n\nWe came to this place after the museum night at downtown. We arrive at 7:20 and one of friend family just finish and they let us have the table. Thanks to him that we have no waiting on the table. We put our order in for the food and we order the sake. The sake is a good deal. We have finished our sake and the appetizer has not arrived. It took them 1.25 hour to bring out the appetizer. Before the app is out, I told my friend we should walk out if the food did not come in one hour. However, we are eager to try this restaurant food and we stay and wait for the excitement of the food. \n\nWe waited close to 1.5 hour before our ramen came. We were wonder why it take so long. The food came and I immediately disappointed what we have longing for. The ramen is sticking together and the noodle is not separated. The meat may be cook extreme long time and the meat is easily broken into powder pieces. The soup is considering average on the miso base. I have better ramen in Tampa compare to this place. I not even need to compare to the standard in Japan that I have experience. \n\nI had ramen in clear broth base, miso base, spicy base, and dry base before. The meat of other place is moist and good for the pork. The good ramen place has marinated egg in half broil. When you break the egg yolk, the yolk will spill into the broth and create another sensation. This place the yolk is complete cooked. \n\nThe output of this restaurant needs to be rethinking. In Japan, I have seen 50 bowls of ramen in 30 minutes but not in this place. I know this is art but also need to consider the wait of the customer. Lack of efficiency, technique, material. I am award 2 stars. Many rooms need improvement.",
    "date": "2015-08-08 05:28:50"
  },
  {
    "review_id": "N10SKh9QK9UhN_zQKoiYwQ",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "-_arFpHzoPHvh5p-YKw5fQ",
    "stars": 2.0,
    "useful": 18,
    "funny": 2,
    "cool": 7,
    "text": "This location is not comparable with the largo location. Every time I call, they don't have the blue crab. Somehow they need to remove from the menu. Although they don't have blue crab, I decided to paid them a visit to try other items in the menu. \n\nI order a 15 fried shrimp and scallops special. The 15 shrimp is about $10 and the scallops is $5. The wait is the main problem for this store. I was informed about 15 minutes to 20 minutes wait. It end up the wait is 35 minutes. The size of the shrimp is tiny. \n\nThe taste is not nearly good. It is about same as frozen quality from supermarket. $16 total is in the high side for take out standard. A lot of improvement can be made for this store.",
    "date": "2018-07-20 21:11:46"
  },
  {
    "review_id": "jmLgxbomCItLatTJcO9eWw",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "hrAd9yxS_hsSqeAhOBeQwQ",
    "stars": 2.0,
    "useful": 18,
    "funny": 4,
    "cool": 9,
    "text": "I don't know I come to wrong time or the clerk do not take the order seriously. The coffee we got on the 16 OZ cup with half coffee fill and the rest is whip cream. That tell you what is missing out. This is about 2.5 stars coffee joint. \n\nThis store basically is below of the apartment. Many USF students live here. The store front is visible from 42nd street. But there is no parking spot. Basically this is Neighborhood store only for the people who live there. The people who is there have their own drinks. This tell me something wrong for the customers mind set. \n\nThere many things wrong here. To correct it is difficult. Now with not attractive coffee quantity and expensive cup of joe. I would said very hard to compete at all.",
    "date": "2019-09-03 03:17:22"
  },
  {
    "review_id": "AsFXqw51K1osdRzrY2iEMQ",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "WaBJh7o0NhBe_3pioFO4mw",
    "stars": 2.0,
    "useful": 4,
    "funny": 3,
    "cool": 3,
    "text": "This fast food chain is as it advertise star rating. Below average. I believe they don't know how to improve themselves. \n\nBelow are the suggest improvement. \n\n1. Improve the response time to order at the drive through. The wait is too long for the drive through. \n\n2. Improve the drive in condition. Be ready to come out to make the order. \n\n3. The boneless wing is chicken breast. Don't like too much batter.\n\n4. Improve staff training. If the customer pull to the window to paid, be ready to accept. \n\nI not sure they will be able to improve since this issue has been long time base on past review from other yelper who comments on this store.",
    "date": "2016-05-06 03:56:00"
  },
  {
    "review_id": "Fl0AW2t0YGerqYrFp8r_LA",
    "user_id": "fr1Hz2acAb3OaL3l6DyKNg",
    "business_id": "PQYuPr2Dfm2S49EULjl1qw",
    "stars": 2.0,
    "useful": 3,
    "funny": 1,
    "cool": 1,
    "text": "Today the YBOR City have the 3rd annual snow parrade. We decided for dinner before the parade. \n\nThis restaurant is kind of away from the center attraction of the YBOR. It located at the 5th Ave and 17th Street. Two Avenue from central YBOR. \n\nThis is Argentina restaurant. They must have done their churrasco correctly. I have order a  baby churrasco and my wife have Mar Y Tierra (surf and turf). While we waiting for the food, we can see across building with the kitchen that pounding the steak. \n\nMar Y Tierra came with three grill shrimp, grill skirt steak low grade with a lot of tender. It also  has side rice and side salad. The shrimp is marinated and grill with perfection. The skirt steak also marinate and grill. This dish is yummy for the shrimp and the steak is tasty. No complain for the price of this dish $18. \n\nThe baby churrasco is 8 oz compare to the full churrasco 22oz. The price different is $10. Since I just want to taste the strip cut of the churrasco, I order a baby. When the steak came out, it is a whole piece like my wife dish not like the strip size cut. This is incorrect. It have a lot tendon. I did not say anything because I think this may be the way they have prepare it. So I have finish it. Then my neighbor table order the full portion and I can see there is different of the meat - strip size churrasco not like the flat piece. The correct churrasco should a strip cut no tendon. They should not use the word \"churrasco\" if they not serve you the Falda cut in Spanish. I am agree the seasoning for the taste is there but the meat material quality is not there. Argentine should know their meat. \n\nThe other thing is the waiter did not ask me how is my steak to be prepared and they came out well done. It was too late to change. The waiter also not attentive. My glass of the water was empty for long time and not come to refill. This restaurant waiter need to be trained. \n\nWith the above experience, I have to give them 2 star.",
    "date": "2014-12-14 02:54:57"
  }
]