[
  {
    "review_id": "2TkbkL_k_9pdKbtsFeVpXA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "TyOe_EcbyAWMmPgg_ILwHQ",
    "stars": 1.0,
    "useful": 5,
    "funny": 0,
    "cool": 0,
    "text": "So upset I do not know where to begin.\nI will call the store later today and try to get my issues resolved, but basically they wanted to do $1300 - $1400 worth of (according to my dealer) un-needed repairs and they did a shoddy job on my oil change.\n\nI would up paying for a 2nd oil change and a completely different roster of repairs at the dealership.\n\nI am very hesitant to ever come back here.",
    "date": "2015-07-17 12:08:30"
  },
  {
    "review_id": "ggPsIMxe7MoDBAvLogBqrQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "BJnnPDTZXsyXou42HnHfHA",
    "stars": 1.0,
    "useful": 7,
    "funny": 4,
    "cool": 4,
    "text": "OK, This review is based on my U-haul rental in February...\n\nwait for it...\n1993.\n\nI was a student at Penn and moved out (one way) to San Francisco.  (Wow - I can't believe I came back!)\n\nThe entire experience was a miserable wreck - literally and firguatively.\nThe truck was filthy and had a governor (speed max) on it so we could not go above 55 - which on cross-country 60 mph roads (where most travel at 70-80) was downright dangerous.\n\nNEVER AGAIN!",
    "date": "2008-08-20 20:22:39"
  },
  {
    "review_id": "JXHg5Mh6NFPwnlzjGb5_gQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "L3V21nAe-CicW2bvtNWa0g",
    "stars": 1.0,
    "useful": 6,
    "funny": 4,
    "cool": 1,
    "text": "I received a flaming email from someone at this restaurant immediately after I posted my review.\n\nMy review stands and I stand by what I experienced.  I had a horrible time at Mixx and now, after being harassed online there is no way i will ever return here.",
    "date": "2012-03-02 18:52:38"
  },
  {
    "review_id": "E4cnkvkd9PlQHNra4_FO8Q",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "OEzYP44ER97a1hi4LgR6bA",
    "stars": 1.0,
    "useful": 5,
    "funny": 2,
    "cool": 0,
    "text": "Nope.\nAfter I wrote my last (negative) review of my once-loved Qdoba, we went again.\nI needed a catering size Pico and a catering size Guac and chips.\n\nEvery time I do this (and I have now done it 3 times) I get charged a different price.\nThis time the manager (who was running the register also) tried to charged me $8 for a catering size bag of chips (enormous) which is not what I wanted or needed.\n\nI forked over the $10, took my guac, pico and chips and left.\n\nNot happy.\n\nTwice in a row now.\n\nNot coming back.\nSo sad. My 12 year old loves it here and I used to like it, too, but no longer.",
    "date": "2017-07-03 12:21:31"
  },
  {
    "review_id": "N43E2uhBfwl8MvwebPm6iQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "tJPaPZwRqFmDSEc8VEx9hA",
    "stars": 1.0,
    "useful": 1,
    "funny": 0,
    "cool": 1,
    "text": "My bad.  My mistake.  I shoulda known better.\nI stopped in for a \"squagel\" (whole grain with cream cheese).\nI was given a number (73) and told to wait.\nI waited about 3-4 minutes.\nNot worth it.\n\nSat like LEAD inside my stomach.\n\nI did it before a few years ago, and I guess I forgot.\nNow I remember.\n\nI will not be back to Cosi.",
    "date": "2012-07-23 12:52:32"
  },
  {
    "review_id": "ih2j0fs50AkfqPGXmmryHg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "L3V21nAe-CicW2bvtNWa0g",
    "stars": 1.0,
    "useful": 6,
    "funny": 4,
    "cool": 0,
    "text": "Just had an amazingly AWFUL experience at Mixx.\nIt was about 7 PM on a Friday night - but the place was slow (about 3 tables occupied).\n\nI ordered the sushi/sashimi combo.\nWhen it arrived (After the iceberg lettuce salad) the \"white tuna\" (likely escolar - certainly not albacore) sashimi tasted fishy.\n\nThe server had it replaced with yellowtail - which was good.\n\nThen I tried the tuna, snapper and salmon.\nAll were cut poorly and less-than-fresh (not spoiled but certainly not prime).\n\nI ate only the sushi and left most of the sashimi behind.\nWhat happened next was really weird.\n\nThe $23 platter came to $24 and change - so I looked for cash and decided to leave a horrible tip.\n\nI left $26 and proceeded to leave the restaurant.  Then a lady came out (not my server) and chased me down to give me my \"change\".  I said (over my shoulder(, \"No, it's for him\".\n\nShe thrust the change at me and said \"No!\" \"I'm not a beggar.\"\n\nShe was really pissed off at my horrible tip.\n\nOh well.\n\nThere is no way in hell I will return here.\n\nThere's a reason most of the maki is covered in mayo, spicy sauce or crunch.  You can tell the quality of a place by its sashimi - and this place is sub-par.",
    "date": "2011-09-02 23:43:05"
  },
  {
    "review_id": "wmJBnUv_fIp47ZifKv8sjg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "OEzYP44ER97a1hi4LgR6bA",
    "stars": 1.0,
    "useful": 5,
    "funny": 2,
    "cool": 1,
    "text": "Do not get the \"new\" Shrimp!  Ick!!!\n\nWe came in at a time when almost every item on the hot bar was running low.  I tried the Surf & Turf bowl for the first time the the shrimp were old and rubbery.  There was hardly any steak left so the lady scraped out the \"required\" amount of dried out beef cubes.  The black beans were also old but then they brought more and she plopped a scoop of \"new\" beans over the dried out old ones.  I thought about asking her to re-make the dish but did not.  I should have!  \n\nAwful!!!!  \nWaste of $8.40 plus tax.  Cold items (Salsa, etc. were fine).\n\nSo sad because I often really enjoy Qdoba - for those fast food times in my life.",
    "date": "2017-06-16 11:24:27"
  },
  {
    "review_id": "cYqchtdyLTeW5Jo_dwUGYQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "Y5PhEJ4pZ2Pp6LMa_lLe1Q",
    "stars": 1.0,
    "useful": 10,
    "funny": 4,
    "cool": 3,
    "text": "On its literal last legs - everything is in disrepair/neglect due to the impending closure.\n\nGood news?  Cheap ticket prices and no crowds.\nBad news?  Don't eat any of the stale old food and do not use the rest room if you can avoid it.  Ick!\n\nIt's like viewing a movie in an abandoned, decaying theater.  Sad, sad, sad.\nDepressing.",
    "date": "2018-11-27 20:23:53"
  },
  {
    "review_id": "j9oQhtc7JLTOnIFlUUWz1g",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "kgMEBZG6rjkGeFzPaIM4MQ",
    "stars": 1.0,
    "useful": 3,
    "funny": 5,
    "cool": 4,
    "text": "I loathe McDonald's and fast food in general, but I did go here once out of sheer desparation, hunger and broke-ass-ed-ness.  I got a $1.00 McChicken Sandwich, no pickles - It came to $1.07 and I just barely had the change scraped together.\n\nWhat a humbling experience.\n\nI pray it won't happen again.",
    "date": "2009-01-02 14:38:52"
  },
  {
    "review_id": "HpnmwrQ_ylFec-IyRWfbEw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "lAni_2IBdJOUMGXYXSmU2g",
    "stars": 1.0,
    "useful": 2,
    "funny": 2,
    "cool": 1,
    "text": "OK, as many of you know I loathe chain restaurants, but I tried (I really did) to keep an open mind when a colleague of mine - who likes it here - wanted to have lunch here.  (She also graciously paid for lunch - and she is a good friend.)\n\nAfter our server took our orders she quickly brought drinks and water.  The Philly-tap water tasted just awful.  So I drank my diet coke and kept quiet.  (I am a big water drinker and had a bottle of brita-ized water with me.)\n\nWe passed on the 2 for 20 deal and both got salads. I had the Shrimp/Avocado salad and the salad, was really not good.  Strangely enough the lettuce was just fine, but the shrimp were so oversalted/seasoned.  Also the avocado had obviously been chunked much earlier in the day as it was brown and slightly dried out.  Eew.\n\nAnd thank god I got the gloppy green avo-based dressing on the side.  It was awful.\n\nThus, my faith in Applebee's has yet to be restored.\nNext time I'll go to Shiroi Hana across the street.  What possesed me?  Oh yeah - a colleague wanted to come here.",
    "date": "2009-08-12 11:28:27"
  },
  {
    "review_id": "A_zgc4P1syeinBNo8XhuVA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "IF8dc3xSgF_mLDq-bnhOlQ",
    "stars": 1.0,
    "useful": 1,
    "funny": 0,
    "cool": 0,
    "text": "We were here for a corporate event and the place really needs some SERIOUS help.\n\nDisgusting public restrooms.\nShabby, dated ballrooms.\nMediocre service.\n\nI bet it was the cheapest place the group could find - so that's why they chose it.\n\nNOT recommended.",
    "date": "2012-04-02 12:50:27"
  },
  {
    "review_id": "lIHNluuf9V9-4qJgD3UUOg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "UBj0aJ6FfMR4tdvRbQ3KSA",
    "stars": 1.0,
    "useful": 5,
    "funny": 2,
    "cool": 2,
    "text": "ZERO Stars for what we referred to as McDEATH when i was a grad student at Penn.  There have been shootings, stabbiong, roberroes and muggings here over the many years.\n\nYet somehow - McDeath remains open.\n\nLet's not even talk about the \"hood\" demographic servers and patrons alike.\n\nAnd of course the scads of loiterers and homeless, down & out West Philly types.\n\nAVOID.  AVOID.",
    "date": "2009-01-02 14:41:27"
  },
  {
    "review_id": "Gm3-WHIVNWKceqN0ltsJ4Q",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "VwZSZY0ytmcPez5tlfXG8g",
    "stars": 1.0,
    "useful": 4,
    "funny": 6,
    "cool": 1,
    "text": "I was dragged here by 2 coworkers who actually LIKE it here - I think because it is very cheap - $4.50 - $5 for a personal pan pizza at lunch - and quick.  I have never been a pizza hut person and have not eaten Pizza Hut food at all in the past few years - except for once when My (then) 9 year old demanded it.\n\nBlargh.\n\nFirst of all the service is non-existent - Gail tried her best but even with only 2 dine-in tables everything from ordering to serving food to especially getting our credit cards back was painfully awkward and slow.  Gail is a sweetheart - and has good taste in 70's music (which, by the way, was blaringly loud - not at all \"background\" music) but she can't handle the lunch crowd all by herself.\n\nThe toothless guy making the pizzas was also pleasant but left to fend for himself.\n\nNot a fan.\nAnd I will only go back when dragged back.\n\nThe good part?  Super cheap - even with tip.\nThe bad part?  A greasy, salty MESS of a pizza.  \n\nMaybe I could attempt wings next time?\nI am frightened.",
    "date": "2017-08-03 19:29:16"
  },
  {
    "review_id": "MbuQVQW7SJ6zcU1-mGFFdA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "b4yoyv8ZwxIILxRz0GRMzA",
    "stars": 1.0,
    "useful": 3,
    "funny": 0,
    "cool": 0,
    "text": "They closed.  I knew it was only a matter of time.",
    "date": "2009-09-07 22:24:27"
  },
  {
    "review_id": "XzvXjSBlyJbgkvV2ZSlTuA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "OmZZS72yQcPyqEDPCA3EVA",
    "stars": 1.0,
    "useful": 3,
    "funny": 0,
    "cool": 1,
    "text": "Pretty awful.\nI have tried it twice - once back in abour 2008 when I worked nearby and got overly doughy steamed dumplings for takeout (filled with a greasy mystery meat).  YUCK.\n\nAside from the grotty digs and crappy location - next to the XXX rated theatre, I ventured in again.  And I will never do this again.\n\nI played it \"safe\" with chicken and brocolli.\nI have had better food from a cart.\n\nNever again!",
    "date": "2012-04-17 13:22:36"
  },
  {
    "review_id": "J2EveLmtQ9Z5AsdKoNb1aQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "9Mm9xvLfiI72E3Inhmn82g",
    "stars": 1.0,
    "useful": 0,
    "funny": 1,
    "cool": 0,
    "text": "Oh lawd!  I just ate the most horrifc lunch at E & C.  A meatloaf sandwich - wherein the meatloaf contained multiple bone fragments.\n\nSooooooo disgusting,\n\nFortunately they took it off the bill.\n\nI used to tolerate E & C - I will now NEVER go back on my own accord.  (Alas, some co-workers insist on dragging me here.)\n\nBLECH!",
    "date": "2009-02-06 19:27:04"
  },
  {
    "review_id": "bP794IDxDu7DBugOtjKnHw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "xrUtLEFyxzfjflTC2nqLXQ",
    "stars": 1.0,
    "useful": 8,
    "funny": 2,
    "cool": 0,
    "text": "Epic fail.\nI should have known better after my kinda-sorta-bad experience the first time.\n\nI stopped by to pick up a toasted english muffin.\nI saw a sign for grits - $1.99.  So I ordered that too.\n\nThe lady scooped and scraped the grits from the bottom of the steam-pan and then shouted, \"Guys, we're gonna need more grits!\".\nBut she had enough for my order.\nWhen I ate it back at my office the grits were so salty I literally spit out the first bite and trashed it.\n\nMeanwhile, the english muffin was barely toasted and flabby.\n\nI called them - and they have agreed to refund my $1.99 when I stop in tomorrow - but that will be the last time I come here.\n\nSo disappointing.  Many of my colleagues come here every day and love it - but they are now 2 for 2 in the \"bad\" category with me.",
    "date": "2013-02-07 12:55:59"
  },
  {
    "review_id": "7AQgeAto2udx-pLJyn95RA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "KdQmzwomvjLiMzD4UnLzBA",
    "stars": 1.0,
    "useful": 2,
    "funny": 4,
    "cool": 0,
    "text": "You're kidding?\nBased on grungy digs alone my family (of 3) walked in and out.\n\nThis is clearly a take-out only place (a few card tables and zero atmosphere for dining in.)\n\nThe sushi case was empty.\nEmpty.\n\nThere is no way I would get sushi here.\nI am reticent to even try the Chinese food.\n\nMaybe it is, \"all that\".\nBut I was scared to even go there.",
    "date": "2012-05-23 14:57:46"
  },
  {
    "review_id": "cNHWir_WEHlS47uCDF2P3A",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "zbd07p4LWd6ty5mHA2F1cg",
    "stars": 1.0,
    "useful": 6,
    "funny": 1,
    "cool": 2,
    "text": "Dayum!  I wish I had read my old reviews.  I got the schwarma - again pre-cut meat (at lunch - 11:50 AM) and bone-dry and COLD.  So I had a salad with cold, dry meat on top and threw away most of the meat.  Just icky.\n\nI added some sauces and toppings but was told hummus is $.79 extra.  What???  And the have no baba ghannoush.\n\nThere are so many fast-casual Med spots (CaVa, Naya, Naf Naf) that I will not be returning to Zaffron.\n\nJust skip this place and eat elsewhere in the Liberty Place Food Court.\nThere is a reason their line is shorter than the others.\n\nNot happy.\nNot happy at all.",
    "date": "2020-03-02 18:45:01"
  },
  {
    "review_id": "JwHJIqdAHCfaXIuQ61Bwzg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "KOPOFFBXgiNXniVxtbYglw",
    "stars": 1.0,
    "useful": 6,
    "funny": 5,
    "cool": 2,
    "text": "Sorry - but they not only followed me and my 12 year old around the store as if we were going to steal things, they then tried to overcharge my kid when she purchsed two $1 each \"crystal\" hair pins.\n\nFor the birds.\n\nNope.",
    "date": "2017-08-07 12:33:06"
  },
  {
    "review_id": "9_cuik_ZhwrIOuSrLNbEWg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "S1ItVIbwg_czRTi5c3Yx4A",
    "stars": 1.0,
    "useful": 4,
    "funny": 4,
    "cool": 5,
    "text": "OMG!!! It's awful.  Maybe I just hit 'em on a bad day/time -as it was on a weekend at about 4 PM - kinda between the lunch & dinner crowds.\n\nPlace was empty - so service was quick.  I ordered 1 item - a steak taco.\n\nThen I noticed the fruit flies.  Swarms of 'em - near the \"hot sauce\" bar area.  Ugh.\n\nAppetite destroyed.  I paid for my taco and took it to go - and ate it next door at the Dunkin' Donuts while my 4 year old stared at the donuts and decided which one she wanted.\n\nTaco?  Inedible - and the vision of those flies was dancing thru my head.\n\nChucked the taco.\n\nDon't think I'll be back.",
    "date": "2008-12-04 13:53:26"
  },
  {
    "review_id": "mJV9eIgcnK97t8s9ILo3ug",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "YKzZukCL2_ealY5An-M36w",
    "stars": 1.0,
    "useful": 2,
    "funny": 0,
    "cool": 0,
    "text": "closed.",
    "date": "2015-01-04 15:21:07"
  },
  {
    "review_id": "ymlXpvmTKrBrbWf84XGVsQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "_CbuP1zG_SqkEhVlkSIM1A",
    "stars": 1.0,
    "useful": 0,
    "funny": 0,
    "cool": 0,
    "text": "Just awful.\nThe restrooms were filthy and nearly un-usable.\n\nFood was dreck.\n\nNot goin' back.",
    "date": "2013-04-06 21:03:43"
  },
  {
    "review_id": "u_qa_aujdmXJEl7OIvrmTw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "OGWTzjVTIy5Jf3ndPO1STw",
    "stars": 1.0,
    "useful": 6,
    "funny": 0,
    "cool": 1,
    "text": "I hate to give 1 star reviews unless a place truly sucks - and this place...\nOMG it's awful.  I walked in (I was meaning to go to another place nearby but they were closed) and it was so unbearably hot in there - no A/C in July and all the refrigerators and freezer units give off additional heat)  I had to walk right back out. (After taking a good look around.  Ugh.)\n\nNot goin' back either.",
    "date": "2017-07-10 15:32:58"
  },
  {
    "review_id": "FymvFv7660_U2Py4PiFecw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "yycbLj75XdiB53VVv3PhCA",
    "stars": 1.0,
    "useful": 1,
    "funny": 0,
    "cool": 0,
    "text": "It's awful.  Sorry - it just is.  How is it that a place located RIGHT NEAR 2 great fish markets is not selling fresh fish?  It is also mega-expensive.\n\nYUCK!!!!",
    "date": "2009-03-24 19:41:37"
  },
  {
    "review_id": "k1shNGktYpVZD8zYWsm6Rg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "NaRqFZ_l3LCHnX9j2TND-Q",
    "stars": 1.0,
    "useful": 3,
    "funny": 2,
    "cool": 0,
    "text": "Awful today!!!!  Lettuce was wilted, nasty  and gross, avocados (which I paid extra for) were rotten.  I spent nearly $10 on a custom-created salad and I had to throw half of it out.\n\nI was already back at my office or else I would have brought it back to the counter.\n\nThis is the location in Liberty Place and I used to come here about 2 years ago all the time with my daughter who loved it here.\n\nI never \"loved it\" but now I shall not return for quite a long while.\n\nFOUL BALL, Saladworks!",
    "date": "2013-06-17 17:17:18"
  },
  {
    "review_id": "1mwyJTyMErnEyPgLoRjHdQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "Gr6nYrQ_-3p4LcE4M84lTw",
    "stars": 1.0,
    "useful": 4,
    "funny": 2,
    "cool": 2,
    "text": "I'm sorry - but this is just not the place for me.  \n\nAnd to say the least - NOT a place to have your firms HOLIDAY party (What are we - 11 year old boys?).  \n\nYes, really, we had our 2007 Xmas dinner here which included pitchers of soda, a mediocre hot food bar with pasta.  No desserts - they were extra.\n\nThey also gave us all token cards.  (I confess, i did play a few games of Deal or No Deal) and amid the noise and chaos, we had a scavenger hunt.  I can't even tell you what the wnners got.  I was so NOT into it.",
    "date": "2008-10-28 15:07:03"
  },
  {
    "review_id": "g_R9pJ8oNsZePwj0-jSL2w",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "5zzh_gfG7_L35dcPUHqc1g",
    "stars": 1.0,
    "useful": 11,
    "funny": 4,
    "cool": 3,
    "text": "Neither a spa, nor relaxing.\nMy daughter and her sister booked appointments for 60 minute massages and were deeply disappointed.\n\nThe male therapist (I doubt some how any of these folks are licensed), had shaky hands and was so bad my daughter's sister requested another therapist mid massage.\n\nThe other (female) therapist left a room several times to \"get things\" throughout the half-assed treatment.\n\nNo way we will ever come back here.\nYou get what you pay for - and here that's not much.",
    "date": "2017-11-26 23:00:06"
  },
  {
    "review_id": "HgjZGw-3nspfHNmPaRc6Lw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "4iu7fFErsz7LS298z4bk8g",
    "stars": 1.0,
    "useful": 11,
    "funny": 7,
    "cool": 1,
    "text": "Walked in and waited.\nAnd waited.\nAnd waited.\n\n12:30pm  on a Wednesday.  Busy dining room.\nNot a hostess in sight.\n\nGot a head nod from a busy waiter in the back but was unsure what it meant.\nWaited some more.\n\n\nWalked out.\n\nWTF???\n\nThis review is based on service.  I had no chance to be greeted, seated or \"eated\".\n\nSad.",
    "date": "2015-05-07 18:40:11"
  },
  {
    "review_id": "PoKJ1DnaVE05sV70ALFXDg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "ZijcWgADCYVwLOOGPkd3tw",
    "stars": 1.0,
    "useful": 3,
    "funny": 1,
    "cool": 1,
    "text": "Ok - I'll give it 1 star - maybe 1 and a half.\nThe staff (what staff?  One disgruntled lady at the front counter?) are inattentive, underpaid and look bored.\n\nThe prices are city prices - so I bought my much-needed box of Kleenex and got outta there.  Glad it's here, as this end of town NEEDS such services, but please - could you re-stock your shelves, lower your prices and get some people who CARE - even a tad bit - in there to work?\n\nRant over.",
    "date": "2009-02-19 19:15:18"
  },
  {
    "review_id": "oNnfJjAuLlAQV5HCo6L5rA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "vlOI4udD95JUGlmA7a6iqA",
    "stars": 1.0,
    "useful": 6,
    "funny": 0,
    "cool": 1,
    "text": "So disappointed and a I fall for it time and time again.\nWell, this is the LAST time.\n\nI came here when Comcast Center first opened and it was more like a 3 star place.\nThis last time?  The tuna was NOT fresh, slices of fish were puny-small and thin, rice was dry and overly vinegary.\n\nJust Plain Bad.\n\nOh - and it was $11.95 (plus tax) for a 4 piece nigiri and 4 pieces of a (gross) salmon avocado roll.\n\nThat's that.\nI am through here.\n\nSook Hee's, here I come.",
    "date": "2013-01-30 18:04:39"
  },
  {
    "review_id": "sgk0GiS69g0iPok7qNkj-g",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "aKNrCfmR0bgdXzYcviL1ZA",
    "stars": 1.0,
    "useful": 4,
    "funny": 4,
    "cool": 1,
    "text": "UGH!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n\nIf I could give them Zero stars, I would.  We just got back from dinner with our 5 year old daughter who really, really, really wanted to go to a Burger King so that she could get the \"Cats & Dogs\" Plastic toys they are promoting on TV with their kids meals.\n\nWe obliged her - and I figured that even though I loathe fast food, I'd get a side salad or something.\n\nWell, when we arrived I insisted that DD & I go to the ladies room to wash hands.  The bathroom was soooooooo disgusting (seriously, it made Penn Stations Bathroom in NYC look clean.) that I immediately attempted to tell someone.\n\nThat's where the real fun began...\n\nMy kind & patient husband was waiting in the order line and for us to come out of the bathroom.  (When we first arrive there was noone in the line - and the dining room was nearly empty - Monday night around 7 PM)  So buy now there are 2 people in front of us.  One guy gets his order fulfilled and leaves.  The next guy is having a problem swiping his credit card.  It won't take.\n\nSo we wait.  And wait.  And wait.\n\nWe placate DD with a Burger King crown.  And we wait.\n\nMeanwhile 2 BK staffers are dealing with credit card man and another slack-jawed employee (in front of the fry machine) stands there looking on.\n\nNoone takes our order.\n\nFinally...\n\nThe guy comes over to take our order.  I tell him about the ladies room (We'll fix it, he says - and to their credit they did.)m he takes our order and we sit down.\n\nDid you know that BK offers Kraft mac 'n cheese as a kids meal choice?  Well they do - and DD got the last order of the day.\n\nAnyhow, may $1.00 dollar menu side salad (which was loaded with fake-cheese-topping - eew) was barely edible.\n\nI watched kiddo eat the mac 'n cheese.  Drink her apple juice box, dip 3 fries in ketchup and play with the prized \"Cats 'n Dogs\" toys.\n\nAye yi yi.\n\nMama needs a cocktail\nAnd some real food...",
    "date": "2010-08-03 00:06:22"
  },
  {
    "review_id": "29664hibx3ZMXK3PMyYfag",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "MUYjCWUYgEBAXyI8MZhUww",
    "stars": 1.0,
    "useful": 2,
    "funny": 1,
    "cool": 1,
    "text": "Nope.  Even thought they renovated (again?) recently and put in a new loveseat and chairs (6 pedi thrones in the back), the techs here really don't care.\n\nI stopped in on a Saturday Morning  - 3 techs all busy and one lady ahead of me - and elected to wait for my $10 toe polish change.  After over 30 minutes (Now there are 5 people waiting - me, the lady ahead of me and 3 more walk-ins) I get in the pedi chair.\n\nAnd wait.\n\nAnd wait some more (Not soaking, mind you - as this is a polish change.).\n\nFinally the lady comes over - speaks little english and barely acknowledges my presence - and proceeds to re-load her pre-paid cell phone (in one ear/hand) while removing my polish with the other hand.\n\nRush job.\nUncaring staff.\nNot worth it.\n\nNever coming back.",
    "date": "2013-10-07 12:37:21"
  },
  {
    "review_id": "hNUAKB8M021vIoHBDorSfw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "YDRFEj2R9Ua-c0j46HCTPQ",
    "stars": 1.0,
    "useful": 5,
    "funny": 3,
    "cool": 0,
    "text": "I'm sorry.  I am a product junkie and I am just Sooooooo turned off by this location of Lush.  \n\nThe staff are very pushy - maybe because of the economy and sales are low?  Not sure - but they follwed me around as if I were a shoplifting suspect.\n\nThe manager was kinda snippy when I asked if they were hiring and gave me a business card and snapped \"apply online\" or something of that ilk.\n\nThe \"Big Shampoo\" is a decent product and the bath bombs are fun, but I can get them elsewhere.\n\nThis store needs a makeover!  Pronto.",
    "date": "2009-03-30 20:43:31"
  },
  {
    "review_id": "c0Ubi7pWco7nw8snxw4NUw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "MUYjCWUYgEBAXyI8MZhUww",
    "stars": 1.0,
    "useful": 3,
    "funny": 2,
    "cool": 1,
    "text": "Ook!  I call this place Sh**y Nails.\nI came here about 2 years ago while still on the search for Philly's bext pedicure.  (The search continues but Salon Royale Court and Mint Julip are contenders.)\n\nI requested a parafin dip - but when  saw the FILTHY parffin tub (grey bits of crud at the bottom.) I refused to have it - and left before I even had a service.\n\nYUCK!!!!\n\nThis place is not clean.  Don't go here.  I can not speak for the many other businesses called \"City Nails\".",
    "date": "2008-07-16 16:49:27"
  },
  {
    "review_id": "WnuMTgobYKs-QqHmB-V3dA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "uKKRHbXXAIuGxOxs9miwOg",
    "stars": 1.0,
    "useful": 5,
    "funny": 5,
    "cool": 3,
    "text": "Just as my prior review of the Bala Cynwyd OG - but only 1 satr because the Center City location is FILTHY!!!!!  (Bathrooms, bar area, floors) and the dis-enchanted under-educated staff is abysmal! (Sp??)\n\nOlive Garden is Faux-talian-American and is really not that great.\nMy inlaws insist on going to chain restaurants like this, Buca di Beppo, Romano's Macaroni' Grill (how the heck do you grill Macaroni??) and other sub-par poser-Talian chains.\n\nMeanwhile, my 3 year old loves it here - so there's no accounting for taste.\nAnd it used to be cheap - but no longer.  I had a so-so shrimp scampi (angel hair here is a definite AVOID - ads it is always overcooked and mushy.) and it was $16.95.\n\nThe unlimited iceberg & white-bread (Oh, sorry, I meant salad & grease-sticks) are a big turn on to college kids and cheap in-laws alike.\n\nFor my time & money - there are FAR better places to go (even in the spectra of Faux-talian chains.) [See my review of Bensi's]",
    "date": "2008-08-12 15:23:05"
  },
  {
    "review_id": "s-pXKViF9m0aaWQL7Xql5Q",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "urXE9YSeQpOv16kjDu6CHg",
    "stars": 1.0,
    "useful": 1,
    "funny": 2,
    "cool": 1,
    "text": "Eew!  Taco Hell in 30th Street Station. Combined with a stripped down pizza hut.\n\nI'd rather go hungry.",
    "date": "2010-09-30 17:31:24"
  },
  {
    "review_id": "rAiJUxJPtMMxibmFV2qcow",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "UrzVmRtI0MBO2sQC_WdD4A",
    "stars": 1.0,
    "useful": 5,
    "funny": 4,
    "cool": 2,
    "text": "During rush hour? Fuggetaboutit!  I agree with Steven B. below about all the gas wasted - and this happens every day!\n\nIt's a necessary evil when I have to get to Philly from where I currently work, but I avoid it whenever possible.",
    "date": "2014-06-23 17:05:07"
  },
  {
    "review_id": "qobqOjZU8LNqzqBvG-D-Fw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "BKru3jwrt_01kfbocCU1Bw",
    "stars": 1.0,
    "useful": 4,
    "funny": 5,
    "cool": 1,
    "text": "I will try again - but - for now 1 star and here is why.\n\nVery disappointed.  Walked in at 8:25 PM on a Wednesday night and was told \"Sorry, Kitchen is closed\"\n\nIt's a DINER for goodness' sake!\nI just wanted dinner and a quiet place to eat and take a conference call.\n\nWho closes a diner at 8 PM? Oh wait - the 352 Diner in Delco also closes pitifully early. Don't people in the burbs eat dinner?\nPlease consider staying open until 9 at least.  I wonder what they do on Friday and Saturday nights??",
    "date": "2014-09-26 20:30:26"
  },
  {
    "review_id": "7BLBFlhklmKU_0XlnedIZg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "A-yqzgOwLIfoT-rgILQSNg",
    "stars": 1.0,
    "useful": 31,
    "funny": 7,
    "cool": 3,
    "text": "This is a scathing review of the way this practice is administered.  The actual care and pediatric dentistry we received here was quite good 3 or 4 star - but Terry - the front desk manager of the South Philly branch of Doc Bresler's cavity busters has made it difficult for us to stay with this practice.\n\nTo start - reaching the South Philly office is difficult - you call the main office and are routed through the phone system.\nOften calls and voice messages are not returned and appointments are only sporadically confirmed.\n\nOur daughter had a coveted Saturday AM appointment at 9 AM (their alleged opening time).\n\nWe arrived at 8:55 AM and the doors were locked.  So we waited (outside on Snyder Avenue) and waited with our 5 year old, and finally I called the main office from my cell phone.  \"Oh.\"  the man said \"That office closed today\".  Well it was news to me!   And to the 14 other parents who showed up that day.\n\nSo we forgave them and came to another appointment about a month later - terrible front desk experience again.\n\nMeanwhile - my kid had her $255 fluoride tx, prohpy and 2 bitewings.\nIn my head I am thinking - \"I need to change dentists\".\n\nSo I have.  We'll be seeing them soon - and yelping accordingly.\n\nTerry - you are sometimes nice and sometimes very brusk with the parents.  Maybe it's just me and you hate me?  Whatever the case - you need to confirm ALL appointments and return phone calls more promptly.",
    "date": "2010-11-29 20:57:23"
  },
  {
    "review_id": "SKUkItI25-1FRws-mm1duA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "osqUOYJ1GR833udf6XCSHA",
    "stars": 1.0,
    "useful": 1,
    "funny": 0,
    "cool": 0,
    "text": "I have been here twice even though the first time I vowed to never return.  What a MEH experience both times.  (We had sushi both times - not hibachi.)  The place is never crowded - because it is not good.  The fish is not truned over rapidly enough and is not at the peak of freshness.\n\nI will not come back here.\n\nUck!",
    "date": "2008-07-25 15:44:55"
  },
  {
    "review_id": "hLr9JoaSKXT-HzH3_HDc9g",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "ScM2XX4EAD4V1X4nSOTSTQ",
    "stars": 1.0,
    "useful": 12,
    "funny": 3,
    "cool": 2,
    "text": "I'm sorry but both times I went in here I was treated to badly by the snobby, ultra thin chicks who work here that I never bought a thing - and one time I went literally in and out.\n\nIt's a shame because it looks like they have cute stuff.\n\nHorrifyingly snotty salesfolk.",
    "date": "2011-03-10 16:05:10"
  },
  {
    "review_id": "g42u2-qJTkw3P_O3OIb0ZA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "u5RCQuZa_-deZvcWnioecw",
    "stars": 1.0,
    "useful": 4,
    "funny": 6,
    "cool": 4,
    "text": "Perhaps one of the WORST Wendy's ever by sheer fact that the staff working here are illiterate, innumerate and just plain rude.\n\nI came in here Friday evening to buy a kids meal for my 4 year old (the only reason I'd even venture in - as I don't \"do\" much fast food.)\n\nWe ordered a chicken sandwich, mandarin oranges (instead of fries) and a lowfat milk.\n\nThey left out the milk!  (Grrrr.)\n\nSo I went trudging back and was given the milk - what a pain.Unless your 4 year old MAKES you come here - don't bother!",
    "date": "2009-05-11 15:09:56"
  },
  {
    "review_id": "4p9mymSa2FA0Zsaz8Nf4Tg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "yOAZ47U67aDUwDXMrnv8UQ",
    "stars": 1.0,
    "useful": 4,
    "funny": 3,
    "cool": 3,
    "text": "Zero Stars - if possible.\nAwful food, dis-engaged service, loud outdated decor and just plain BAD.\n\nMy inlaws insisted on going here because they had a coupon.\nOh the horror.\n\nYou can make better spaghetti at home.  The sauce came straight from a 55 gallon drum.\nAnyone can.",
    "date": "2008-08-11 17:22:42"
  },
  {
    "review_id": "weRnzC1Z02nY1zD0CMgl9A",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "1iQpAAWmGp6yJCNr-7DMRQ",
    "stars": 1.0,
    "useful": 1,
    "funny": 2,
    "cool": 2,
    "text": "Yuck!  Now that there's Bolt Bus (a division of Grey hound) I will NEVER use Greyhound.  So dirty.\n\nYick.",
    "date": "2009-03-23 16:55:25"
  },
  {
    "review_id": "RLlrY4pCM1NAXsA_1YFEfA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "aOwuF1QcB_TO30WwAVR4Ng",
    "stars": 1.0,
    "useful": 6,
    "funny": 3,
    "cool": 1,
    "text": "I will try again - but - for now 1 star and here is why:\n\nI walked in at about 7:30/35 PM on a Tuesday night.\nI wanted dinner and a quiet place to eat and take an 8 PM conference call.\n\nWas told \"sit anywhere you want\" - so I did (looked at the salad bar on the way in and it looked just fine). An elderly couple was leaving and a few more older folks were finishing up their meals.\n\nServer was seated at another table chatting with friends and promptly came over.\nI tolder her about my 8 PM call - she said, \"Oh, we close at 8:00.\"\n\nSo I replied, \"Well, that won't work\" and walked out.\n\nWho closes a diner at 8 PM?\nDon't people in the burbs eat dinner?\nPlease consider staying open until 9 at keast.  I wonder what they do on Friday and Saturday nights??\n\nSo if you want to eat dinner here - come early.\nEven if I had ordered - what if I had not finished by 8?  Would she have kicked me out?\n\nSheesh.\n\nI have been told this diner is very good and even better than Tom Jones (up the road) but i was forced out and guess where I wound up goin'?  Tom Jones.\n\nI will be back and I hope I have better luck next time.",
    "date": "2014-05-14 12:43:10"
  },
  {
    "review_id": "AwzHTqmQp-iU2wan6lyfzA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "5YkucjpFYEhg4gsWU4B1hQ",
    "stars": 1.0,
    "useful": 4,
    "funny": 4,
    "cool": 0,
    "text": "OMG - Thank the LORD I did not go to use the bathroom at LP's until AFTER we had already eaten (and enjoyed) or dinner.\n\nTo get to the bathroom you walk through the kitchen and it is so GROSS.  I could not even go in there.  The stentch of the \"disinfectant\" mixed with urine was too much to bear.\n\nBefore this, however I should mention that I had eaten at LP's about 3 prior times and all were fine.  The food was decent, cheap, typical diner grub.  I was even impressed that the iceberg-based tossed salad was fresh and crisp.\n\nNice servers, too.\n\nBut that bathroom downgraded a 3 star experience to a disgusting big fat ZERO.",
    "date": "2008-09-10 12:58:00"
  },
  {
    "review_id": "gHFbpwxQc1iN66IAQhhyzw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "peeXG1Ra-DClPQv14jvKvg",
    "stars": 1.0,
    "useful": 1,
    "funny": 1,
    "cool": 0,
    "text": "So disappointed.  We bought a groupon (eversave?) that is only valid for dinner (dine-in only),  So we tried to use it the day after hurrican Irene - and Square on Square was packed so we left.\n\nFine.  No biggie.\n\nSo last night (a few months later) we go to Square on Square at 4:30 PM.  We had called earlier to ask if we'd need a reservation and the man said, \"no\".\n\nSo we show up and the place is open, but dead empty.  No staff to greet us, no nothin'.\n\nSo we call \"Hello!\"  \"Hellooooo!\".\n\nNothing. \n\nMy husband and I waited around a good 5 minutes and then left.\n\nSo disappointing.",
    "date": "2011-12-19 14:57:22"
  },
  {
    "review_id": "FxZi5KO2euTTthIp1TqmrQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "cKLrTvokOdcgoEoHOXkfYg",
    "stars": 1.0,
    "useful": 7,
    "funny": 0,
    "cool": 2,
    "text": "DELIVERY REVIEW ONLY - never ate in the restaurant.\nSuper-speedy delivery ($1.25 charge, $10 minimum) which is 5 star - but the quality, as I feared, is not superb.  Maybe I am just spoiled by Vic's and Doma.\n\nThat said I am so glad there is finally a non-pizza, non-Chinese place in the area.\nWe got a yellowtail scallion roll, yellowtail nigiri (not great), spicy crunchy salmon roll (also not so great - not terribly spicy),  TheCrazy Tuna roll was impressiv looking ($11.95)but the tuna on top was not that good either.\n\nI dunno.\n\nNot impressed, but it's not bad.\n\nNothing was spoiled - just not \"uber\" fresh.\nLady on the phone was nice, delivery guy was great.  (They said 40 minutes on a Friday night and showed up in 20.  Sweet!)\n\nUpdate:  It is the next day.  I got food poisoning from the sushi.\nYup.  I spent last night vomiting.  Not fun.\n\nNevery again.",
    "date": "2012-01-13 23:39:52"
  },
  {
    "review_id": "4jFSiufnsSMIjM0NOz20cQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "5OW89S9JXE-mllkIWMg8hg",
    "stars": 1.0,
    "useful": 3,
    "funny": 1,
    "cool": 1,
    "text": "Airport quality pIzza that capitalizes on the NYC Famous Famiglia name.\nOld dried old heat-lamped pies.  High prices.  Sub-par service.\n\nOne star is being generous.\n\nBut you are trapped in the terminal, so go to Chickie's & Pete's or Dump-kin or Mickey D's.\n\nJust DON'T come here.",
    "date": "2011-04-04 00:12:56"
  },
  {
    "review_id": "3emRFXnOTnTwItCQTXUjiw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "jm_6bIhR_TuciFIk5rhR7g",
    "stars": 1.0,
    "useful": 5,
    "funny": 0,
    "cool": 0,
    "text": "I was treated so poorly here that I had to leave, which is a shame because I love a good diner and was looking forward to coming here.  I will give them another chance on a future date but I am not in a hurry.  Here's what happened:\n\nI arrived early to meet a friend at 6 PM but he was not there yet.  It was freezing cold so I went in and figured I'd relax for 15-20 minutes and have a coffee and review some paperwork.\n\n2 men were chatting up front in Italian when I arrived, and they seated the 2 elderly ladies in front of me.  Then they asked me\"How many\" and I said \"2\".  And the guy basically left.\nI asked if I could be seated and he said \"Not until your party is here\" and I said I wanted to get a coffee.\n\nHe said I could sit at the counter.\n\nThere were plenty of tables open.\n\nThe delivery of his words were what made it so rude.  It could have easily been handled better. I left and called my friend and we went elsewhere.",
    "date": "2016-01-22 12:58:55"
  },
  {
    "review_id": "mmsbfJ8iebJiPW9q2I28OA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "kaQ9v7AJ8XLHLsiscmuOSQ",
    "stars": 1.0,
    "useful": 3,
    "funny": 2,
    "cool": 2,
    "text": "Ook.  I never want to go here EVER again.\nSo bad.\n\nDim gray lighting, scattered merch and disinterested staff sporadically placed.\n\nJust frikkin' awful.\n\nIt made the affluent suburbs feel ghetto.\nIt made me long for the Target on Columbus Blvd in Philly.  (Still not as bad as the Walmart on Colombus).",
    "date": "2012-03-31 20:37:43"
  },
  {
    "review_id": "NxKFhu48p7vVFnUGJ1_vrA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "m2SVUOW8PBS-JgGNoR0sNA",
    "stars": 1.0,
    "useful": 5,
    "funny": 2,
    "cool": 2,
    "text": "Walked in.\nWalked right out.\n\nYes - a cute little dog with an eye infection happily greeted me at the door, but the place REEKED of polish fumes/acetone.\n\nGet a better ventilation system and I might come back.\nBeauty Nails down Pennell Road is better - and China Nail or Treny Nail in Media are better still.\n\nUnhealthy.",
    "date": "2012-11-21 17:29:14"
  },
  {
    "review_id": "MIGNqyn53z1qrH66_33ngA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "J8S7cPPlTgsQnXKVfTyN8g",
    "stars": 1.0,
    "useful": 40,
    "funny": 9,
    "cool": 9,
    "text": "I am so saddened and frankly I am angry.  \nYou know what - scratch the saddened.\n\nI am angry.\n\nIn fact - I am mad as hell.\n\nDH & I decided to have a late lunch (It was about 3:20) on a sunny Saturday afternoon and meandered into PYT.  There were about 5 clad-in-black young folk at the the hostess stand and before we were seated they said \"cash only\" (thank goodness they warned us - apparently the credit card machines were down).  This did not affect us - but the two tables near us had to write checks which were reluctantly accepted.\n\nThings went from bad to worse once we were seated.\n\nIt was taking a long time to get out food (I ordered the PYT EAT BLT, DH ordered a double burger.).  Our male server came by (as if to ask \"so, how is everything?\") and I said, - any idea when our food will arrive?  He said \"It will be here soon\" and scurried away (I would bet money to quickly enter the order that I bet was never placed.)\n\n15 minutes later a DIFFERENT male server plopped down the 2 plates and zipped off.\n\nNo cutlery, no napkins.\n\nI called after him - no luck.  So I got up and followed him for a few feet and he turned around, apologized and got us some silverware.\n\nOK, so we're eating - and then we see the table tent that says \"A 20% gratuity will be added to your bill\" (or something like that.\n\nWell - we're a party of 2 (not 6 or more).  And we sure as hell don;t want to give them 20%.  \n\nBut wait - it gets worse.  So I'm eating the BLT and there's no avocado on it (which there is supposed to be per the brunch menu).  I'm hungry and I'm not bothered much - but they charge $2.00 to put avo on a burger - so I would like them to not charge me for it on my avocado-less BLT.\n\nSo the first male server comes over and assures me that I will not be charged for the avo and offered to bring a side of it - but I don't want it now (I am 1/2 way through the meal.).\n\nSo we finish eating - and we ask for a check.\n\nAnd we wait.\n\nAnd wait.\n\nAnd we're pissed.\n\nNobody ever comes.\n\nSo we estimate our bill (sans 20% assholes!!!) and leave the cash on the table and walk the F out.  The ladies at the table next to us (who had the personal check fiasco) said it best.  \"Because they are guaranteed a 20% tip for EVERY table - there is no incentive for good service.\"\n\nI will never, ever, ever go back to PYT.\nI was looking forward to the McThrill-made-famous Milkshakes, too.\n\nThe BLT was fine - very good.  Dh said the burger was fine.\nThe service (and loud, pumping, headache inducing music - we heard a club-mix of Dolly Parton's 9 to 5) is just freakin AWFUL!!!!!\n\nSuch an epic service-related fail.",
    "date": "2011-07-17 00:32:31"
  },
  {
    "review_id": "K-kYDM2_FrdVMknUn4oWdQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "qfAEbGBZSq4oi6nkr9gOiQ",
    "stars": 1.0,
    "useful": 0,
    "funny": 0,
    "cool": 0,
    "text": "Uck!  Really?  You're kidding.\n\nJo Jo's is AWFUL - everything from ZERO decor, Zero service to yucky tasting food.  \n\nDoughy dumplings, greasy chicken & brocolli & overly salted wonton soup broth.\n\nI went once - reluctantly (the place just looked unappealing) and have NEVER returned.\n\nTry Square on Square or A Mandarin Restaurant, nearby.",
    "date": "2010-08-12 14:54:00"
  },
  {
    "review_id": "hlPQxhFLGo4mIU70NGbanw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "nmT6X4V47hERBPqQU-n1Zg",
    "stars": 1.0,
    "useful": 2,
    "funny": 3,
    "cool": 1,
    "text": "It is a pretty sorry site for a bar.  The only reason we went here is because we needed a table during the lunch crowd at RTM.  Now, mind you, you have to be a customer to sit at a Beer Garden table - so we bought some drinks and then discretely ate our \"good\" food from the other vendors.  The food here?  Chilli and Hot Dogs. - and who wants to eat THAT when there is so much wonderful culinary goodness to be had at RTM?\n\nMeanwhile at the bar were some pretty shady lookin' characters.",
    "date": "2010-02-05 18:28:50"
  },
  {
    "review_id": "CtwM1mYZYU7clMR2ul1DpQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "IEDW_nZUl1OEq9qucwViRQ",
    "stars": 1.0,
    "useful": 4,
    "funny": 1,
    "cool": 0,
    "text": "Nope.  I take it back.\nI was excited to have Chipotle as a quick lunch option.\n\nNot quick.\n\nThe line can wind around for miles - you must get here before 11:55 AM or you are stuck.\nThey then ran out of chicken and the line screeched to a halt.  Nasty attitude from the girls behind the line, too.  (Not the cashier lady - she was nice.)\n\nMy bowl of rice and veggies got cold during the wait so I literally had to walk out.\n\nI will not be back until my coworkers drag me here again.  I certainly will not come bnack on my own and not from 12 - 1 PM.  No frikkin' way.\n\nGet it together, Chipotle.",
    "date": "2016-12-05 18:00:52"
  },
  {
    "review_id": "xE8uiH0EWFMsLlPoZSO2xg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "wJAK6B-dmgGrco3KYwvWXQ",
    "stars": 1.0,
    "useful": 21,
    "funny": 7,
    "cool": 3,
    "text": "Sorry - but I have to pan the Body Klinic.  I would have given it 2 - or maybe even 3 stars when I had just been there for a pedicure - a guy named Michael did it and he was pretty good.  (Even though you have to sit on an uncomfortable wood block elevated and covered with throw pillows, posing as a couch.\n\nThe owner (receptionist or owner - I couldn't tell) was not nice to me at all.  Still, a gluuton for punishment I came back for a cheapie massage - I mean who can resist that price?\n\nResist.\n\nTrust me.\n\nIt was a mediocre \"fluff & fold\".\n\nSorry - but I will not be back.",
    "date": "2008-10-16 18:59:23"
  },
  {
    "review_id": "_2cqETCZX34qS521h39d9w",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "XfffEIx41cPIP7lgGitJdQ",
    "stars": 1.0,
    "useful": 0,
    "funny": 0,
    "cool": 0,
    "text": "This station is far more disgusting than the one at Race/Vine.\nIt reeks - especially in the summer (I don't wanna know).\n\nDefinitely scary!",
    "date": "2010-09-30 17:47:45"
  },
  {
    "review_id": "9R3v8c9sg-xTf1M4KJRpsQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "sX3TCT-BHn8vboCYFqsHUA",
    "stars": 1.0,
    "useful": 7,
    "funny": 3,
    "cool": 1,
    "text": "Epic Fail and so incredibly scary.\nI literally walked in - was greeted by an Asian woman who was reading a newspaper and the cases had only canned and frozen product.\n\nMany cases are empty.\n\nThe place is clearly failing and there is a sign that says \"No Eating\".  So clearly, they don;t want you eating here.  take out only.\n\nDirty.\nAbandonned.\nIcky.\n\nJust. Plain. Bad.\n\nThankfully, no relation (at least not in decades) to the fabualour Lobster Claw in Doylestown.  That place rocks.\n\nThis place?  Rock-bottom.",
    "date": "2017-09-28 17:10:05"
  },
  {
    "review_id": "_I6GdTj_wl0Rm4-Y2JZ-RA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "ZVrOGpZe5usRbdxxtmxHoQ",
    "stars": 1.0,
    "useful": 2,
    "funny": 0,
    "cool": 1,
    "text": "Just AWFUL.  I mean it. Zero stars if it were possible. We have come here exactly twice in the 4 years we've lived in Philly (we usually make a bi-monthly pilgimage to Target nearby.).\n\nThe first time we came - we didn't know any better.  Shopped for our \"usual\" stash of baby supplies and paper goods and got the hell outta dodge.  It was like shiopping in the hood.  So \"ghetto\" and very piggy patrons screaming at each other and tearing up the merchandise.\n\nThe 2nd time we went only becuase I wanted to by a Max Factor products supposedly carried only at Wal-Mart. They did have the product - and I bought 2 and vowed to never return.\n\nSooooooo bad.\nMake the \"ghetto Kmart\" look great and makes Target look like Bloomies.",
    "date": "2009-01-05 20:50:17"
  },
  {
    "review_id": "UawSCwMtsBfoplbeBEEowA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "BE7efGAH9Eb2aGbMGFfgQQ",
    "stars": 1.0,
    "useful": 7,
    "funny": 6,
    "cool": 4,
    "text": "It's the hood of all malls.  There is nothing here to speak of.  on a very rare occaision i will go to the Old Navy (which is nearly always picked over and dis-shelveled.)  I also once dained to get my nails done at the Korean-run nails salon on the lower level.  NEVER AGAIN.\n\nThis is a really low-end mall - which is a shame because when it was built it was a shining star and an attraction for Philadelphia.",
    "date": "2008-08-22 12:36:04"
  },
  {
    "review_id": "wK9GujA_9WsMr7aLpPNY8w",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "mieU5pqt_b3qrhkeopZ2Pg",
    "stars": 1.0,
    "useful": 2,
    "funny": 1,
    "cool": 0,
    "text": "Horrifying.\n\nI walked in at 4:45 PM (they closed at 6 that day) with my 10 year old for a cut and \"dip dye\" color.  We brought our own color but were told we could not use it and were assured they had the cobalt blue shade she wanted.\n\nWell, we never even got that far because the 4 gals - 2 coming on shift and 1 or 2 leaving - were having a huge in-staff fight.  2 of the gals tried to stay out of it but the other 2 looked ready to kill each other.\n\nThey marched to the back and screamed at each other.\n\nWe left.\n\nI don't need an amateur, unprofessional, angry hairstylist working on my kids head.\n\nSoooooooo unprofessional.\nAnd they lost a potential client as well.\n\nAt least el kiddo snagged a lollipop before we left.\n\nDO NOT RECOMMEND!\n(We had a far better experience at the Supercuts on South Street in Philly and of course we LOVE Shear Blliss in Brookhaven)",
    "date": "2014-12-22 15:36:00"
  },
  {
    "review_id": "W43G_BzVtTCG-J1C2chLnw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "tdCWwSbMXBHomFe1aILUgw",
    "stars": 1.0,
    "useful": 3,
    "funny": 2,
    "cool": 2,
    "text": "Don't get me started.\nIt was the Time Warner mega-monopoly when I lived in NYC and now this.\n\nThe Comcast monopoly.  A neccessary evil in which my family pays just over $100 bucks a month to have the priviledge of watching frikkin' TV.\n\nThe bill is always wrong, always too high and I am ALWAYS put on hold for between 12 and 22 minutes each and every time I call to threaten to leave unless they lower my bill - which they occaisionally, reluctantly will.\n\nI was on a 6 month \"promotion\" that ran out and for whatever reason they just couldn't find another \"promotion code\" that would work.  And on and on and on it goes.  \"May I speak to your supervisor?\" -No!!!!  I was put on hold AGAIN!!!!\n\nAlas, my apartment building has Comcast for their carrier and no satellite TV is permitted, so we are SOL.\n\nIn addition, each day I get to walk past the shrine to Comcast - yes, oh yes, the GORGEOUS Comcast Center with it's multi-million dollar screen in the lobby and over-priced chi-chi food court and programable fountains out front.\n\nThis hommage to COMCAST turns my stomach when I think of my $100 a month  (for cable and internet - sheesh there's no way in holy hell I'm gonna give them ny phone bill, too - you'll have to read my rant on verizon which also blows.) and all the other citizen's of Philadelphia who wait ON HOLD for the priviledge of paying over $100 a month so our kids can watch PBS Sprout.\n\nI hope this yelp review will not preclude me from future employment.\nI could have cursed alot more and said some truly evil things - all of which are true - but you NEVER KNOW when Comcast will need a kick-ass technology trainer.  (That'd be moi.)",
    "date": "2008-09-29 19:07:50"
  },
  {
    "review_id": "QeqNRNRGs2hbdd4_1oPkfQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "fiJVu3jt9deLUiZD-UCadQ",
    "stars": 1.0,
    "useful": 7,
    "funny": 0,
    "cool": 0,
    "text": "It is rare for me to give a 1 star review but, frankly, I am aggravated.\nA good friend of mine & I decided to go for manicures on July 3 (The Thursday before a BIG holiday weekend.)\n\nAfter deciding not to go to another neaby salon which was packed (overbooked) and could not see us for about 40 minutes, we took a gamble and came into Gateway Nails.\n\n\"Oh, this looks nice!\" I exclaimed as we entered.  A tall blond receptionist hastily asked what we wanted and brusquely informed us that they were very busy (as we expected - and as we could see)  We decided to wait, and I took my time browsing the Gel, Vinylux and traditional polish colors.  Since a manicure is $14 plus there is a $5 soak-off fee, i figured i'd just get a gel - since that is what I usually get.  Gel mani's are $30 here. \n\nI wanted to ask about the Vinyluxx - but the lady was so hurried and rude and barked at me to \"Wait a minute\".\n\nShe really was unpleasant.\n\nSo my friend and I left.\n\ni really don't think I'll ever go back.\nWe were prepared to spend good money there, too.\nIt's a shame.  She lost 2 potential clients.",
    "date": "2015-07-10 19:11:08"
  },
  {
    "review_id": "gMksT432p05TIQ4i9_Njbg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "rDh6j39BYX4IL9RSZDGs2A",
    "stars": 1.0,
    "useful": 5,
    "funny": 5,
    "cool": 0,
    "text": "Fail.\nWhile the service from our young, tattooed and under-educated server was good.  Attentive and pleasant, the food is just awful.\n\nDO NOT order the Chicken Francese - a gloppy, gloopy over-sauced mess served over a bed of mushy overcooked pasta.\n\nSalad bar was just OK.\n\nBroiled Seafood platter (all frozen) was a bland JOKE and a waste of $20.\n\nNot goin' back.",
    "date": "2016-06-03 18:58:54"
  },
  {
    "review_id": "FTq_fP3YCv0y5x79rjT3gg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "P3bw4h4kCaMaYqGGNLt3Jg",
    "stars": 1.0,
    "useful": 1,
    "funny": 0,
    "cool": 0,
    "text": "Well - I think they are finally out of business.\nI was told that the chef and menu had changed and was gfiven a coupon for free guacamole and 20% off the bill.\n\nSounded OK so I made a reservation.\nWhen I needed to change the reservation a lady answered the phone and said they are closed.\n\nFor good..",
    "date": "2013-07-15 17:28:07"
  },
  {
    "review_id": "uuQaAhBBu149EMqvvxBwOQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "wJcIX3OUTQ0DleS9JJyX9A",
    "stars": 1.0,
    "useful": 9,
    "funny": 7,
    "cool": 3,
    "text": "At the risk of the yelp-police removing my review, I feel I must say what I am about to write:\n\nWe were so looking forward to trying this place but as we walked in I could already smell rotting/dead fish, faintly,  in the vestibule.  When we opened the door I could not make it passed the hostess stand.  The smell was just. not. good.\n\nA sushi place should NOT have any sort of a fishy odor.\n\nWe walked out.\n\nMight try again but I am in no hurry.",
    "date": "2016-03-31 12:21:56"
  }
]