[
  {
    "review_id": "65mElR0sH3-wvFMFaaBalA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "PjknD8uD_0tisZQbomiYoQ",
    "stars": 2.0,
    "useful": 3,
    "funny": 2,
    "cool": 1,
    "text": "A McDonald's seems so out of place here amogst the shi-shi shops on Walnut Street.  That and it is a haven for local down & outs seeking a $1 McChicken and a coke or coffee.\n\nI rarely ever set foot in here. (But admittedly I have once or twice.)\n\nYick!",
    "date": "2009-03-06 17:20:46"
  },
  {
    "review_id": "Vo5L5qSZwt8ZizsZp0NrvQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "PW6C4OMpPQ_Zm7oiwNIVgw",
    "stars": 2.0,
    "useful": 4,
    "funny": 3,
    "cool": 2,
    "text": "I'm sorry - but ANJOU is WEAK!!!\n\nFrom the outside it looks appealing.  The menu sounds like it's gonna be good - if a bit pricey.\n\nMEH.  MEH. MEH.\n\nSorry.  Nothing special here.  Go to Pizzicato, Mizu, Uzu or some other nearby place.  There are oodles of them to choose from.",
    "date": "2008-08-24 16:19:42"
  },
  {
    "review_id": "pU9eVlIklIvleKANN7oUgw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "paO0ETshl56TNSaEyzm9Cw",
    "stars": 2.0,
    "useful": 5,
    "funny": 2,
    "cool": 2,
    "text": "You'd think for a place called \"Brodo\" that you'd be able to get a decent cup of soup.  Well, you'd be wrong.  I stopped in today after trying to get into Nom Nom (which was mobbed and they don't offer take out.  WTH?  But that's another review...)\n\nBrodo looks very sleek, new and nice.  Prices seem low enough - but it ends there.\nI got a 1/2 sandwich (Veggie) and a cup of soup (their version of Italian Wedding).  I asked if I could substitute cheddar for the American Cheese (which is a waste of tasteless fat/calories) and was told they only have shredded cheddar - but i could get swiss or provolone.  So I opted for no cheese.\n\nMeanhwile, I start to eat it back at the office and there is a weird horse-radish taste to the mayo.  I think they goofed and put horseradish mayo on it.  Weird - but not bad.\n\nThe soup was salt-laden and NOT even close to being delicious.\n\nNot goin' back.\nSorry.\n\nI spent $8.40 for the combo (no drink).\nOh, and the line waas not bad when I went - but if there is a long line, don't wait in it.  NOT worth it.\n\nSo sad, because it looks very nice.  I sure do miss the Naked Chocolate Cafe though.",
    "date": "2012-07-20 16:53:42"
  },
  {
    "review_id": "CmOfzihsuWQFLK1cPDB7-A",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "JUlsvVAvZvGHWFfkKm0nlg",
    "stars": 2.0,
    "useful": 7,
    "funny": 2,
    "cool": 3,
    "text": "Read Catherine L.'s review - and my sentiments are echoed.\n\nA close friend and I came here  for dinner.  When we had trouble finding the place (we were at the \"A Full Plate\" end of Liberties walk, we called on the phone and a nice man came out to get us and walked us over.  This, alas, was the best part of the meal.  Things got progressively worse and worse.\n\nFirst we were seated (inside - at our request) and our drink order was taken by a clearly overworked, spread-too-thin male server (who was very nice and tried his best - 3 stars for him).\n\nAfter taking our meal order we waited, and waited, and waited...\n\nAnd waited some more...\n\nAnd finally asked harried server to please bring our chips and salsa (as he had just brought some to another table nearby).  We were starvin'!\n\nThe smoky salsa and salsa verde arrive - in hot bowls \"fresh from the d/w\" and thus we had warm salsa.  Yech.  And the salty chips were \"chipettes\" (or to be mean - crumbs.)  smashed to smithereens.\n\nOK, things aren't so great - but we await our entrees.\nWow - Impressive looking - I order a single beef shortrib and feel like Fred Flintstone.  This thing is HUGE.   Gi-normous!  Like a brontosaurus rib.  Alas - there is no sauce.  My friend orders an \"OK\" pair of Chicken burritos that are no better than Qdoba.  \n\nSo here's the kicker...  About 3/4 through the entrees, frantic server appears again with a six-pack of sauce.  He gives me a bottle of HOT and a bottle of SWEET.  I pour out a bit of the sweet onto my plate (disregarding the crust around the rim of the squeez bottle) and dip my meat in.  UGH!!!  Racidity Central.\n\nThe HOT sauce is not rancid - and has a nice flavor but it just to hot for me.\n\nMy appetite is now officially GONE.\n\nAnd shortly thereafter, so were we.  I will not return.\n\nSuch a disappointment.",
    "date": "2009-08-17 00:36:10"
  },
  {
    "review_id": "2YijWpJ35Xo3BRSRIjucHA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "IAj1Lw3FAOY-yZn4IO7ElQ",
    "stars": 2.0,
    "useful": 8,
    "funny": 4,
    "cool": 3,
    "text": "Selection and location 4 stars, Surly/Bitchy customer service - 1 star.\nPrice 3 stars.\n\nI stopped in here looking for leotards (hopefully something sparkly or USA themed - they had none of that) for my 8 year old's recent gymnastics obsession.\n\nNow, part of this was my own damned fault as I was talking on my cell phone (engrossed actually) as I entered the store and basically waved at the woman and pointed to my phone.  I tried to wrap up the conversationbut the person went on and on and I dd eventually hang up.\n\nBy then the woman had wrttenme off - which kinda sucked, because I did end up finding 2 \"close-out sale\" short sleeved, solid-color, basic leotards at VERY inexpensive prices (and thus non-returnable).\n\nThis place is Kickin' it old-skool - literally.\nLeos, skirts, ballet shoes, tap shoes, costumey things.\nA dancers paradise - save for the surly service.\nGlad they are still around - as this type of place is a dying breed.\n\nDo not multi task in this store!!!",
    "date": "2012-11-18 19:08:56"
  },
  {
    "review_id": "p1-KOZGOrrANK_ADvIKJDw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "A9rVxmIBtHZRvNhbBaGAWg",
    "stars": 2.0,
    "useful": 5,
    "funny": 3,
    "cool": 1,
    "text": "Not sure why so many raves.\nThe place is so dingy and needs a good cleaning.\nThey do offer many authentic dishes like Duck Tongue and Frog, but we were not interested.\n\nWe got the ($32) Peking Duck and the meat was dry.\nEggplant with garlic sauce (the best dish of the night) was so hot we could barely eat it.\n\nFood is very spicy - even dishes marked mild (but that is also part of the Szechuan experience).  Compared to Han Dynasty in Philly - this place is awful.\n\nNot coming back any time soon.",
    "date": "2014-01-20 00:02:09"
  },
  {
    "review_id": "pJyeC5qB3zVRgl_elEVnOw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "_EKvNMC2Mm67HzqNIzLgXg",
    "stars": 2.0,
    "useful": 2,
    "funny": 3,
    "cool": 7,
    "text": "Not good, Temaki.\nI am sorry to report that our last visit (albeit it was \"Dining Under the Stars\" aka \"Chaos out in the Heat\") the service and food quality both were Just \"Meh\".\n\nMike tried hard to please us but after receiving 2 warm and watery diet cokes (they were, thankfully, removed from the bill) and cold, soggy sweet potato tempura rolls - I am not a fan.  Also, this is now the 2nd time the salmon tasted \"fishy\".  Fresh raw salmon should not taste this way.\n\nUnfortunately for me, my 8 year old ADORES the place - especially the tasty shrimp shumai (served with a saffron cream sauce and fresh sweet corn kernels) and california rolls.\n\nWe'll be back - and pray you won't take it out on us, but food and beverage quality needs to improve.\n\nThe female manager is very sweet.\nI think the guy hates me.  (He might really hate me now.)  \n\n:(",
    "date": "2013-08-08 12:10:42"
  },
  {
    "review_id": "7TNDJWAVAB_p0ZWYYC5EAA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "-4dYswJy7SPcbcERvitmIg",
    "stars": 2.0,
    "useful": 6,
    "funny": 0,
    "cool": 0,
    "text": "Ook!  I am close to giving it 1 star only.\nDirty, nasty store.  Dairy is unreliable.\nProduce is Questionable.\n\nCashiers?  What Cashiers?  When yo9u can get a register open there is a huge line and the lady looks pissed off.  (I would be too if i had to work here.)\n\nYUCK.\n\nPackaged goods only.\nI would never buy veggies, meat or dairy here.\n\nAnd it's a shame - bordering on a sin.  This area of Philly NEEDS viable grocery stores - and this is all we've got.\n\nSAD, SAD, SAD.",
    "date": "2011-11-09 18:04:49"
  },
  {
    "review_id": "S2Yi_sdlnjJCCnzT0-1_8A",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "GUMVStVaJfWmCIpQA4TtHg",
    "stars": 2.0,
    "useful": 0,
    "funny": 0,
    "cool": 0,
    "text": "Meh.\nYou get what you pay for and they do go crazy with the Kewpie Mayo here - so either avoid rolls with mayo or ask for sauces on the side.\n\nI had seen the place (walked by) and read the other yelp reviews - but for $8 (2 maki - you can get 3 for $12) I figured I'd give it a shot.\n\nService was icy-cold at first (one lady was kinda mean - she was prepping a table for a large party that was not there yet and clearly did not want to stop to help another table) but then my \"real\" server showed up and was very sweet. Vibe is kinda icy too - with colored LEDlights that change color and rock-hard banquettes that are straight up & down and not that comfortable to sit at.  Water was brought instantly (YAY!) and green tea (which I had to ask for) was free.\n\nI ordered a yellowtail scallion roll (had decent yellowtail but hardly any scallion in it) and a roll with salmon and grilled onions (loaded with mayo blobs on top which I scraped off - seriously, at least 3-4 tsp. of mayo.  Eew).  It was also supposed to have masago but there was NOE in there - and when I asked the (sweet) girl about it she said they don;t include masago on the lunch special.\n\nThese people are certainly cost consious - as the lettuce & dressing salad indicated (no tomato, no nothin').\n\nI am in absolutely NO HURRY to come back here - yet - oddly enough - I ran into a friend here with another aquaintance and the LOVE it here.\n\nMeh. Meh. Meeeeeeh.\n\nSorry.\n\nDoma and Vics cost more - but are sooooo much better.\n\nNope.",
    "date": "2013-09-13 16:45:01"
  },
  {
    "review_id": "cXs9yW2V5xIOz7SZCVOCMg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "3BJxm-HnvzdwD1zjmSbmyQ",
    "stars": 2.0,
    "useful": 4,
    "funny": 5,
    "cool": 3,
    "text": "Ok, I came here on the advice of co-workers who basically said \"Don't eat at Long River\" - which is across the street from my office.\n\nSo I trudged over the 2-3 blocks to Golden Chopstick, stood in a pretty long line and ordered a Chicken & Stringbean lunch special with brown rice to go. \"Light on the sauce\", I implored.\n\nService was friendly and the order took about 6-8 minutes to come out (not bad considering there were 7 people ahead of me.)\n\nWalked the take-out grub back to my desk and voila.  Tasteless - abut thankfully not greasy due to the lack of sauce.  Beans were the best part - crisp.  Chicken (thankfully white meat) was bone dry and flavorless.\n\nNot sure If I'd ever come back.\n\nNow I am really in fear of Long River.  This is supposed to be the \"good\" Chinese place near my office.\n\nOh well.",
    "date": "2009-04-23 17:05:22"
  },
  {
    "review_id": "HHPOcYRufU4Ag_DhjxvQXw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "GmomRGW_omclyKXKDppsIg",
    "stars": 2.0,
    "useful": 4,
    "funny": 1,
    "cool": 1,
    "text": "This ain't my bag, baby.\nThe free one hour of \"build your own\" martinis was great - for FREE - and then it was $5.00 apiece after 9 PM.\n\nMy husband got completely hammered by downing 3 of the candy garnished concoctions is 55 minutes.\n\nIt was just way too frat-boy in there - and the lack of waitress servce made it impossible for us to even order food.  (Thus we were both pretty trashed while drinking on an empty stomach.)\n\nThe cute bartender-boy made me a very tasty cosmo - but I was just as happy with my cranberry, vodka & lime.\n\nIf it were not for the \"free\" ploy marketing - we'd never have gone in.\n\nAnd unless there's another freebie - we won't return.",
    "date": "2008-07-28 18:08:34"
  },
  {
    "review_id": "jTxRInIO1weveLEsXS9UsQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "XgLrkmIqIrD_pl67lAovEQ",
    "stars": 2.0,
    "useful": 3,
    "funny": 1,
    "cool": 2,
    "text": "Such a shame - years ago this was THE place and had shopping and a great food court.  Now it is so dead here. And too many t-shirt/key chain vendors.\n\nSigh...",
    "date": "2009-03-17 13:46:26"
  },
  {
    "review_id": "i0uWk_PJ7nRY5x-iaOYJYw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "NaA1lTPxouNLq-zFI3IOYA",
    "stars": 2.0,
    "useful": 2,
    "funny": 1,
    "cool": 3,
    "text": "OK, for some reason I could not get the name \"Beefsteak Charlie's\" out of my mind - and indeed, this place takes me back to 1984 - but not in a good way.\n\nThe good parts?  Our server Brian was attentive and kind - and took the overly-salted French Onion Soup off our tab without hesitation - nor us asking.\n\nThe salad bar is also nice - and very '80's - one whole section is mayonaie-based salads (pasta, potato) so I skipped that part.\n\nMy friend ordered a \"Queen Cut\" prime rib - and I had 2 bites of it - he ordered it medium and it actually came out rarer than I had thought it would.  It was OK but no flavor to it other than (you guessed it) salt.\n\nDo NOT order the French Onion Soup here - it looks great and the cheese/crouton are good - but the beef stock is like eating a salt lick.  I could not eat more than a few spoonfuls ($4.99) what a shame!\n\nJust OK.  Not in a hurry to go back.\nStrangely enough - with the exception of no \"pick and peek\" shrimp on the salad bar and no \"Free Sangria\" (remember that???) this place could be a Beefsteak Charlie's.\n\nAh, the '80's.\nChildhood.\nRecaptured.\n\nI guess...",
    "date": "2012-11-21 12:00:00"
  },
  {
    "review_id": "Q20pKHhfr7mDUKnUe9mOTQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "oCFcoyGx2VRZ8MHXEsV8tQ",
    "stars": 2.0,
    "useful": 2,
    "funny": 0,
    "cool": 0,
    "text": "Nope.  Now we go tot he Giant in Aston which is far better - albeit more crowded.\n\nThis Giant has out of date dairy products (have seen that twice now - so READ THE DATES!!!) and a picked-over produce department.\n\nStep up your game, Giant in Brookhaven!",
    "date": "2015-06-15 11:31:59"
  },
  {
    "review_id": "4PbcwKMNQLkXDBjaAUFRaw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "krTHKI0YOpASr4gz2CVWFw",
    "stars": 2.0,
    "useful": 2,
    "funny": 0,
    "cool": 0,
    "text": "Meh.  2.15 for a bottle of Dasani?  I shoulda gotten a latte for $2.19 instead.\n\nMediocrity at its best.\n\nI am so NOT a fan of Cosi.  After eating in them in NYC in the early 2000's when this chain emerged - it seemed cool at first.  And - if the bread is fresh and hot (before it solidifies into cold cardboard) it actually tastes pretty good.\n\nThe hungrier you are the better it'll taste.\n\nMeanwhile - the overpriced sandwich fillings are mediocre at best.\nThere are better places to waste (I mean spend) $9 bux.\n\nSorry.  Not a big fan.",
    "date": "2011-01-05 01:51:34"
  },
  {
    "review_id": "Jyxvl9z2EB1XUwQ1y6dsgQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "GmomRGW_omclyKXKDppsIg",
    "stars": 2.0,
    "useful": 1,
    "funny": 2,
    "cool": 0,
    "text": "Well, I got dragged back to \"the pube\" for a free event for a charity that I support.\n\nWhile I love the charity and am thankful to the Public House for sponsoring the event, the food and beverage service here is sub par.\nMediocre chicken wrap (with an odd mayo-ish sauce) was inedible.\n\nHummus and veggies were safe - but blah.\n\nIt's still not my thing.",
    "date": "2011-10-12 13:59:36"
  },
  {
    "review_id": "nWHQDFpIjfNBEzcJGcZRFw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "UhSVDwQFW6mKmaEA5OTU7A",
    "stars": 2.0,
    "useful": 1,
    "funny": 0,
    "cool": 0,
    "text": "Sorry - but i have had way, way, way better Afghan food.  I love Afghan food - the bread is usually sooooo good.  Sansom's was dry and re-heated in a toaster oven.\n\nThe rice (reheated as well) was good, but not great.\n\nThe salad - scooped out of a tupperware - obviously pre-prepped way in advance was wilted and over dressed.\n\nThe Chalaw Kadu (Normally a fave) was so greasy I had to pick out the chunks of pumkpin from the sauce and discard it.\n\nI was the ONLY person in here on a Thursday night - and finally another single diner came in.  The place was dead - and I bet I know why.\nGet it together, folks.\n\nI'm sticking with Kabul. (And oh, how I miss Pamir - now closed - in NYC)",
    "date": "2010-11-05 00:54:42"
  },
  {
    "review_id": "7YG-I48TEV7MlNrXt5gXyw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "icgaK82qy5NGr1uLVFejyQ",
    "stars": 2.0,
    "useful": 4,
    "funny": 1,
    "cool": 1,
    "text": "We had mediocre service from the \"internet car\" guy (there are 2 people dedicated to web-based pricing) and test drove a Ford Fusion.  Nice car - but we wound up purchasing a Hyundai instead.\n\nNot a great dealership.\nNot overly impressed.",
    "date": "2012-04-23 17:09:09"
  },
  {
    "review_id": "h33RH5EgSkKZko45dPWUkw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "WIv5kTb_P3jnngPkMeRRNw",
    "stars": 2.0,
    "useful": 0,
    "funny": 0,
    "cool": 0,
    "text": "Well, Jay was not here tonight and I bet he'd freak if he was.\nThe place has gone downhill - and quickly.\n\nMy tuna dumplings were stuffed with Kani Salad (fake crab) not lobster as shown on the menu.  The weird, overbearing, barely-english-speaking waitress leaned in sooooo close to me it was a BIG violation of my personal space.  To top it off, she cleared my plates and brought a check - assuming I was done.  I was actually contemplating ordering 1 more roll or a piece or something - but i was so put off, I just paid the bill and left.\n\nThe 2 sushi guys behind the counter were friendly enough - but they were so busy filling takeout orders (dead for eat-in, busy for take-out) that their work was just SLOPPY.\n\nI am unimpressed, Jay.  Get it back together!  You have some great items on the menu.  They need to be executed better - less kani stick and more REAL seafood, please.",
    "date": "2010-11-05 00:59:00"
  },
  {
    "review_id": "LIpVKu21ewFUMSCr5gZjhw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "YJl92FJSgF9l9gMqClrdLQ",
    "stars": 2.0,
    "useful": 18,
    "funny": 0,
    "cool": 3,
    "text": "I came here out of sheer desperation and they carry Eukeneuba small breed senior.\nWhat I noticed - the place smells AWFUL and there are tons of puppies and PIGS ($399) for sale.\n\nThis ain't right!\nStop supporting puppy mills.\n\n2 young adults (late teens?) seemed to be running the place.",
    "date": "2012-10-01 18:35:11"
  },
  {
    "review_id": "E5nKEtEyFv938IWsUHFS8Q",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "IgNDlyLERBwFGphgcC5VDQ",
    "stars": 2.0,
    "useful": 1,
    "funny": 0,
    "cool": 0,
    "text": "I generally hate Cosi - the bread is like hot cardboard - and the food is not my thing, but I stop in to this one every once in a while for iced coffee.  A good friend lives near this one so we'll meet here, grab some iced coffee and hang out with or without our kids in tow.\n\nThe restroom is abhorently filthy though.  Yick.",
    "date": "2010-09-25 20:52:53"
  },
  {
    "review_id": "Nzg9Upnf7lRA1Et062dLAg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "tJPaPZwRqFmDSEc8VEx9hA",
    "stars": 2.0,
    "useful": 3,
    "funny": 2,
    "cool": 1,
    "text": "I am so not a Cosi fan.\nThe bread tastes like stale cardboard a minute after it cools - and g-d know what its doing inside my stomach.\n\nThe prices are high as are the caloric contents.\n\nThis particular location - inside 30th Street - is often crowded and the service is awful.\n\nNot my thing, baby - and 2 stars is being nice.",
    "date": "2010-09-27 16:07:47"
  },
  {
    "review_id": "-oQ1lbeLarBHFWsMbdgttQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "-V0vIgo6196MDn_x3ZaYmA",
    "stars": 2.0,
    "useful": 9,
    "funny": 4,
    "cool": 5,
    "text": "OK - there are many, many things wrong with La Creperie - but I will start with the positives.\n\n1.  Our server Christine - was incredibly sweet, attentive and accurate. 4 stars for her! \n2.  The actual crepe itself is tasty - not too greasy nor too dry and is made of white flour (not buckwheat which the true Breton crepes are made).\n3.  Our large party of 8 was accomodated with separate checks\n\nOK where to start on the bad stuff.\n\n1.  The ancient rattan chairs are incredibly uncomfortable.  So much so, that I had to switch to a wooden chair (there are a few available so try to sit at a table with the cheap wood chairs).\n\n2.  They got my order wrong (A salade Le Melange with no onion and fresh tomato subbed for sundried).  Once corrected the fresh tomatoes were rotten and tasted so bad that I could not eat the salade.\n\n3.  The prices are INSANE for the quality.  My Lemon & Sugar crepe was $6.75 - which is OBSCENE.  The rotten tomato salade was $12.  That's over $20 when you add tip & tax for a salade and a dessert crepe - no beverage.\n\n4.  The restaurant was dead-empty except for our large party of 8 from when we arrived at 7:00 until after 9:30 when we left.  (This could be viewed as a pro and con in one.)  I think there is a REASON people are not coming here.\n\nYes the quality is better than \"crepe maker\" in 30th Street station - but the crepes at Profi's in Reading Terminal Market as just as good, way cheaper and (if you can deal with crowds 7 stools) possibly just as comfortable of an atmosphere.\n\nMy next stop with be Beau Monde (who's prices are even HIGHER) for true Breton crepes.  I pray I am not disappointed.\n\nSorry La Creperie, but ya let me down.\n\nSave for Christine.  She's been there 3 years - one night a week - and she is terrific.  She even adjusted my bill for the inedible salade.  (I feel so very French spelling salad with an \"e\").",
    "date": "2009-06-26 01:46:56"
  },
  {
    "review_id": "BtchEUPqhKwYr1C3lY55Sw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "afmMy0m-mH9uNUxaZZAKpQ",
    "stars": 2.0,
    "useful": 1,
    "funny": 1,
    "cool": 0,
    "text": "I hear this place is owned by Chau (Nail by Chau around the corner - which I used to go to quite often for manis only).  This place is downright grungy.\n\nWent here twice for manis.  No way I'd get a pedi here.\n\nYou get what u pay for!",
    "date": "2009-11-30 21:30:01"
  },
  {
    "review_id": "Mvx7-ehbv5Vv94JV5McamA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "1OgRJcJ2tsfkZn5tCjhNKg",
    "stars": 2.0,
    "useful": 5,
    "funny": 1,
    "cool": 0,
    "text": "A true CLASSIC dive-bar - but luckily the low, low prices ($4.95 for a patty melt - no fries) and decent \"greasy short order\" cookery match the dated '70's décor.\n\nGretchen is a great bartender and the locals all gather round to down a few beers and grab a quick smoke out back.\n\nNOT a yuppy-Media-bar at all.\nThis is one of the TRUE Media originals.\nFamily owned - great customers and low-brow food and décor.\n\nJust what I need when I want a CHEAP drink.",
    "date": "2017-03-17 18:22:40"
  },
  {
    "review_id": "PcRP5qh7H-R04T5swZCzWQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "niz75TdP1PmeCvj6cPjsfg",
    "stars": 2.0,
    "useful": 8,
    "funny": 3,
    "cool": 0,
    "text": "Went in to get passport pictures taken.\nTheir camera was broken.\n\nI left and went to Walgreen's nearby.",
    "date": "2017-06-19 16:41:53"
  },
  {
    "review_id": "0HrAwhmza_UcuuRk6V1CKA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "WIv5kTb_P3jnngPkMeRRNw",
    "stars": 2.0,
    "useful": 1,
    "funny": 1,
    "cool": 0,
    "text": "Well, Jay was not here tonight and I bet he'd freak if he was.\nThe place has gone downhill - and quickly.\n\nMy tuna dumplings were stuffed with Kani Salad (fake crab) not lobster as shown on the menu.  The weird, overbearing, barely-english-speaking waitress leaned in sooooo close to me it was a BIG violation of my personal space.  To top it off, she cleared my plates and brought a check - assuming I was done.  I was actually contemplating ordering 1 more roll or a piece or something - but i was so put off, I just paid the bill and left.\n\nThe 2 sushi guys behind the counter were friendly enough - but they were so busy filling takeout orders (dead for eat-in, busy for take-out) that their work was just SLOPPY.\n\nI am unimpressed, Jay.  Get it back together!  You have some great items on the menu.  They need to be executed better - less kani stick and more REAL seafood, please. \n.",
    "date": "2010-11-05 01:00:44"
  },
  {
    "review_id": "FvZbPc_hsbpIs6N4adqLGA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "Y5PhEJ4pZ2Pp6LMa_lLe1Q",
    "stars": 2.0,
    "useful": 6,
    "funny": 1,
    "cool": 1,
    "text": "Need to clean the restrooms, aisles and seats.\nGROSS.",
    "date": "2015-07-25 20:06:39"
  },
  {
    "review_id": "7UrfkXSSJP-qf31r4BvFiQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "qgAIg5FCQl5bUNpYvg_SbQ",
    "stars": 2.0,
    "useful": 3,
    "funny": 1,
    "cool": 2,
    "text": "This is the Perkins where my then-unemployed friend and I (in our late teens) experienced that great grease-fest of '90.  We ordered a fried appetizer combo of mozz. stix, chicken things and other fried stuff.\n\nAnd coffee.\n\nLots of coffee and cigarettes.  (You USED to be able to smoke in a pancake house, but alas, no more.)\n\nWhat a regrettable meal.\nI shoulda just had pancakes.",
    "date": "2008-08-25 00:52:50"
  },
  {
    "review_id": "VDJyKoGkcRaw4lodbfdGhw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "g1SgEP_XWtXl1TwrvhmLow",
    "stars": 2.0,
    "useful": 3,
    "funny": 2,
    "cool": 3,
    "text": "Oh, this poor mall.\nThe era of the American circa 1983 mall is over.\n\nIt's a shame, too - because it's so close by - and we will be coming here for the few restaurants and shops that are left - and the movie theatre.\n\nI hope they can revive it.",
    "date": "2012-01-06 20:50:21"
  },
  {
    "review_id": "aMVTvoPVNuAflH5rE8A0Rg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "jT3-YA4x2uhkZwChbWdFpA",
    "stars": 2.0,
    "useful": 5,
    "funny": 0,
    "cool": 0,
    "text": "Hate to be a nay-sayer - but I don;t know how this place stays in business - there are way cheaper sources for cookbooks and many places like Amazon, Half.com and ebay for used copies.\n\nI rarely buy new books anymore - especially a true cook book which will get beat up and spattered on in my kitchen.\n\nI am glad they exist and love to browse here - but I buy elsewhere.\nSad but true and I wish the (very pleasant) owner luck.  SOmehow they have lasted.  Not sure how.",
    "date": "2011-07-14 21:45:44"
  },
  {
    "review_id": "FvsRfvwgInrW8sRkGUz_Hg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "9CGFL0YFDf_O6aaiTmnOZQ",
    "stars": 2.0,
    "useful": 5,
    "funny": 0,
    "cool": 0,
    "text": "MEH!  So Meh-diocre.  A casino usually has great food. Not at Sugarhouse.  It has middle-of-the-road burgers and a few snadwiches and plates.\n\nNot my bag, baby.\n\nHonestly?  Were it not for proximity - I would NEVER come to Sugarhouse - I'd sooner go to AC or even Bethlehem, PA.\n\nPhilly fought long & hard to get a casino - and THIS is what they get?\n\nSorry - Unimpressed.",
    "date": "2011-07-06 19:16:48"
  },
  {
    "review_id": "wc58_xUQO7EVmzlJlRt8TQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "xrUtLEFyxzfjflTC2nqLXQ",
    "stars": 2.0,
    "useful": 2,
    "funny": 0,
    "cool": 1,
    "text": "I won't be returning to Coco anytime soon.\nI stopped in at 7:45 AM this morning after passing by many times and seeing the sign advertising over 6 different kinds of soup.\n\nI figured that soup would not be available in the early AM - but the lady said that it was if I really wanted it and what kind would I like?\n\nI settled on a small Chicken & Dumpling soup.\nAfter a while she brought out a styrofoam bowl from the kitchen and asked me, \"Do you want that heated up\"?\n\nWhat?  Are you kidding me?  \"Yes, of course\".\n(I was thinking, what?  I'm gonna eat cold soup?)\n\nWhatever.\n\nMeanwhile the one male cashier was very, very cute.\nThe soup itself was fine - not mind blowing but certainly not worth a rush back.\n\nService here is just plain odd.\n\nI will not be back.",
    "date": "2013-01-15 13:31:02"
  },
  {
    "review_id": "65nNp6jhFZ4l1JY6ozBTgg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "Ee0DwQtmCxhcwSFvX1Gl6g",
    "stars": 2.0,
    "useful": 2,
    "funny": 3,
    "cool": 3,
    "text": "Ugh.  Don't get me started on O.G. - and this one in particular is where 2 out of 3 of my DH's brothers had their wedding rehearsal dinners.\n\nThus, my (then future) FIL wanted US to have our rehearsal dinner there too.  NO WAY!!!  (We wound up going to Bensi's across the street).\n\nMeanwhile - O.G is NOT Italian.  It's faux-talian-american.  And it's full of kids.\n\nI am not a fan of the over cooked, over sauce formula-cooked pastas.\nIt's OK in a pinch but there are so many way better choices.",
    "date": "2009-04-15 14:21:41"
  },
  {
    "review_id": "3V7xvXTI1ThCcTzuhel8zQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "Tm9vJYYd77jbjJe9oGit2Q",
    "stars": 2.0,
    "useful": 4,
    "funny": 2,
    "cool": 0,
    "text": "So expensive and such a snotty vibe.\nThe best part is the boutique upstairs, but basically I was given dirty looks by the sales ladies the entire time i shopped.\n\nWhatever.",
    "date": "2010-06-04 18:56:22"
  },
  {
    "review_id": "HS7z8ke6SrweMmcLfnd0bg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "b4yoyv8ZwxIILxRz0GRMzA",
    "stars": 2.0,
    "useful": 4,
    "funny": 1,
    "cool": 0,
    "text": "My friend and I went and it was a disaster.  They got the orders totally wrong, and the place was not even busy.  Yes, they are new, yes they are pricey and the turkey burger I had was tasty - but the customer service was very, very bad.  I don't think they will make it.",
    "date": "2008-06-24 13:23:00"
  },
  {
    "review_id": "gUvfe8tVs22sjt3RaZhtwA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "4mnF_ZNdUY4NHjXguMY56Q",
    "stars": 2.0,
    "useful": 2,
    "funny": 0,
    "cool": 0,
    "text": "Seriously old and old-school.  In need of a toal property makeover (and not to mention the crappy diner next door which I think is now out of biz.).  Rooms are basic and OLD. \n\nOok.\n\nNot a top choice - but it's the only choice in this immediate area in Delaware County.\n\nplease wash the comforter covers.  They look so bad.  Maybe replace them?",
    "date": "2015-08-04 14:44:02"
  },
  {
    "review_id": "zBP6nRSr5V0FRUM3ZgMDBw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "lHIcRS4CycKMYQjoQMv6wQ",
    "stars": 2.0,
    "useful": 1,
    "funny": 1,
    "cool": 1,
    "text": "Ok, maybe I am in a bad mood.  I am at a toss up between 2 and 3 stars.\nMy \"joey Bag of Donuts\" chicken burrito was dry and I just didn't like the food here as much as Baja Fresh, Qdoba or Chipotle.\n\nIt sure seems like \"Fast Mex Food\" is all the rage these days.\n\nI'd come back here - but not in a hurry.\n\nAnd the guacamole tasted too sour.  (89 cents for a tiny side of it.)",
    "date": "2009-01-26 13:40:44"
  },
  {
    "review_id": "BIsgEtuYK8TDzVmue7CNOw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "m5z9UHmdTakFjEy6rYWpCQ",
    "stars": 2.0,
    "useful": 0,
    "funny": 0,
    "cool": 0,
    "text": "2 - 3 star sushi (and teppanyaki/hibachi tables in the back) with over-load of sauces (get the sauce on the side) and mediocre fish.  Seemed fresh enough but obviously frozen tamago and others. I actually got sick after I ate it.  This might go to a 1 star review if I can figure out for sure that my gastric distress was from the fish.\n\nNot a holy grail - but for $8.95 ($1 extra for ONE specialy maki) for the 2 maki lunch - with Miso Soup and Salad - it's OK.\n\nI had a yellowtail scallion roll and the \"Rose\" roll - spicy tuna inside with tuna on top.\n\nNot Great.\nIn my opinion, Sushi Nami down the street is better.\nAnd the place was so cold inside.  (Hot green tea helped warm us up.)",
    "date": "2014-01-16 18:31:18"
  },
  {
    "review_id": "bPqtjvWO5Exk06461QVnxQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "coxedt2VAsol_4ToYwUJ4w",
    "stars": 2.0,
    "useful": 4,
    "funny": 1,
    "cool": 2,
    "text": "Back in \"the day\" I would occaisionally grab a bite to eat at Houston Hall when I was a grad student at PENN.  (That was, indeed, more than a few years back).\n\nMostly fast food options - but also a bagel place and a salad place.\n\nJust OK - but convenient when you are on campus.",
    "date": "2013-03-13 13:35:34"
  },
  {
    "review_id": "rDfvkdRukdwle9XoPYyPqQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "iUZEGx29miZObLd6_lt7Vg",
    "stars": 2.0,
    "useful": 2,
    "funny": 2,
    "cool": 1,
    "text": "OK.  I have to tell you that I DID NOT GET TO ACTUALLY EAT HERE.  So I can not comment on the food - who friends and colleagues tell me is great. I have also been told that when they screw up, they screw up in a big way.  Well they screwed up today.\n\n I am rating Sabrina's on the abysmal way in which I was treated this morning at 9:40 AM.  Yes - on Saturday AM's the place gets slammed - but I was BY MYSELF - solo - and could have easily been greeted and asked to sit at the counter which had 4 open stools.  Since it was before 10 (don't even think about coming at 11 on a weekend) there were even 2 tables open (where the 2 other parties got seated.)\n\nNevertheless the host ignored me and proceeded to seat the party before (natch) and after me and NEVER GREETED me.  \n\nI pulled a menu off of the pile on the host/hostess stand and read it for a few minutes (sounded good- medium to high prices).  Still nothing.\n\nI just said \"screw it\" and left.\n\nI hope to actually get a chance to eat here in the future.  I guess singles aren't too welcome here.  Next time I'll bring my adorable 4 year old.  I bet we'll get seated.",
    "date": "2008-10-19 21:22:10"
  },
  {
    "review_id": "p4JICo6LSJyo2Pk5x821lQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "9Mm9xvLfiI72E3Inhmn82g",
    "stars": 2.0,
    "useful": 2,
    "funny": 2,
    "cool": 2,
    "text": "\"I agree wholeheartedly .\nThis IS the UK version of TGI Friday's.\n\nAnd it's pretty Meh.  The fried fish & chips and decent - but predictably greasy and salty.\n\nThe food is bland, boring \"formula\" cooking and the staff are pretty bored with it all.\"",
    "date": "2008-08-14 15:40:59"
  },
  {
    "review_id": "7-n8imiEmYNrgpUzckiKmQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "xsbAV-wtWiZTSRxJd3vsDw",
    "stars": 2.0,
    "useful": 4,
    "funny": 2,
    "cool": 3,
    "text": "What a disappointment!\n\nI had not been to the CH Mall since the late '80's and boy - considering it is under construction - it sure needs the overhaul.\n\nThe food court (supposedly brand new) was so new that it had only 2 stores - and 1 was Orange Julius.  We wound up eating at the \"Bistro\" which is like a little diner in the middle of the mall.  (They serve pizza, too.)\n\nThey had a Build-aBear workshop, Sephora and alot of \"average\" chain stores.\n\nThere is a brand new Crate & Barrel (big) and \"The\" Container Store on the property.\n\nKinda sad to see how dead that mall was on a Wednesday night in August.\n\nI hope the construction doesn't KILL their holiday sales.",
    "date": "2008-08-07 20:17:19"
  },
  {
    "review_id": "C2dkh2xjWL13BvXghzjCeA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "HurD0KDmuuHVNnh1lGb_OQ",
    "stars": 2.0,
    "useful": 5,
    "funny": 1,
    "cool": 2,
    "text": "OMG - horrible.\nStay away.\n\nDisinterested service that does not acknowledge when you walk in.\nCheap, but overly fried and greasy food (Lunch combos are all under $6).\n\nI drank my 85 cent diet coke and threw most of my fried (They would not make it for me steamed even though I asked) tofu and broccoli.\n\nBrown rice (they do have it - probably a big mistake) was gluey.",
    "date": "2016-02-19 17:20:59"
  },
  {
    "review_id": "f8M55yzOXzpvllcjEO4muw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "Ee0DwQtmCxhcwSFvX1Gl6g",
    "stars": 2.0,
    "useful": 4,
    "funny": 1,
    "cool": 1,
    "text": "1 star for food but 4 star service from our 2 female servers and the chic Manager on Duty.\nWe had a private part for 10 on a Sunday for lunch,\n\nMy food was inedible but the other folks snarfed theirs down.\nSo salty/oily (Shrimp Scampi) and even though I asked for the pasta to be cooked al dente, I do not think they know the meaning of those words.\n\nNot a fan and never will be.\nMy in-laws family loves it here for whatever reason so every year or two I get dragged along.\n\nThis is NOT Italian food.  This is formula cooking administered by college kids.",
    "date": "2016-01-11 13:07:44"
  },
  {
    "review_id": "KwWfEcSzGx735P2KMxOyzQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "iNjvowVetBKkdnVLDyT77w",
    "stars": 2.0,
    "useful": 4,
    "funny": 2,
    "cool": 1,
    "text": "Nope.   Fail.  \nThey carry the Eukeneuba my pooch prefers but at nearly $3 per bag more.\nEven with a 15% off coupon I still paid more that at Delchester Feed.\n\nI have one more coupon - this one is for $5 off a bag - and if they honor it i will use it, get my Eukeneuba and not return.\n\nOverpriced!",
    "date": "2015-10-02 17:33:39"
  },
  {
    "review_id": "SqXW7dfLud6YSOfCLafRNg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "6WrsLCTPke9sorKEkmEb-g",
    "stars": 2.0,
    "useful": 3,
    "funny": 0,
    "cool": 4,
    "text": "Oy, vey!  It's Finneys.  How many underaged drinks did I get here? (Way, way back in the day?)\n\nHow many of my high shcool friends got completely and utterly $h@!-faced here?\n\nHow many busts occured here?\n\nHow many joints were snuck in the bathroom (or out back?)\n\nHow many ancient buzzed or dunken memories have been through these hallowed doors?\n\nThis place was one of the ONLY liquor-licensed bars in D-town for YEARS (before D-town became yuppieville and a certified tourist destination - BWAH-HA-HA).\n\nWhen I was growing up here we had Finney's and the Farm House - and the Amber Inn (which was called something else - I can't remember) and a few other seedy bars.\n\nFinney's is, indeed, as Erin R. writes a \"frat party\" atmosphere - and also your basic townie bar.  But it kept us good and liquored up all thru Jr. High and High School and for that I am grateful.  (Mom, are you reading this???)",
    "date": "2009-10-14 11:15:33"
  },
  {
    "review_id": "idQJJ3YR7mg182pRWU-mkw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "p5pQ5PKXiEc4yLxsL4TsFA",
    "stars": 2.0,
    "useful": 1,
    "funny": 2,
    "cool": 1,
    "text": "Affectionately known as Charbucks or Fourbucks - we have adopted the slogan of:\n\n\"Friends don't let friends drink starbucks.\"\n\nSave money by brewing at home with Peregrine Coffee (the BEST) or go to La Colombe or Caffeination.",
    "date": "2009-03-03 19:52:21"
  },
  {
    "review_id": "kYEJ2DF-51xdHWlD0POo4g",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "lAeoNBksQeNB5cY8mvYg9Q",
    "stars": 2.0,
    "useful": 3,
    "funny": 0,
    "cool": 0,
    "text": "OK, I'm gonna be nice and give them 2 stars - as usually McDonald's by it's very nature is a one star chain for me. \n\nI don't do fast food.  I just don't - but if you need a clean(ish) restroom - and the new McCafe coffee - the New Britain (old school) mcD's has been around for-eh-ver.\n\nI think it may be about the same vintage as the Doylestown location.\n\nThe people working here are pleasant, though and that is worth alot.  Mostly CB West folks, some young adults - some not-so-young (during the day shift).\n\nI won't be in often, but hey - it's there.",
    "date": "2010-01-11 18:27:26"
  },
  {
    "review_id": "ScXFh2HihniSyiNRV3HFPg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "dTL6npuTfmM-kieva8U43w",
    "stars": 2.0,
    "useful": 2,
    "funny": 0,
    "cool": 2,
    "text": "Not a fan.  Sorry.  With Qdoba nearby and really GOOD places like Xochitl and Tequila's, I guess I am forever spoiled.  Even my former experience with San Francisco tacquerias puts Hot Tamales to shame.\n\nI had a burrito with spinach, mushrooms and supposedly turkey - but it seemed almost exactly the same as the ground beef my friend ordered.  Weird.  And bland.  And just not that tasty.\n\nIt's not that the food is dangerous or anything - it's just not that good.\nIt is cheap, however.  And crowded at lunch time (I thnk they are closed at dinner time.)\n\nWhatever.\n\nNot really worth the energy.",
    "date": "2008-08-28 13:51:00"
  },
  {
    "review_id": "GgTFcXojPUEv74dBTfabcw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "nxuvcr3611_uvr57ucI5hg",
    "stars": 2.0,
    "useful": 3,
    "funny": 1,
    "cool": 1,
    "text": "It's OK.  Just OK.  I grabbed a quick low-fat banana berry muffin ($2.00 including tax) and the lady heated it up in the microwave for me.\n\nWith so many other goodies in RTM - this might be OK if you need BREAD - but for sammies or treats I'd go elsewhere (Like Flying Monkey for treats or Olympia Gyro).\n\nBut I guess that's not an apples to apples comparisson.\n\nIt may be intangible, but I was never thrilled with le Bus.  Very 1989.",
    "date": "2009-08-17 18:21:59"
  },
  {
    "review_id": "dCKYcIuhOhRR3655x4Eq5Q",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "rY3bChlXDbRYKKHmGdLLeA",
    "stars": 2.0,
    "useful": 2,
    "funny": 2,
    "cool": 1,
    "text": "It's here - and that's a BIG plus.  I just bought a 1/2 gallon of tropicana OJ there - i was in a pinch and HAD to have it - and it was $4.49.  OUCH!\n\nI also got a 12 oz. bottle of V-8 for $1.99 - Double OUCH!\n\nKorean-run and nice staff, but wow - so pricey.  They also have a hot food bar that looks so unappetizing to me.\n\nGlad they are here - wish they were cleaner and cheaper.",
    "date": "2009-03-06 13:47:13"
  },
  {
    "review_id": "t-2xvTxh5YrXy0OsuKOlPw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "T9nNz9-3mfNga0T0Nfzvsw",
    "stars": 2.0,
    "useful": 6,
    "funny": 4,
    "cool": 1,
    "text": "Otto's dumpy brauhaus has been around for years & years & years - as long as I can remember.  I went twice over the years and both were pretty bad - but I am not a \"wurst\" gal.\n\nYou can drink yourself silly with the NUMEROUS beers on tap and in bottles.  (Alas, I am not a beer gal either) You can watch the game, ogle the dusty old busts of deer on the walls or count the multi-colored beer steins hanging on the walls.\n\nIt's just not that great.  The food is mediocre at best and some of the servers (who've worked there for eons) just really don't care any more.\n\nIf you LIKE German food - then go, otherwise I'd skip it.",
    "date": "2009-01-07 15:19:26"
  },
  {
    "review_id": "o4ekO1tUl9fM_-P-UqR8Sg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "RPgxx0yCxGXvWx8KKpc1DQ",
    "stars": 2.0,
    "useful": 2,
    "funny": 1,
    "cool": 2,
    "text": "Meh.\nDecent staff helping us or trying to sell us a new phone.\n\nNot gonna buy here, I don't think.\n\nA decent selection of high priced phones.",
    "date": "2015-10-10 23:53:17"
  },
  {
    "review_id": "mimxWZOCe57c1Ln5X5pSbQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "02PoEXj8TR7FQZvUV48o8w",
    "stars": 2.0,
    "useful": 3,
    "funny": 0,
    "cool": 0,
    "text": "Just OK.  Meh is the perfect word to describe the S&HF.  Been around a long time though so SOMEBODY must be going there.  Years & Years ago it was a meh pizzeria.  This location is cursed.",
    "date": "2012-01-08 02:54:43"
  },
  {
    "review_id": "qHU4TykQ7fFsGTf_t2SNww",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "by2wRASwOKpCZU9KtZ3MHA",
    "stars": 2.0,
    "useful": 1,
    "funny": 1,
    "cool": 0,
    "text": "Mediocrity.  Came here when I was in a huge rush and Hip City Veg (next door) was bustling and Nom Nom ramen had a long line.  Spent about $6 on a latte and a stale bagel with veggie \"light\" cream cheese, tomato and cucumber.\n\nBitter overpriced latte.  \n\nBLAH.\n\nWaste of calories.\n\nNot goin' back.",
    "date": "2013-04-23 17:33:20"
  },
  {
    "review_id": "DJP1m2TLscsS8D-UNJ1HIA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "2-6E1sAD1MKUixksDw-hkw",
    "stars": 2.0,
    "useful": 0,
    "funny": 0,
    "cool": 0,
    "text": "This Mickey-D's has been on Sugan road for years and years.  I rarely stop in (I don;t \"do\" fast food) unless dragged in by a friend or relative.  But - they have clean (relatively) bathrooms and that has saved us on occaision.",
    "date": "2013-03-06 16:26:19"
  },
  {
    "review_id": "ORXyEYHP5fMZr_8o4C-KGQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "K2svtoFXk68mFIIwLjG36g",
    "stars": 2.0,
    "useful": 2,
    "funny": 0,
    "cool": 0,
    "text": "Meh.  Just like the ones in NYC - over priced but quck and convient with food that looks better than it tastes.\n\nAnd $3.50 for a small bowl of lettuce (add ingredients to make a salad) is robbery!\n\nAnd my egg bagel was flavorless and slightly stale.\n\nWon't be back.",
    "date": "2013-06-12 13:49:30"
  },
  {
    "review_id": "X6ORGCriXtvotgDLaXLM6A",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "52iW9Eo-EWJZXYYjQ5pAKw",
    "stars": 2.0,
    "useful": 1,
    "funny": 0,
    "cool": 1,
    "text": "It's a dive bar, it's cheap - and  it can be fun.\nI attended a large company party there - and we had blast - and some folks got good and blasted themselves.\n\nDan is a charmer - and Liz, our server was terrific.\nFood was just Meh, (Extremely salty green beans (frozen), overcooked rice, and average meatballs.\n\nBut dive bars just ain't my thang.\n\nP.S.  They are remodelling soon so it may improve things,",
    "date": "2012-06-22 12:11:09"
  },
  {
    "review_id": "GYd9nzOcj9IaoLEJdB-V_g",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "ePs4Z_Nqsm5-kQk_hAp2Dg",
    "stars": 2.0,
    "useful": 2,
    "funny": 0,
    "cool": 2,
    "text": "Doesn't do a damned thing for me.  But it is CHEAP and you can get sammies, burgers and FRIED pub grub here for a quick lunch or a beer after work.\n\nMaybe I am too snooty-snotty for this, but I am not a fan.",
    "date": "2008-10-28 18:17:11"
  },
  {
    "review_id": "4AvFh8dK-83e-t6jN9-F3w",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "6xMo7GodnX_7OzvIo9WFWg",
    "stars": 2.0,
    "useful": 1,
    "funny": 1,
    "cool": 1,
    "text": "Surprisingly the service we had here (dine in) was good.\nDD - our 8 year old - had a certificate for a free personal pizza for being a good reader in school, so we indulged her and she got a cute (tiny) pie with black olives.\n\nShe was fine.\n\nI tried a pasta dish.\nDrowning in a tasteless greasy sauce.\n\nFail.\n\nIt's not happening again.\nSorry.\n\nIf you like pizza hut pizza - this location is relatively well-run and has a dine-in area that is pleasant.  Order the (grease-laden) pan pizza, bring the kiddies and DINE IN - for fresher tasting pies.\n\nBig flat-screen TVs broadcast \"the game\".\nI guess we really, truly live in the 'burbs now.\n\nYawn...",
    "date": "2012-12-19 11:58:55"
  },
  {
    "review_id": "Ntm2p9_6EQX8khXdtqLRpg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "S7tZmvSqrpH18cDE_fwVgA",
    "stars": 2.0,
    "useful": 8,
    "funny": 0,
    "cool": 2,
    "text": "Love Park would be great save for the numerous homeless and addicts that congregate there.  My little daughter loves the fountain and to run around it and the LOVE statue.  The water in the fountain is seriously gross.  (Probably from said homeless people bething and peeing in it.)\n\nWish Philly could address these types of problems better.\nThere seem to be more homeless and addicts here than even in NYC. (At least here they are more visible and aggressive.)",
    "date": "2008-07-29 15:20:01"
  },
  {
    "review_id": "24cbSg6AHpExyPZ9_8B3eg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "M8LfTMjWxnWHlKdWBR-4jA",
    "stars": 2.0,
    "useful": 2,
    "funny": 0,
    "cool": 0,
    "text": "A dreadful branch of Rite-Aid.\nA neccessary evil.\n\nClueless cashiers - and never enough of them, thus lines form.\n\nThey do have many convenience items, however, so for that - it's OK.\n\nBut this one is truly MEH.",
    "date": "2011-10-26 14:41:24"
  },
  {
    "review_id": "zyXY7wfEYlehnGuBtKXTJA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "AyCgav6b_x0HmSj4T6311A",
    "stars": 2.0,
    "useful": 2,
    "funny": 1,
    "cool": 0,
    "text": "This is not a great place to shop - but sometimes when I need kids clothes in a pinch, it is a convenient place to go.  You really have to search and dig (and I mean really dig) thru the rumpled, disorganized merchandise.  Toddler sizes mixed in w/ babies - oh and there's a size 12 \"big girl\".  What's that doing there?\n\nWho knows.\n\nDon't ask the staff - their not around - only at the under-manned chechouts.\n\nNot a fave - but as I said -in a pinch I can get kiddie stuff here.",
    "date": "2008-12-02 17:53:57"
  },
  {
    "review_id": "GAvK1fbo10CU-Po-jICc0A",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "WglSxOOjnw3pGpHWj6Poag",
    "stars": 2.0,
    "useful": 1,
    "funny": 1,
    "cool": 2,
    "text": "It's not as good as I'd hoped nor as bad as I'd feared.\nPotbelly is a fast-food sandwichs chain with decent prices and an EXTREMELY limited menu.\n\nI had a Chicken Salad salad that was passable.  I had them add artichoke hearts and remove the dried cranberries.\nThough I am not thrilled I prefer it to Quizno's and Subway.\n\nLine moved quickly and servers were well trained and fairly friendly.  (But THAT's because they are new.) I am certain that quality will diminish over time, as most fast food places (and manicure joints) do.",
    "date": "2008-08-11 18:21:05"
  },
  {
    "review_id": "qlmPW0jP-v5CU7afpr6G9Q",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "9kfDDNapNWKF5B41X27HkA",
    "stars": 2.0,
    "useful": 4,
    "funny": 1,
    "cool": 1,
    "text": "While we have gotten some good deals at Best Buy (the chain) - this particular store is NOT fun to shop in.  \n\nCrowded, often Crazy lines, sub-par customer service.\nBut - you can snag a Flat-screen TV, Smartphone, Digital Camera or laptop for a very cheap price here when ther are running a deal.\n\nAVOID at Xmas time.",
    "date": "2010-10-01 18:35:45"
  },
  {
    "review_id": "vpQnEA7ZmrnHVJba-ZGeCg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "eFKG-I-rfuBmzWlDoiZwRQ",
    "stars": 2.0,
    "useful": 5,
    "funny": 2,
    "cool": 2,
    "text": "So disappointed with our take-out order from Chin's - which is pretty much the \"only game in town\" for D-town Chinese nowadays.\n\nThe spare-ribs were burnt and just plain bad - we threw one away (You get 5 for $8/95.  The pepper steak with onion was loaded with onion and very little beef - although what was there tasted great. \n\nThe best part was the house special fried rice - made to order and very good but man, everything else was not great this time.\n\nWhat happened?\nChin's is our go-to and we'd hate to stop going.",
    "date": "2020-01-27 15:30:30"
  },
  {
    "review_id": "Jp0QilAlr3FpyCAgcp3bMg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "6WrsLCTPke9sorKEkmEb-g",
    "stars": 2.0,
    "useful": 3,
    "funny": 0,
    "cool": 1,
    "text": "Finney's is a D-town original - and one of the few liquor licenses in town.\nI \"dive-bar\" feel with lots of regulars some of which have been coming here for 30 - 40 years.\n\nBrings back so many memories.",
    "date": "2011-09-19 14:20:38"
  },
  {
    "review_id": "OgvB1kpmjpk5zjvUtcPfAw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "SCjUeZfjafJ88fWWQjRh2w",
    "stars": 2.0,
    "useful": 4,
    "funny": 1,
    "cool": 2,
    "text": "Not a happy camper.\nWent to El Rey at 4:40 PM - was told no dinner until 5 - but we could have a drink and chips & salsa ($3.50 - very tasty).\n\nI ordered what i always get - the classic margarita.  Ugh - it was so bitter.\nI asked them to re-make it, explaining that it tasted unusually bitter.  they remade it - and it tasted the same - dreadful.  They remade it a second time and it was good - but not the smooth, limey-sweetness that it usually is.  So I drank it.\n\nI got fish tacos ($9 for 3 tacos) and they are the exact same tiny tacos you get for $1 during happy hour - no rice or beans or anything with them.  So I got a side order of corn on the cob (good stuff!).\n\nI am sticking to happy hour here from how on.\nMy husband will stick with Qdoba.",
    "date": "2011-12-19 15:04:51"
  },
  {
    "review_id": "NJmrN7yqUMiBDkki29ULVg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "YDFRwEUdvZNMBlXukCQGDg",
    "stars": 2.0,
    "useful": 1,
    "funny": 0,
    "cool": 0,
    "text": "No good.  The dumplings are doughy and not good at all.\nGet your dumplings from Sang Kee right down the aisle.\n\nWe came here at 5:45 PM (RTM closes at 6 PM) and Sang Kee had already pretty much shut down and the little one HAD to have dumplings and even she said, \"Mommy, I don;t like these.  I want Sang Kee.\"\n\nSmart 5 year old.\n\nThat said, the (female) owner was really, really nice to us.\nIt's a shame the dumplings were so heavy & mystery-meatish.",
    "date": "2010-08-20 19:59:09"
  },
  {
    "review_id": "em3dOPnzt2nz91LZc3ferA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "55WfAHNTRR_GdNB9ko84tQ",
    "stars": 2.0,
    "useful": 1,
    "funny": 0,
    "cool": 0,
    "text": "I was a Big OS catalog customer (website) back in tha day, so I went in to see if I could get some bone-in 14 oz. Strips.\n\nThere were 2 other customers and a delivery man ion the store all waiting to be helpeed.\n\nSo I browsed around a bit and left.\nMeh customer Service.\nI will order online if I need help quickly.\n\nThis location is gonna die.\nHorrible Parking lot.",
    "date": "2014-04-03 15:25:34"
  },
  {
    "review_id": "xI3KV84xnhc5MrvLeyehfA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "IkHWq7zYfptopd9MdzS0eg",
    "stars": 2.0,
    "useful": 4,
    "funny": 1,
    "cool": 1,
    "text": "Nope.\nUnimpressed.\n\nYes, it's inexpensive but you are MUCH better off going 1/2 a block down the street to the Asian (Vietnamese) place or across the street for Oasis Lebanese.\n\nWe stopped in because the Vietnamese place was closed and we figured we'd check it out.  Both of us had $9.95 bento lunch boxes and mine (Salmon Basil) was not good at all.  Frozen and fishy tasting salmon that was DEEP FRIED (Ick.).  I ate the other stuff.  \nMiso soup was fine.  $2.00 up charge for Thai Chicken Coconut soup insteadof Miso (also good).\n\nNot a fan.  Sorry.",
    "date": "2016-06-24 18:29:34"
  },
  {
    "review_id": "2LUiJ9d6m-6tWPdwXS7Wsg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "qEcBKBjkuOCtcPIfcuNEIg",
    "stars": 2.0,
    "useful": 2,
    "funny": 2,
    "cool": 0,
    "text": "OMG - it's still here!\nThis is the Taco Bell from my childhood - and it has been renovated a couple of times since the '90's.\n\nNot a big T-bell fan - but in a pinch, it's here.\nI avoid fast food whenever possible.",
    "date": "2016-07-06 15:11:49"
  },
  {
    "review_id": "Yh3LOLoiuuVq2Lnj_UKihw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "MtVjchWhpvIZjx93nPGNDA",
    "stars": 2.0,
    "useful": 3,
    "funny": 0,
    "cool": 1,
    "text": "This place is kinda depressing.\nServer, Rae, was nice - and attentive.\nPlace was nearly empty on a Monday night.\n\nSalad that came with the meal was pretty bad - lettuce was overly wet, cut into tiny pieces and starting to rust (turn brown).  The 2 slices of tomato and 2 sliced of un-peeled waxy cucumber were at least edible.  The supposedly home-made russian dressing was just awful (thank goodness I ordered it on the side).\n\nThe entree itself was OK - veal francese (I know!  What possessed me -next time, if there is a next time as I am not prone to return, I will get a gyro or pancakes or something \"easier\").  Surprisingly good.  3 stars even - but the salad skeeved me.\n\nUgly interior - but at least they seem to be re-doing the ladies room.\n\nAs I said, I will not rush back.  I much prefer the court diner.",
    "date": "2012-09-11 10:36:34"
  },
  {
    "review_id": "HPNySWseFrhYqYUcEiiR4g",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "MtVjchWhpvIZjx93nPGNDA",
    "stars": 2.0,
    "useful": 3,
    "funny": 2,
    "cool": 1,
    "text": "This place is kinda depressing.\nServer, Rae, was nice - and attentive.\nPlace was nearly empty on a Monday night.\n\nSalad that came with the meal was pretty bad - lettuce was overly wet, cut into tiny pieces and starting to rust (turn brown).  The 2 slices of tomato and 2 sliced of un-peeled waxy cucumber were at least edible.  The supposedly home-made russian dressing was just awful (thank goodness I ordered it on the side).\n\nThe entree itself was OK - veal francese (I know!  What possessed me -next time, if there is a next time as I am not prone to return, I will get a gyro or pancakes or something \"easier\").  Surprisingly good.  3 stars even - but the salad skeeved me.\n\nUgly interior - but at least they seem to be re-doing the ladies room.\n\nAs I said, I will not rush back.  I much prefer the Court diner or the new Aston Diner",
    "date": "2013-03-22 16:26:13"
  },
  {
    "review_id": "gul0fi0AmlMGuD_xdxYzNg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "dXvNGmR8gGmHheK5gLHvkw",
    "stars": 2.0,
    "useful": 5,
    "funny": 3,
    "cool": 4,
    "text": "Meh.xican Post.\nMeh.\n\nBleh.\n\nBlech?\n\nI love the peom the lady wrote.  The service and noise level are just awful.  And yes, this is gringo-philly-mex.  How I miss my Gordo Tacqueria in CA.  In philly I like Xochitl or Tequilas (both are pricey and haute-mex - not taco joints.)\n\nWhen, oh WHEN will we get a good taqueria in Center City?  And, no, Qdoba does not count.",
    "date": "2008-07-10 20:29:43"
  },
  {
    "review_id": "QnJ8iyu9FAuOmyhNB5Fu-g",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "36dU0rj9eoWeInt1OmwYFQ",
    "stars": 2.0,
    "useful": 2,
    "funny": 0,
    "cool": 1,
    "text": "Not as bad as it could have been but not great either.\nI attended a conference here - ate the \"banquet food\" (Meh) in cramped dining rooms (The room downstairs claims to seat 150 and that is too tight.) with disinterested servers who could not wait to finish their shifts and get the heck out.\n\n\"Grab & Go\" breakfast was a joke.  Awful  100% pre-packaged foods.\n\nRoom seemed OK but now I am paranoid about bedbugs.  Surprisingly, bathroom (in hotel room) looked as though it had been renovated.  Public restroom was a high trafic area and needed re-stocking moreoften than it got.\nWill let you know.",
    "date": "2014-05-18 12:35:43"
  },
  {
    "review_id": "9GSaxReahuuTxZUtoVIUTA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "SYWEMv9i_Pmc9AIfxHWl4Q",
    "stars": 2.0,
    "useful": 4,
    "funny": 0,
    "cool": 2,
    "text": "OK - please note that this scathing review (I was tempted to go with 1 star - but I am sure the food is great.) is based on what happened to me here about 3 moths ago.\n\nI pass by Pastoral every week on my way home from Pilates - and one night decided to go in and give it a try.\n\nThe place was dead empty (It had to be a Tuesday ot Thursday - as those were Pilates nights) save for one lone couple having dinner.\n\nI was not greeted and sat myself at an empty table that seated 4 but had 2 places set.  A few minutes later a man chucked a menu at me and muttered something about another person coming (no, just me) and a $15.00 minimum.\n\nI just got really turned off and walked out.  I felt bad about walking out - but he really weireded me out.\n\nSo I never got to eat here and now I know I will never go back there alone.  Maybe if a friend wants to go.  I could use some good Kalbi and Mandoo.\n\nThey treat me nicer at Miran.",
    "date": "2008-10-21 15:56:09"
  },
  {
    "review_id": "pLytYD8l_r14yBPpUHggVg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "8JgUfSS3-m9IRa6q0WkAUQ",
    "stars": 2.0,
    "useful": 1,
    "funny": 0,
    "cool": 2,
    "text": "So far I am not impressed - but I will let you know once I get my ORDER BACK.\nI usually drop my drycleaning off at a place on 452 called Victory - and they have been great - in on Monday, back on Tuesday (They also have same day service but I have not tried t).\n\nThis place - I dropped off on Tuesday and the guy (who was very hard to understand) who was swamped with bags of clothes (Place looks very disorganized), had me type my own name and address into his computer.  (Weird)\n\nThen he said - \"when do you need it?\"  So I said, \"when would it normally be ready?\"\n and he replies, Saturday.  He sensed I did not like that answer and then quickly changed it to Friday.\n\nSo tomorrow is Friday - we'll see if my stuff is ready.\nAlso his prices are higher than Victory.  I doubt I'll be coming back after tomorrow.",
    "date": "2012-12-13 13:43:21"
  },
  {
    "review_id": "m3C0TQeiU2P9WJkX_R4ppA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "VLVUUn_m6QPyblPiwAT5tw",
    "stars": 2.0,
    "useful": 1,
    "funny": 0,
    "cool": 1,
    "text": "This place has never really done it for me - although co-workers like it here and Catering uses them for decent - if uninsprired \"Faux\"-sher (Kosher) sammies.\n\nThe tuna on rye I had was a little dry - which I suppose is better than too much mayo.  (Yick.)  It can get very busy at lunch time.\n\nI did enjoy the pickle assortment - but it still ain't like a real NY deli.",
    "date": "2008-11-13 16:47:15"
  },
  {
    "review_id": "j8cOZyico0sjz_wjM86tRQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "Wbq1ioousibK88FRw3PlDA",
    "stars": 2.0,
    "useful": 2,
    "funny": 1,
    "cool": 0,
    "text": "Absolute mediocrity - but hey, it's cheap and quick.  But - BLargh!  Do not eat the over-salted, plastickly mac & cheese.  Corned Beef is also a salt-pile.\n\nNot a fan - and not goin' back unless dragged (as I was today) by a co-worker.\n\n#BrownBaggingIsBetter",
    "date": "2016-03-04 17:38:59"
  },
  {
    "review_id": "EuWbp7S0jhRCvbkTBM4v_w",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "LA1wLQggh2_aA6f6Wb0vXQ",
    "stars": 2.0,
    "useful": 4,
    "funny": 1,
    "cool": 1,
    "text": "An enormous space that is sparsely populated with hockey gear, skates and accessories (Sadly, no goalie gear).  Also no figure skating gear.  \n\nThey will skarpen skates for $7.\n\nService was icy cold - maybe because I came in alone?\nNot in any hurry to return as I have a figure skater - not a hockey player.",
    "date": "2017-10-23 16:37:06"
  },
  {
    "review_id": "Vp0cDblLB2s9s9LdFyq2gw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "7gyFoLqapUSW94EI6pFekQ",
    "stars": 2.0,
    "useful": 5,
    "funny": 2,
    "cool": 2,
    "text": "I am NOT an Outback fan - and this location is no exception.  I was dragged along for a family birthday celebration - and the person who's birthday it was is on Atkins and can only eat big hunks of meat.\n\nSo here we go - we had a party of 7 - and were seated right away because we can at 4:40 PM - otherwise I can only image how long a wait would have been on a busy Saturday night.\n\nService was absolutely fine - but the ladies room was HORRIBLE.  I told a guy in the bar area about the trash on the floor and they cleaned it up right away.\n\nAs for the \"formulaic\" food - it was edible.  Not good but not inedible.\nI had a rib-eye steak (asked for it without the salt-lick seasoning they usually use - I have learned my lesson from past salt-lick-steak experiences). Added a grilled lobster tail for $11.95.  Seriously?  This this was barely 2.5 ounce.  I could have had a bunch of shrimp for a fraction of the cost.\n\nAnyhow - I also got a naked sweet potato as a side (not brown sugar - and the giant lump of butter came along side.)\n\nOur 11 year old got a salad topped with grilled shrimp (again sans seasoning - as it is just too salty for our family's tastes).  She said - and I quote she felt, \"unsatisfied\".\n\nUnsatisfied - that is just about the perfect way to describe our experience.\n\nBlargh!",
    "date": "2016-08-08 11:50:05"
  },
  {
    "review_id": "09XsiOpsCsJGRoR1bUqf-g",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "cdrMvOVFFBSwYHb3s06U9w",
    "stars": 2.0,
    "useful": 4,
    "funny": 1,
    "cool": 3,
    "text": "Well, at least Philly HAS a SEPTA.  After living in SF, DC and NY it is so disappointing to have such limited schedules and services as in SEPTAS Regional Rail (could they PLEASE add more departures from Doylestown on the R5 during rush hour??).\n\nI also take the Trolleys, Market El and Broad Street Line - and the stink is just horrible.  \n\nI am willing to pay more for better service.  Philly needs it.",
    "date": "2008-08-11 15:13:40"
  },
  {
    "review_id": "kN2b8PPph_pwaL42-AQCFQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "F7Z4T1VO9hlrnSdZU1L80A",
    "stars": 2.0,
    "useful": 2,
    "funny": 1,
    "cool": 1,
    "text": "This location is in the Gallery - so it gets downgraded from the 3 stars I would normally give to an ON by default. The dis-interested, underpaid staff has a distinctly \"ghetto\" vibe here - but all in all you can still get mass-produced, el-cheapo disposable clothing here.\n\nI very rarely get anything for myself at ON - the snooty law firm folks I work with could sniff that out in a minute.  Instead, I lavish my pre-schooler with $5.00 sneakers and 2 for ten jammy sets.  Oh and socks - love the cheap socks.",
    "date": "2008-12-02 17:58:42"
  },
  {
    "review_id": "iihRifj5MYwPxikyBLglEg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "IkY2ticzHEn4QFn8hQLSWg",
    "stars": 2.0,
    "useful": 11,
    "funny": 7,
    "cool": 8,
    "text": "I'd skip Geno's and walk around the corner to Pat's - or better yet - go to Jim's.\nOr Tony Luke's.\nOr Pastificio's for the real deal.\n\nLet me just add that I am NOT a cheessteak eater - I get a Chicken Cheesesteak 'wit Provolone and 'shrooms once or twice a year.\n\nGeno's is filthy and to quote below - the owner is a racially prejudiced \"ass clown\".",
    "date": "2008-08-21 18:34:02"
  },
  {
    "review_id": "24bl9OQY7dnYodoyfrYQOA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "lH_UKAJy6YTa1ArfdACU4g",
    "stars": 2.0,
    "useful": 5,
    "funny": 2,
    "cool": 1,
    "text": "Olive Garden is Faux-talian-American and is really not that great.\nMy inlaws insist on going to chain restaurants like this, Buca di Beppo, Romano's Macaroni' Grill (how the heck do you grill Macaroni??) and other sub-par poser-Talian chains.\n\nMeanwhile, my 3 year old loves it here - so there's no accounting for taste.\nAnd it used to be cheap - but no longer.  I had a so-so shrimp scampi (angel hair here is a definite AVOID - ads it is always overcooked and mushy.) and it was $16.95.\n\nThe unlimited iceberg & white-bread (Oh, sorry, I meant salad & grease-sticks) are a big turn on to college kids and cheap in-laws alike.\n\nFor my time & money - there are FAR better places to go (even in the spectra of Faux-talian chains.) [See my review of Bensi's]",
    "date": "2008-08-12 15:19:47"
  },
  {
    "review_id": "4GYaE2FrSH8RDw1bVADkzw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "-QI8Qi8XWH3D8y8ethnajA",
    "stars": 2.0,
    "useful": 7,
    "funny": 1,
    "cool": 5,
    "text": "What problems!  What hassle - the cecutiry lines are miles long.\nBetter allow for lots of extra time.\n\nThe parking costs a bundle (as with all airports) and once inside the shopping is mediocre and over-priced. ($3.00 for bottled water???)\nThey have you TRAPPED.\n\nSupposedly an airport \"spa\" is set to open.  Maybe that will help.\n\nThe bathrooms also need more frequent cleaning.\n\nAnd don't even get me started about holiday travel.  Ugh!!!!!",
    "date": "2008-07-17 18:39:17"
  },
  {
    "review_id": "SxlnlENM7yPlYlB1gulHEA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "AEhfYqXSFx1EtqI8ajabXg",
    "stars": 2.0,
    "useful": 2,
    "funny": 4,
    "cool": 6,
    "text": "No.\nJust No.\n\nCame here for Dining Under the Stars because we knew they'd have a table (and here's why).\nFood is Meh and service is confused and chaotic.\n\nForgot to write down our order on a check thus we never got a check and had to TELL them what we got.  Then it took a while to actually pay.\n\nMeanwhile people are waiting for our (now coveted outdoor) table.\n\nPad Thai (Chicken) was good - yes, it was.\nTom Kha was average.\n\nBathroom is gross.\n\nThey need to step up their game or they won;t be around many more years.",
    "date": "2015-06-11 02:07:21"
  },
  {
    "review_id": "kgxBFwwJdHC93TQ9s9REbQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "GhLCh9fL9Nc8c33eHszX5A",
    "stars": 2.0,
    "useful": 5,
    "funny": 3,
    "cool": 4,
    "text": "I am not and have never been a 7-11 person, however, I was desperate. Stopped in on a Saturday morning before 9 AM and the place was empty.  Bought a few low carb snack items, paid the friendly (owner? Manager?) cashier and left.\n\nNo issues.",
    "date": "2019-09-14 17:14:41"
  },
  {
    "review_id": "FrzXPyCXoNtirGeNV9ARtw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "RW7UkHeKpG-t7U3GEyyMDw",
    "stars": 2.0,
    "useful": 2,
    "funny": 1,
    "cool": 1,
    "text": "This is a pretty sub-par Rite Aid - but at least it exists.  I was pretty close to giving it 1 star, but decided to be kind.  Disinterested staff, high urban prices.  Needs help, but I am glad they are around in a pinch.",
    "date": "2009-03-17 20:46:20"
  },
  {
    "review_id": "XtjVjGpM6xy9iMorUpmGQg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "w7kKNELhnc00MwPOQhaZpQ",
    "stars": 2.0,
    "useful": 11,
    "funny": 2,
    "cool": 3,
    "text": "Just OK - I had a salad bowl and the cucumber salad and baba ghanouj were fine - the rest (hummus, limp romaine, dry chicken and tough-mediocre \"steak\") was edible but blah.\n\nDo not get the steak.  Not at all juicy.\n\nI love this type of food and have tried 2 other local mini chains Naya and Cava and they were both better than Naf Naf.\n\nI wanted to love it but it is just Meh.\n\nThat said they staff greeted me upon entrance (I came in early before the long-ass line)  and the cashier was very friendly and polite.\n\nMight try it again but might now.",
    "date": "2020-01-23 18:27:20"
  },
  {
    "review_id": "8N1OC7mQmZXVa5b9y2dmZQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "1Cm3f1ys5_sBRUBTFECnww",
    "stars": 2.0,
    "useful": 6,
    "funny": 2,
    "cool": 1,
    "text": "This used to be Genuardi's, now it's a Weis.  It's fine.  Not the worst and not the greatest - still better than Acme and not as good as Giant.",
    "date": "2017-10-23 16:40:41"
  },
  {
    "review_id": "s7ZZxsyG8bwHC3aLF5wUFw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "mE4D25vY8SNxpNOZZtEauA",
    "stars": 2.0,
    "useful": 5,
    "funny": 1,
    "cool": 2,
    "text": "I have come here a few times and on 2 occasion now they have gotten my drink order wrong.\nBoth times they fixed it right away though.\n\nOne time they gave me regular when I asked for decaf and I could feel it right away - wow.  What a jolt!\n\nThe 'Bux in Paoli is way better.",
    "date": "2016-07-08 13:19:07"
  },
  {
    "review_id": "XBoEFE6WOhu3eQ1CMlXDdw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "EFci0tbSrb7wko6tpVDnbA",
    "stars": 2.0,
    "useful": 1,
    "funny": 2,
    "cool": 1,
    "text": "Affectionately known as Charbucks or Fourbucks - we have adopted the slogan of:\n\n\"Friends don't let friends drink starbucks.\"\n\nSave money by brewing at home with Peregrine Coffee (the BEST) or go to La Colombe or Caffeination.",
    "date": "2009-03-03 19:50:50"
  },
  {
    "review_id": "U-agBiRtrwl30U5DEtsuKQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "6ZNKHkXETW26YFMtvWtPrg",
    "stars": 2.0,
    "useful": 0,
    "funny": 1,
    "cool": 0,
    "text": "I loathe fast food - so when my fast-food eating spouse (and newly indoctrinated child) demand frosties - we stopped here.\n\nMy bad.\n\nMeanwhile, the food was (the usual unhealthy) edible.\nThis place is very \"old school\" in decor and could use a makeover.\n\nDo not try the \"new\" homestyle mac 'n cheese - swimming in velveeta-like goo.\nYUCK.\n\nSalad greens were not so fresh.\n\nHamberger was fine (the same ole, same ole).\nOh - and I asked said 7-year-old if the chicken sandwich was better here or at Chik-Fil-A she empatically declared Chik-Fil-A the winner.  But she loves those darned frosties.\n\nFor less than $15 for 3 people to eat?  CHEAP.\nBut - you get what you pay for.  I never recommend eating fast food.\nUGGH!",
    "date": "2012-07-16 13:13:13"
  },
  {
    "review_id": "KcfhZDzPi8g2zPWoC9RDmA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "PGZ7Lufs7wCXitvHPVcYoA",
    "stars": 2.0,
    "useful": 2,
    "funny": 0,
    "cool": 0,
    "text": "Coffee shop - only open in the mornings and early afternoon (thus never whenI am there.)\n\nParking lot is big but fills up EARLY with commuters.\n\nA few benches outside to wait for the train when the station is closed.\nIt's OK.  Just Meh.",
    "date": "2010-10-09 15:59:06"
  },
  {
    "review_id": "SeucourafUUedQVO7h7ZMA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "cM9TAGnowN8fkWXSHOVl1w",
    "stars": 2.0,
    "useful": 6,
    "funny": 6,
    "cool": 3,
    "text": "You can get really nice stones from Blue Nile instead and have your own jeweler set them.  Yes, Tiff's has quality - but you PAY (dearly) and overly for it.\n\nIt's kinda like McDiamonds.",
    "date": "2009-03-04 00:55:00"
  },
  {
    "review_id": "PmIKmTgvWkF9aiNQUFILyg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "v3nYPLm8PkbbtQhsrqTo-Q",
    "stars": 2.0,
    "useful": 2,
    "funny": 0,
    "cool": 0,
    "text": "Not very good.  My daughter ordered take out from here twice - she liked the wings - but now we prefer the Vine Street branch of Wings to Go.\n\nThe salads are not fresh here.  Sorry.\n\nOh - and get to-go (take out) it's depressing to eat here and small.",
    "date": "2012-05-31 13:34:45"
  },
  {
    "review_id": "VSUni6Iz3WKHomT4UgscCA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "gY4kIh8f9uCk-XI0FPH1fg",
    "stars": 2.0,
    "useful": 5,
    "funny": 1,
    "cool": 2,
    "text": "A neccessary evil - especially living in the \"hub\" pf Philadelphia.\nI try to take Southwest whenever I can - but sometimes I gotta do US Air.\n\nCoach is, indeed, horrendous.",
    "date": "2009-03-19 16:19:10"
  },
  {
    "review_id": "KTXs5QVrU20-oK2_RGeerg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "1IegWNVYw_8QHKFhmjPlvw",
    "stars": 2.0,
    "useful": 4,
    "funny": 2,
    "cool": 1,
    "text": "Took my little one here for the $12 haircut.\nWe usually go to the SuperCuts in Philly - different owner/franchise.\n\nThis one the lady did not cut the hair short enough.  I asked for the bangs to be shorter. She told me not to go any shorter because it would be shorter when it dried and would look too short.\n\nSo I trusted her.\n\nI was wrong.\n\nKid looks like she barely got a haircut. Now we gotta go back 2 weeks later.\n\nFAIL.\n\nThank god it only cost $12.",
    "date": "2012-01-06 20:44:48"
  },
  {
    "review_id": "f9l5bYVr-dFD8Mtgy7rL1w",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "mvL5FhxCmZ1Im8lFgMu4fQ",
    "stars": 2.0,
    "useful": 4,
    "funny": 3,
    "cool": 0,
    "text": "Ook!  R.I.P. Naked Chocolate Cafe.  You will be so very missed.  The new posseur in your places is awful.  Bitter coffee drinks.  A gorgeous but stale and hard-as-a-rock cranberry scone.\n\nSo disappointed.\n\nI shall not return. I will be going across the street to Dunkin' for a fraction of the price and way better coffees.",
    "date": "2011-11-06 19:23:55"
  },
  {
    "review_id": "OUWFQa6-pNQTOTQj_gjmDA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "z7bHZCf28zmT9rL0FlBeLA",
    "stars": 2.0,
    "useful": 0,
    "funny": 0,
    "cool": 0,
    "text": "We shopped here but ended up going with nearby Raymour & Flanigan.  Service was friendly enough and the salesfloor was CRAMMED with merchandise - a bit too cramped - so we rested on a couple of recliners.  We were looking for a couch and considered a model with 2 recliners built in.\n\nI dunno it seemed too \"cheap\" in quality and price.  ASo I went with a more elegant piece - still mid price - at nearby Raymour & Flan.",
    "date": "2009-06-08 13:51:45"
  },
  {
    "review_id": "ZVrNphvotWNeQMccJ46Kug",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "bIDyzk1VBkpofSORapAiew",
    "stars": 2.0,
    "useful": 3,
    "funny": 0,
    "cool": 2,
    "text": "This food court used to be much better.  It now has a saladworks, a chinese place, and Italian place, a cheap mexican place and is only open for lunch.\n\nSuper crowded.\n\nI am not a fan.",
    "date": "2009-01-02 14:43:51"
  },
  {
    "review_id": "-5FTUTH99_wnLTBTPixUsg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "KDnsBMAFiaUkol06rXzVNQ",
    "stars": 2.0,
    "useful": 2,
    "funny": 0,
    "cool": 0,
    "text": "Ordered only one thing and it failed.\nI sure hope the sandwiches are as good as they sound on the menu.\n\nSweet potato fries.\n\nSoggy.\nUndersalted.\nBland.\nBlah.\n\nNot comin' back so fast.",
    "date": "2013-06-29 21:16:37"
  },
  {
    "review_id": "3EIe3bJ1LtcifXLVq5IlYA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "0XmjnnJu-offU4n-f9apLQ",
    "stars": 2.0,
    "useful": 2,
    "funny": 1,
    "cool": 0,
    "text": "Oh, poor Mother's.  You are passed your prime.  (And you've been a New Hope Main Street Stale for eons.)\n\nWe used to love brunch and or desserts here - but lately the food is just OK, and the decor (and restrooms) need a refresher.\n\nOh, dear.",
    "date": "2010-02-03 20:23:38"
  },
  {
    "review_id": "6Ij-pdozWjXf6USXBaICbQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "K3lXNfqteOz_ksfqRIkT-A",
    "stars": 2.0,
    "useful": 2,
    "funny": 2,
    "cool": 2,
    "text": "MEh.  Raindrop ar posseur juice bars.  We need more places like they have in NYC that serve organic veggie juices - not slushies that all taste te same and have frozen pineapple in them.\n\nThe wheatgrass here is nit turned over rapidly enough and they have NO grapefruit juice.\n\nIt's what we're stuck with and I am thankful to have them in a pinch, but now... SQUEEZE in Comcast Center is saving my juicy day.",
    "date": "2008-10-03 15:15:43"
  },
  {
    "review_id": "_yp7RqBlfyzAPGc_c7eSjg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "m44uqdqZyz7AQJhcCu7DUg",
    "stars": 2.0,
    "useful": 3,
    "funny": 6,
    "cool": 3,
    "text": "Meh.  I don't do costume.\nSorry.\n\nBut my 4 year old can spend 45-50 minutes in here playing and gawking like a kitten attracted to shiny, pretty objects.\n\nIt's a great way for me to entertain her for a while.\nI'll even occaisionally buy her a trinket here - usually a bracelet.",
    "date": "2009-04-15 15:11:30"
  },
  {
    "review_id": "f_DbFXXOV04ED6NV3GG5XA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "hSeqzTh-gMcl7mAn78fBJw",
    "stars": 2.0,
    "useful": 0,
    "funny": 1,
    "cool": 1,
    "text": "It's kinda dingy-dirty in here - but hey - it's right near the Oreland Train Station and it has cigarettes, cold water & beverages and snacks.\n\nWe really NEED this place - so I hope the owner can spruce in up a bit and re-stock the shelves with less dusty items.\n\nI think they also sell lottery tickets here.\n\nIt's your basic bodega - but in the burbs.",
    "date": "2009-01-05 14:12:52"
  },
  {
    "review_id": "ez1cobbgbUMVAZxZMuXpdQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "X0Dpf6yaN5wfEVcKwB_pIQ",
    "stars": 2.0,
    "useful": 6,
    "funny": 3,
    "cool": 2,
    "text": "It is tempting for me to give a scathing review and few stars to Adsum, but I will preface this review by saying that I ate at Adsum as part of a large group event with a set meal (you can't please everybody).\n\nThat said, even with the limited (and Kosher-style) menu choices, Adsum really needs to ADD SOME (Some food, maybe?) to their restaurant.\n\nI will also qualify my review by saying that the chef is very talented and was so gracious in speaking with our group.  (Why did you give a bunch of pork, clam and sausage (Lamb Merguez) based recipes to a JEWISH group??? Weird.) He really knows his stuff, though.  The service was also good (save for our new - 3 weeks only - server - who made a few bumbles along the way.)\n\nWe started with a choice of soup or salad.  I chose the 100% butter (or is it Bibb?) lettuce salad (absolutely no crunch, kinda limp feeling) with delicious asian pears and honey/cayenne candied nuts.  Crumbled of Maytag Bleu cheese on top and a delicious dressing (Sweet) with black sesame seeds. (This is where our server said they were peppercorns.  Sorry, not true.)\nThe salad - while good in concept was really boring and unsatisfying to eat.   Salade Ennuis.\n\nNow I am hungry.\n\nThe entree was sized like a large app.  3 ricotta filled \"gnuddi\" (Think Gnocchi crossed with ravioli) were delicious sitting atop a zesty lemony-cream.  But the 6 small bites (about 2 per gnocchi) were not enough.  There was also (5 star!) one - just one - fried green tomato presented with an olive oil powder on top.  I got tons of the powder, while my friend next to me had a light dusting.  I think because my tomato had so much powder I could detect a slight \"chemical aftertaste\" from it.  (The \"top note - was great - a dry, green olive oil.)\n\nI would have bet money that somehow liquid nitrogen was involved. I'd have lost money.  They make the Olive oil powder by centrifuging the Olive oil with a malto-dexttin aggregate or something. Maybe that accounts for the chemical aftertaste?\n\nI am getting over the whole \"molecular gastronomy\" fad very quickly.\nI am also not a big lover of sous-vide (so much of it is done poorly), but that is the subject for another review.\n\nThe other entree choice was a single (JUST ONE) deep-fried cod fritter.  Not my bag, baby.\n\nDelicious gnuddi - just not enough food.\n\nNow I am STARVING...\n\nSo dessert comes, and it is GINORMOUS.  (Nice salad, tiny entree, huge hunk of chocolate cake) and so dense and cold and rich you can barely eat it with a spoon. My friend wanted a knife - as did I.)\n\nSo I ate 2 bites of the chocolate cake, and felt my blood sugar spike almost instantly.\n\nNot fun.  I boxed up the rest for my 6 year old to enjoy later.\n\nFor $46 per person??  I guess that's fair - if you had eaten an actual entree. (Salad, app, huge dessert.)\n\nI literally had to eat a bowl of strawberries at 11:30 PM when I got home. I hate eating late at night but I was absolutely famished.\n\nI am very, very disappointed with Adsum.\nThat said - the regular menu (Foie gras poutine?  The SUPER Poutine is like a platter of pure fat in many forms.) doesn't really do it for me either.\n\nSorry Adsum.\n\nFAIL. The 3 stars is so you won't hate me.  I am so tempted to give only 2.",
    "date": "2011-06-15 14:35:43"
  },
  {
    "review_id": "XBpJh3atyA4FsKremaifhg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "9lGiHPSlxVoHk_pA98v4eA",
    "stars": 2.0,
    "useful": 3,
    "funny": 1,
    "cool": 1,
    "text": "Attended a conference here (again) and the conference functions were not adequately stocked with water.  The coffee/tea station was empty within minutes (over 150 people) and never re-filled.\n\n3 stalls in the ladies room is NOT enough for a group of 150.  Many of us went downstairs (to another 3 star facility) and there was a (shorter) line there also.  And they reeked.  Stinky.  Eew.\n\nThat said the food was much improved for our luncheon.\nFree wifi in the lobby area.",
    "date": "2016-05-23 00:07:51"
  },
  {
    "review_id": "T-U4tSNxrn1wldDoZVDdWA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "hNXSodfD9Isrq5McLLzDNg",
    "stars": 2.0,
    "useful": 1,
    "funny": 0,
    "cool": 0,
    "text": "Sorry - but I loathe Cosi.\nYes, it's clean and comfortable to sit here - but the food and that bread are just awful.\n\nThe bread turns to rock after about 90 minutes of exposure to air, and after I eat it my stomach is truly upset.\n\nService is teen-age \"meh\" here.\n4 stars for cleanliness and big comfy chairs.\nZero stars for awful food. A waste of $8.00.",
    "date": "2013-02-10 21:10:27"
  },
  {
    "review_id": "gxYUGW6hwGqWIN5Z_4clJA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "Y5nb6VirTG3CxawdcHBJHQ",
    "stars": 2.0,
    "useful": 5,
    "funny": 2,
    "cool": 0,
    "text": "Decidedly mediocre.  Overcooked salmon atop a boring salad.  Overly salted sides.  Meh. Meh. Meh.  Phooey.\n\nLife is too short to eat formula cookery.",
    "date": "2016-09-05 03:09:59"
  },
  {
    "review_id": "AhmDbnUPSs7bXjmSz7EOXw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "z-2pRvQXAWqcZdLW2fKj9g",
    "stars": 2.0,
    "useful": 14,
    "funny": 2,
    "cool": 6,
    "text": "This is a review for the Deerhead Hot Dogs food truck.\nThe 2 guys working the truck were very pleasant, but FRANKly (pun in tended) they just could not handle our corporate lunch crowd.\n\nI waited 25 minutes for my $7 lobster dog.\nThe lobster was fine but the cheese sauce was awful and the dog itself had been split and grilled - try BURNT to a blackened crisp.\n\nI basically ate some lobster chunks and a tablespoon of greasy cheese-whiz-like sauce for lunch.\n\nBetter luck next time.\nNext time, go to the store - not the truck.",
    "date": "2018-05-16 17:51:48"
  },
  {
    "review_id": "1DlycuHLvuI6JDIHKXtMIg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "yqU9_T4-LedTDPHBuIPlFw",
    "stars": 2.0,
    "useful": 5,
    "funny": 1,
    "cool": 1,
    "text": "Meh.\nUninspired, slightly dry pulled pork platter with a gloppy side of overly-cheesed mac (velveeta?) and a drink.\n\nLuckily, I got a kids meal so it was less than $7 after tax.\n\nPlenty of food in the kids meal - but a waste of Calories.\nFor a bit more money, I'd go to Mission - a bit closer to Plymouth Meeting Mall and spend more to get a better 'cue lunch.\n\nNot in any hurry to rush back.\n\n2 guys running the place were very nice.\nPlace was DEAD (me with a take out and one other dine-in person) at 12:15 PM on a Tuesday.\nNot a good sign.",
    "date": "2017-06-27 16:43:33"
  },
  {
    "review_id": "_KtnHxRxa-s6dj4_8PJdvA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "XokXeGm3Jy-ksFlD7fAjCA",
    "stars": 2.0,
    "useful": 0,
    "funny": 1,
    "cool": 1,
    "text": "2-3 stars.\n\nWhat in G-d's name possessed me?\nI was hungry.  It was 9:30 PM on a Thursday night.\nWhere else could I go?\n\nI sat at the bar and had inattentive service from the 22 year old over-worked, stressed out bartender.\n\nI plowed my way through a very heavy cheese burger quesadilla.  (I felt righteous by not eating the fries.)  I left.\n\nNot coming back unless someone else drags me here.\n\nBlargh!",
    "date": "2014-03-28 02:52:38"
  },
  {
    "review_id": "62jSdlJIJ_XxR41EihDviw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "75pheRYoJf0hdWs9pqLE9A",
    "stars": 2.0,
    "useful": 2,
    "funny": 1,
    "cool": 2,
    "text": "This place is kinda creepy.  It's a luncheonette style counter and serves greasy burgers and junky-cheap lunch food.  I went here exactly once and will never return.  I am tempted to give 1 star, due to the nasty-creepy-skeevy vibe, but I feel kinda generous today so I will give 2 stars.\n\nFood was just Meh. (But it is very inexpensive and quick.)",
    "date": "2009-02-17 21:30:43"
  },
  {
    "review_id": "_jtQENlBex3jrmgtnF6j-w",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "fFY5pda8iTCUQmEfhyMa5w",
    "stars": 2.0,
    "useful": 3,
    "funny": 0,
    "cool": 0,
    "text": "We stopped in last night (a MONDAY) when we discovered that DOMA was closed on Mondays.\n\nI had not been back to Swanky Bubbles in about 2 years - and things are not nearly as good as I remember.  The prices are higher, the sushi is \"meh\" and the lobster/crab mac 'n cheese tasted fishy and reminded me of a $24 tuna casserole.\n\nThe $8.00 4 piece \"Rain Forest\" roll (vegetarian) came with a wasabi cream that I swear was whisked wasabi mayo.\n\nMeanwhile food was a 2 star and service about 4.\nDave, the bartender was a swwetheart and treated our 5 year old like a princess.  She loved her (bland) lobster maki.\n\nThe best part?  Delicious chocolate fondue.\nA downer?  STALE poundcake chunks and tasteless melon balls (who puts melon in fodue?  Some pineapple would have been nice.)\n\nNext time we'll probably go elsewhere.",
    "date": "2010-06-22 16:35:10"
  },
  {
    "review_id": "xsDHI4ozowwWaet1NWsWwQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "Rt-J208w2fzPit4QZhwlVA",
    "stars": 2.0,
    "useful": 0,
    "funny": 1,
    "cool": 1,
    "text": "Yuck.  Sooooo not my thing.  I can kinda-sorta deal with a plain turkey sub on whole wheat.\n\nThere is little nutritional goodness to be had here.  I simply hate fast food.\n\nBut it is cheap.  (You get what you pay for.)",
    "date": "2008-08-11 18:09:20"
  },
  {
    "review_id": "rmQKa6K0KwcPvq1TPwMyxw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "XokXeGm3Jy-ksFlD7fAjCA",
    "stars": 2.0,
    "useful": 1,
    "funny": 3,
    "cool": 0,
    "text": "Crapplebee's.\nMy 9 year old loves it here - and thus, we sometimes go.\nOddly enough her 9 year old BFF's fam loves it here, too - so again - we are dragged here.\n\nThe service is actually pretty good if you come at an off- peak time (Crystal is a lovely server).  The food though?  Ech!\n\nThe kiddo & I shared a Two for $20 deal and I added $1 extra to get the 7 oz (tiny) steak.  I asked for it rare and it had absolutely no flavor other than salt.  The steamed white rice and brocolli were sitting in a pool of water on the plate.\n\nBlech!\n\nThe overly fried and greasy boneless wing app drenched in a sticky-sickly-sweet sauce was all I ate and that was bad enough.\n\nLord help us!\nThere are so many better places to eat.  I only come here under duress.",
    "date": "2014-06-23 14:00:07"
  },
  {
    "review_id": "pOiTbJNZeiozQBDRUZHidg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "J7-mw216H21rjz-E71wX-A",
    "stars": 2.0,
    "useful": 3,
    "funny": 1,
    "cool": 0,
    "text": "Sorry.\nWanted to love this place but my 8 year old and I walked in - to a dead-empty store.\n\nThe doors were wide open on a sultry summer weekday afternoon and the shop is beautiful and the coolers were stocked with roses, iris, white hydrangea and stock.  Lovely.\n\nNo staff to greet us.\nPlace looked deserted,\n\nSign on the wall says \"Nobody EVER gets to see the Man Behind the Curtain\" (or some similar quote from the \"Wizard of Oz\").\n\nWe called out, \"Hello?  Hello?\"\nNo response.\nSo we walked out.\n\nWe'll try again another day and update this review accordingly.  I would like to have a relationship with a GOOD local florist, as Kremp's handles my Bucks County and Center City needs.\n\nI hope Media Florist is up to the challenge!\nThey do have staff, don't they?",
    "date": "2013-07-29 14:55:00"
  },
  {
    "review_id": "2sVLS_XAFioWTxVgYhsgyg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "GP0K5RlP2_6eTYgtLCuy_Q",
    "stars": 2.0,
    "useful": 2,
    "funny": 4,
    "cool": 0,
    "text": "ook!  Alex - you write well but this Kmart is NOT 4 stars.  No way.  1 or 2 max.  Dirty, disorganized, and disinterested underpaid staff.\n\nNot a fan - but I have come here in a pinch for household goods.",
    "date": "2013-05-03 17:05:00"
  },
  {
    "review_id": "ugYbPUCsy8wOoFYGUlbbCg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "GP0K5RlP2_6eTYgtLCuy_Q",
    "stars": 2.0,
    "useful": 1,
    "funny": 3,
    "cool": 1,
    "text": "1 or 2 stars tops.\n\nThis K-Mart is so \"ghetto\" and the people who work here?  Well, don't even bother to TRY and get help.\n\nIn a dire emergency I have come here twice - once to get basic paper goods and cleaning supplies and once to TRY to see if they had any decent toddler clothing.\n\nI really try to avoid coming here.\n\nLong lines at the check out, too.  Could somebody please WORK here?  None of the employees do any work?  They stand around and chit chat while we all wait in the line.  Do something!  Open another register.\n\nPu-leeze!",
    "date": "2009-02-18 19:07:50"
  },
  {
    "review_id": "Cxd0G0HyoikzLNiwFrH2wA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "4nM1WMeq6pGJWAYSFnnNnw",
    "stars": 2.0,
    "useful": 8,
    "funny": 5,
    "cool": 1,
    "text": "Ook!  Really?  My kid's friends (and their parents) all love it here - but i just don't get it.   Strip mall decor and \"meh\" service with bland pizza on a too-thick (for me) flabby crust that does NOT taste like NYC pizza one bit.\n\nI have had better at Season's!  (And worse, too - to be fair).\n\nMaybe the non-pizza items are better?  But I am not rushing back to try again.\n\nNot impressed, Pappone's.",
    "date": "2015-09-30 12:06:02"
  },
  {
    "review_id": "eIDueUZr5fvRRNriwubbpw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "MfKScMsPZfE66VQ1CsbS0A",
    "stars": 2.0,
    "useful": 6,
    "funny": 5,
    "cool": 5,
    "text": "I only eat at Chili's when my friend (who loves it - why, I will never know) drags me here.  So last night we dines here - my first time to this location in 8 years.  We got the 2 for $25 - shared an app of onion petals, I had baby back ribs and she got chicken fajitas.\n\nDessert she took home - we were too full to eat it.\n\nThe best part?  Dinner for 2 with tax, tip and 2 soft drinks was $40.40.\nThe worst part?  That food is so salty - it's like a sodium bomb.\n\nKudos to our server Mahnyah who was working her tail off - she was so friendly and great - unlike the aloof and disinterested hostesses.\n\nThe service here in general needs an upgrade.\n\nAvoid if possible and take your blood pressure meds.\nChili's is not for me!",
    "date": "2020-02-04 13:00:38"
  },
  {
    "review_id": "oWkijTiIhG8KDiCx9Hxf1g",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "YfGVsl-8YUcTmtNI0jQfhQ",
    "stars": 2.0,
    "useful": 5,
    "funny": 0,
    "cool": 1,
    "text": "I am fairly certain this is the correct location of Papa John's that we order from.  My 6 year old loves the plain pizza here and pepperoni.\nI find it to be cardboard-like with plasticky cheese.  And a weird garlic margarine comes with it.  Eeeew.\n\nShe hates the sausage and finds it \"too spicy\".\n\nMeanhwile I am unimpressed - I ate a salad.\nThankful they deliver, though.",
    "date": "2011-07-04 19:09:18"
  },
  {
    "review_id": "TPzbDDGNx10HWUHG8heLVA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "VacS9fgNkuZ3gDqDHViKuw",
    "stars": 2.0,
    "useful": 4,
    "funny": 2,
    "cool": 0,
    "text": "Well, the Boat House has clearly \"jumped the shark\".  It's hey-day long over, fading decor and aging facilities along with a \"typical\" fried-seafood menu.  (Bar food with shrimp, fish and clams added.)\n\nService was fine - but we were asked if we wanted to eat on plastic plates because - as our server mentioned - \"The Dishwasher isn't doing his job\".  Eew.  So we opted for the disposable plates.  Weird.\n\nRumor has it this place is closing soon - and I can certainly see why.\nI would never go back here.\nPerhaps years go this was a \"happening place\" but not any more.\nRest in piece.",
    "date": "2016-06-01 12:10:29"
  },
  {
    "review_id": "tl_Z-7I5dqpwAiGDJ1zJ_g",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "p0Sl_o64n-2l2pxiG489AA",
    "stars": 2.0,
    "useful": 8,
    "funny": 1,
    "cool": 1,
    "text": "So awful it makes the Warrington Chuck E. Cheese's look like paradise.\nWe had our DD's 4th birthday party here about 2 years ago, and came back here on July 2, 2011 during the July 4th weekend madness.\n\nAfter trying unsuccesfully to use the broken credit card machine to pay for $10 worth of tokens (There was a long line for tickets and tokens)  I succumbed and boought them at the counter.\n\nIt was DEAFENING in there and 3 of the machines DD tried to play were broken.  The manager was summoned and agreed to give us a refund.\n\nNot happy!\n\nFortunately my kid will grow out of this phase of life very soon.\n\nAVOID on holiday weekends!\n\nGiggleberry staff:  FIX YOUR MACHINES!!!!",
    "date": "2011-07-04 19:06:21"
  },
  {
    "review_id": "QDXBj7mi6zBS8f1GgpMCiA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "AG8L1ytgr6t_QNquAVhKRw",
    "stars": 2.0,
    "useful": 0,
    "funny": 1,
    "cool": 3,
    "text": "Holy smokes, it's hot as blazes in here!\nAll those freezer cases in a tiny cramped (dirty) space.\n\nService is slow as molasses - but they are trying.\nFor Dining under the Stars - they had ONE person in addition to the kind but over-worked owner.\n\nCash only.\n\nMeanhwhile my year old ADORES this place.",
    "date": "2015-06-11 02:11:09"
  },
  {
    "review_id": "ETo6MTqlZ3yTp6Epq2GsCA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "fT3_46O5Ei9_BcPlVfYufQ",
    "stars": 2.0,
    "useful": 0,
    "funny": 0,
    "cool": 0,
    "text": "We've stopped in here a few times to grab sodas (and gas - but we usually go to a different place for cheaper gas).  It sure ain't Wawa, but it's nice to have it around when you need it.",
    "date": "2010-09-10 17:56:41"
  },
  {
    "review_id": "z1Y0fdkyiVooIFSPPlxlbw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "ikqbPYXQNLIvfz0kymBnJA",
    "stars": 2.0,
    "useful": 5,
    "funny": 2,
    "cool": 3,
    "text": "They still serve the most awful, bitter tasting olive oil to dip the bread in.  Don't do it!!!!\nOur server was sub par - and dod not get us items like napkins/cultery, sweetener (for my $3.75 teeny-tiny cappucino) until asked.\n\nFood was OK - but so SALTY - seriously, people - tone it down (the meatball \"small plate\" and pasta sauce are over salted.)!\n\nNot a fan - and not rushing back here.",
    "date": "2012-11-18 18:53:03"
  },
  {
    "review_id": "K52fk-XPX7szAzkBH1daZA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "5ebgEvBg1-harVzszDA02g",
    "stars": 2.0,
    "useful": 2,
    "funny": 1,
    "cool": 0,
    "text": "Why oh Why do i keep coming here?  The service is painfully slow - and there were only 2 people in the line (one lady ahead of me and then me).  It took about 7 minutes to get a toasted bagel with butter.\n\nAnd I asked her to cut it in half (sometimes they do, sometimes they don't) and when I got to my office - not cut in half.\n\nAnd Britney (sp?) the morning cashier is soooooo not into working.  You can tell she'd rather be elsewhere.\n\nOh - and a bagel with cc and (g-d forbid) tomato is over $3.00.\n\nYOUCH!\n\nNot gonna come back for a while.  It's a shame because 2 of their bagel flavors (Rosemary Olive Oil and Cinnamon Sugar) I find very good.  A whole lot better then the rat-infested Au Bon Pain down the block.\n\nPlease step up your service and lower your prices (even by 10 cents would help).",
    "date": "2012-04-13 16:50:38"
  },
  {
    "review_id": "Ytkrn1XKbyADTpWtSCyq_w",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "ZzCcljlsQco6WsRDGaV8mQ",
    "stars": 2.0,
    "useful": 3,
    "funny": 1,
    "cool": 0,
    "text": "I have definitely had better - this place is a mix of Halal, Fried CHicken, Pizza and Indian dishes and seems to get none of them quite right.  Very cheap - $6 for lamb platter over rice - but lamb was dry and stringy.\n\nI may try again - but not rushing back,",
    "date": "2016-02-08 17:57:36"
  },
  {
    "review_id": "tT4s5DTogbOUQTkm48o-Mg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "gTngUtxN2GMkpPN4JyDWKg",
    "stars": 2.0,
    "useful": 3,
    "funny": 3,
    "cool": 1,
    "text": "It's OK - as Kmarts go.  I am glad its around though - for cheap kids clothing, pullups and paper products.\n\nIt's kind of an emergency only place for me.\n\nAgain, as Kmarts go this one is clean and relatively well staffed.  They also were very nice about accepting a product return we had one time.  We used to stop here more when the SuperFresh was open in the same strip mall, but alas, the Superfresh has closed.",
    "date": "2009-07-14 13:21:17"
  },
  {
    "review_id": "cvp9o9Dsj93WmG7aGIOVWQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "AJVC1NajfZaeikl3jD933Q",
    "stars": 2.0,
    "useful": 4,
    "funny": 4,
    "cool": 2,
    "text": "Just not my bag, baby.\nFormula cooking by disinterested college kids - wearing \"flare\".\n\nSo not my thing.",
    "date": "2009-05-08 14:12:46"
  },
  {
    "review_id": "QGAcpG2ZtcUtGsi8A0y5pg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "0LuNIBiqt24Tv49aWc8AFA",
    "stars": 2.0,
    "useful": 6,
    "funny": 0,
    "cool": 0,
    "text": "It's OK - the one in Doylestown (not the same owners - at least i don't think so...) is better.  Allessio had italian sandwiches, salads and pasta dishes.  It is right on 611 and the traffic to get in & out can be tricky.\n\nIt's really not that good.  It's also quite affordable.\n\nSorry.",
    "date": "2008-07-17 15:54:17"
  },
  {
    "review_id": "pHc2nR99SWlIj-ad3nqxUg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "R-OvuW9vK3_hPJTN9WetDA",
    "stars": 2.0,
    "useful": 3,
    "funny": 0,
    "cool": 0,
    "text": "I do not like this chain at all!\nThis one is marginally better than the hellish one in Doylestown.\n\nThe Gyro is a joke.\nThe tortilla I had was cold.\n\nNot good.\nChipotle and Qdoba are better for \"fast food Mex\".\n\nUck!\n\nCool things:  Cheap prices, wall of hot sauces and \"mix your own\" soda flavors.\n\nOtherwise - I'll pass.",
    "date": "2012-01-20 20:00:44"
  },
  {
    "review_id": "Gdf-5o2ohNHg3J8b4aoyJQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "G_VpU7J9do8ZRCLIblDBZA",
    "stars": 2.0,
    "useful": 3,
    "funny": 0,
    "cool": 1,
    "text": "Had a very mediocre $13 lunch here.\nIt was summer - so the place was nearly empty.\n\nAge-Dashi Tofu was cut into 2 HUGE chunks and swimming in dashi.\nThat was (sadly) the best part of the meal.\n\nBeef Bi-Bim Bap had very little meat that was nearly flavorless. \nNot great at all.\n\nWill not be back.",
    "date": "2012-08-07 12:48:53"
  },
  {
    "review_id": "vr3AM0OyBn-OH41VXj6Epg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "PD04fmtEtVdiXRYl6hEorw",
    "stars": 2.0,
    "useful": 3,
    "funny": 0,
    "cool": 1,
    "text": "You're kidding? Far from as good as it gets.\nThis store is disorganized and often out of stock of the MSM/Chondroitin supplements I buy.\nPrices are high (except during an amazing 30% off everything in the store event that was great) and staff seems disinterested.\n\nMessy floors. Please sweep them.\nPlease re-stock your shelves.\n\nThe good part?  They do have alot of the things I need - like Eukaneuba Small Breed Dry food and the aforementioned Joint Care supplements.\n\nNot my favorite pet store - but it is closets to my home and I am thankful they are here.",
    "date": "2014-07-25 13:20:15"
  },
  {
    "review_id": "B3sJc-fSm6xjhowNEhvWSQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "q3Bm2CHAVRBFw8Pqji2zQA",
    "stars": 2.0,
    "useful": 5,
    "funny": 1,
    "cool": 0,
    "text": "Very Upset.\nSince my initial review - which was terrific - we have been here several times.  Each time the food quality was a bit worse - maybe 3 stars.\n\nBut this last time - now I am so angry,\nI cam in at about 4:15 PM and was hungry so I got 2 garlic knots to go for my kid and asked the (albeit young and feisty, but apparently clueless) counter gal how much a side order of the chicken tortellini would be.  She said $2.99 and I said \"fine\".\n\nGot to the cashier (same manager guy as before) and he rings up my order at nearly $7 - and I'm like \"What??\".  He says it's $4.99 for the chicken tortellini.  I reluctantly agree and pay for it.\nI sit down and start to eat it and it tastes slightly sour.  Then more sour.  I threw half of it away and walked out.\n\nI will not return unless my kid demands it.\n\nI bet that had been sitting out since lunchtime - and shame on me for ordering it.\n\nNOT COOL, Bravo Pizza.  Not cool at all!",
    "date": "2015-09-22 13:39:09"
  },
  {
    "review_id": "LpjR8vxcJq91GR1DzOq_uw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "_I9SL8ycMEJBJiV4bGYPnA",
    "stars": 2.0,
    "useful": 2,
    "funny": 0,
    "cool": 1,
    "text": "Not nearly as bad as I had feared.\nRoom was satisfactory.\n\"Hotel\" Food at the event I attended was fine.  Not awesome - but perfectly good.\n\nCheck-in/out went smoothly.\n\nThey even have an indoor pool (wish I had known - I did not bring a swimsuit).\n\nI stayed here for a corporate event, otherwise would not have picked this location.\nFemale bartender in \"Blue\" lounge was a doll.\n\nOh - a BIG thing - please fix:  NASTY SMELL in lobby and elevator.",
    "date": "2012-05-19 13:16:06"
  },
  {
    "review_id": "wqcC_xR207iMRGogJyI3iA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "6mqfUzxWRBnFErvwV0z3aQ",
    "stars": 2.0,
    "useful": 4,
    "funny": 2,
    "cool": 1,
    "text": "It's just too darned expensive.  Yes, they have nice clothes for babies and kids.  Yes, they have cute gift ideas and upscale toys.\n\nNo I will not spend $256 on a wooden rocking horse nor will I spend $54 reduced from $180 on a bikini for a 2 year old.\n\nSorry.",
    "date": "2009-01-05 19:59:07"
  },
  {
    "review_id": "dDBJaQRCCPBT2THvHk_02g",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "vkFyV7uIbd_VzbWS793lsw",
    "stars": 2.0,
    "useful": 0,
    "funny": 0,
    "cool": 0,
    "text": "TCT. (TCCT)\nTypical Chinese (cheap) Takeout.\n\ngreasy, fast, inexpensive - especially for lunch specials - I had Tofu w/ Mix. Veg. - light on the sauce which was a smart move.\n\n2 Spring rolls (grease fest) for $1.85.\n\nDesparate times called for quick lunch.\nThis place looks like it has been here for years - and could use a new menu board (pictures are ancient) and a good cleaning.\n\nTake out only - or eat on one of the 2 greasy tables..",
    "date": "2014-03-11 16:41:46"
  },
  {
    "review_id": "d056CiabZciNxH0wZyfsZw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "w9GGB7vFK6jgReDykEwhqQ",
    "stars": 2.0,
    "useful": 11,
    "funny": 5,
    "cool": 6,
    "text": "Mediocre food and truly awful management.\nThere was a private event upstairs and we were told TWICE that all ages were welcomed - but it is a BAR and 21 and under are not allowed upstairs.\n\nWe wound up dining in a booth downstairs and our server Cindy was the best part of the night - she was terrific, but the manager?  Just awful.\nSo rude.\n\nIn the mean time the $8 chicken fingers and $5 side salad were fine.\nNothing to write home about,",
    "date": "2018-10-31 18:02:25"
  },
  {
    "review_id": "UG20jg03hVuMH1c2Qg8Slw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "HP8kVUCXWR7m5S8GXSKh7g",
    "stars": 2.0,
    "useful": 7,
    "funny": 3,
    "cool": 4,
    "text": "Nope.  Tried again as my 13 year old loves it here and loves Poke and Sashimi in general.\n\nFish is just not fresh enough and the $8.95 \"regular\" sized bowl has so little fish anyway.  She got salmon and added avocado ($1 extra).\nThe greens are not my favorite - I like romaine over spring mix, but most people disagree.\n\nAnyhow, I will not return for me but if kiddo wants it, I will get it.\n\nUnsatisfied.\n\nAlso - it was so LOUD in there I could barely hear myself think.\n\nGet takeout.",
    "date": "2018-09-17 13:14:15"
  },
  {
    "review_id": "19RwjTYpErdDXoiEiMHRdQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "jVtoisBOkIE0xCEkrGaA3w",
    "stars": 2.0,
    "useful": 7,
    "funny": 0,
    "cool": 1,
    "text": "Meh.\nSmells like faint cigarette smoke with artificial rose air freshener sprayed over top in the hallways (fortunately room smelled ok).\n\nVery dark, dated looking rooms with dark brown furniture and fixture.\nClean bathroom.  No major issues.\n\nCheap.\nHard to access (on a busy divided highway) but close to Longwood Gardens, Brandywine Museum and other area attractions.\n\nMeh.\n\nNot horrible but not great.",
    "date": "2016-08-03 12:34:21"
  },
  {
    "review_id": "d-03DkwdPtc0CkFdQIAyhQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "JcVEMcSdNJA-qJClXqsTqA",
    "stars": 2.0,
    "useful": 2,
    "funny": 2,
    "cool": 1,
    "text": "Incredibly mediocre.\nI have never been an Uno fan - but recent visits (dragged there by my chain-loving in-laws) were surprisingly good, at the Warrington, PA location.\n\nToday's early lunch with a co-worker was a last minute decisions and the place was nearly empty when we arrived at 11:40 AM.  Even still service was painfully slow.\n\nWe both ordered off the \"super fast\" (10 minutes or less) lunch menu and both ordered nearly the same thing - salads with 2 sliders. After about 13 minutes we got fidgety, and finally EVERYTHING came out at once.\n\nSalad was on rusty lettuce (I opted for the Garden Salad as I feared the Caesar would be only romaine and croutons) with ONE tomato wedge and ONE Slice of cucumber.  Oy.\n\nSliders were OK but VERY salty (due to the cheddar cheese).\n\nWould NOT order this $7.99 deal ever again.\nServer admitted to us she was exhausted from the night before.\n\nSorry, UNO, today's lunch was a fail.",
    "date": "2015-07-27 17:07:06"
  },
  {
    "review_id": "XEgL_6tTXPIKPG5s5A5qsw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "gdyMIBAitsQubj0OEJoiMg",
    "stars": 2.0,
    "useful": 2,
    "funny": 2,
    "cool": 2,
    "text": "Totally average.  Not clean, not dirty.\nNot good, not bad.\nNot tasty, not yucky.\n\nJust \nPlain\nMEH.",
    "date": "2008-10-01 18:26:15"
  },
  {
    "review_id": "Pxvs0SxdBMU1Ma20SrJ3Dg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "WxB8498ejPtHE7wFa89_fA",
    "stars": 2.0,
    "useful": 9,
    "funny": 9,
    "cool": 8,
    "text": "Was dragged here by a rich coworker who \"just loves\" it here. Blargh. My $14 salad was just ok at best and they have no creamy dressings, only 1001 vinaigrettes. Yes, they are house made, but I wanted a non vinaigrette.\n\nThe lettuce mix was very cabbage-heavy. \n\nMy lunch turned out to be $22 including tax and tip and it was unsatisfactory and unsatisfying. \n\nSo upset.",
    "date": "2019-11-21 22:07:47"
  },
  {
    "review_id": "gYZzZlYJZPcLs5OkuWCBBw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "b-tkLHoLjOxFBBewAOhn4Q",
    "stars": 2.0,
    "useful": 1,
    "funny": 3,
    "cool": 1,
    "text": "A total dive - with decent (mediocre) greassy, fairly thick-crusted, Neapolitan-style pie.\nIt was one of the FIRST original pizza joints from \"back in the day\",\n\nBelieve me - back then they were awesome - simply because the choices were so very limited.\n\nSo anyhow, I am glad they are still in business - but somehow I can't believe that they are.\n\nA MAKEOVER is needed. Stat.",
    "date": "2010-09-09 18:01:54"
  },
  {
    "review_id": "JHe2_duj8czXmjby6fsj0A",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "BIxkykL8meGkcNszRNWSyA",
    "stars": 2.0,
    "useful": 8,
    "funny": 3,
    "cool": 4,
    "text": "I was thrilled to see my local Giant (in Aston, PA) carried Talluto's frozen beef ravioli and I caved and bought a dozen (1 box) for $7.99.\n\nThey were so salty (570 mg of sodium per 4 rav serving) the filling was nearly inedible.  I ate the pasta (tender yet firm and so good) but de-filled them.\n\nSad.",
    "date": "2020-06-30 18:36:00"
  },
  {
    "review_id": "gJLddvvWzyyx62RFaBF9gQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "qd0boC38gSOci6LRS67akw",
    "stars": 2.0,
    "useful": 6,
    "funny": 2,
    "cool": 3,
    "text": "Ate here out of desparation and a lack of knowledge.\nMediocre at best.  Overly salt and fat laden garbage.\nHey, it's inexpensive and very filling - and many people love it here - but I just don't.\n\nNope.\n\nNever again.",
    "date": "2017-05-25 16:33:49"
  },
  {
    "review_id": "-WgxxETc9fKMwJX7Y7UQmw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "WxB8498ejPtHE7wFa89_fA",
    "stars": 2.0,
    "useful": 2,
    "funny": 1,
    "cool": 0,
    "text": "Very disappointed in the flavorless, dry black quinoa salad that set me back $10 for lunch.  Also had an OK $3.00 Arnold Palmer.  The quinoa salad at Pure Fare (and even the frozen Quinoa Bowls I get at Whole Foods) are far superior and cheaper.\n\nNot a fan of this place any more.\nOver-priced and not that good.\n\nI should have stuck with the green submarine (glad it's still on the menu).\nSkip this place and go elsewhere for a better lunch for less money.",
    "date": "2013-03-04 13:07:09"
  },
  {
    "review_id": "BrfgWIIcSJA4MgGnlxORLA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "4GdE_b0FQdjEyZQQuiEyPw",
    "stars": 2.0,
    "useful": 6,
    "funny": 1,
    "cool": 3,
    "text": "I'm sorry but I hate shopping at this Acme, and Acme in general.\nThis branch is near the old Granite Run Mall - now a construction site for a new shopping center.\n\nWhile I am happy to see that Acme employs disabled people, the check out lines are painfully, painfully slow.  Freindly, but slow.\n\nSelection is average.\nCleanliness just average.\n\nNot my go to.",
    "date": "2017-12-14 14:50:01"
  },
  {
    "review_id": "4LwRLnKBoIg7ttqxxwvU2w",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "b6LAC6kEj3F7SgDzlVuCpg",
    "stars": 2.0,
    "useful": 12,
    "funny": 5,
    "cool": 5,
    "text": "After reading these reviews before my stay (I could not change locations due to an event I was attending at the Crowne Plaza) I prepared for the worst.\n\nIt was not nearly as awful as I feared BUT  (there is a big butt!)...\nWhile the room was clean-ish (I brought my own pillow and case) and did not skeeve me out too badly, the communal restroom on the lobby level is awful.\n\nThe entire foyer of the \"Grand\" ballroom (it ain't so grand) smelled like sewage.  When we complained a commercial grade air-freshener was sprayed make it smell like...  Sewage and Air Freshener.\n\nI was astounded at the number of high school proms, weddings and corporate events that are held here.  The place is truly bad.\nNo way I would book my own event here.  And no WAY I would get married here.",
    "date": "2018-05-20 13:57:45"
  },
  {
    "review_id": "bGOFzqWz5xYMPT2Eh8NRfQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "UXxSs2c2r0WT_zkWzFJ9cw",
    "stars": 2.0,
    "useful": 4,
    "funny": 2,
    "cool": 2,
    "text": "Bad. Bad. Bad.\n\nIn fact, I have been to (another) Champps before - and I knew it would likely be bad - but a co-worker wanted to come here so I reluctantly agreed.\n\nWe were \"greeted\" (sighed at) by 2 very surly hostesses.  The place was nearly empty at 4:50 PM on a Wednesday night.   One of the hostesses led us to a \"high top\" in the noisy bar area (Noisy from TV's blaring - very few customers).  We asked to be moved to a \"regular\" table in the dining area and she shot us a dirty look and then led us over there.\n\nHorrible service by the hostesses.\n\nMeanwhile, our \"jolly\" male server was quite good.  We ordered lunch portions (even at dinner time!) of the cobb salad and iced teas.\n\nSalads were fresh but \"blah\".  Not great and not bad - but very low on the protein (Chicken, Shrimp or Salmon).  I upgraded to shrimp for $2 and got about 5 medium sized shrimp.  I wished there were more.\n\nThe lunch portion is, indeed, small.  I left hungry, unsatisfied and felt the entire place could use a good cleaning (Carpets are grungy, bathroom was filthy and toilets do not flush properly.)\n\nThe teenagers running the place do. not. care.\n\nUninspired.  Uninspiring.\n\nAvoid.",
    "date": "2017-01-19 12:53:00"
  },
  {
    "review_id": "79yl9QOkbbqkQTvOhhyjUA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "pS6Jg31NbVVlRvFWz39j8A",
    "stars": 2.0,
    "useful": 2,
    "funny": 0,
    "cool": 0,
    "text": "My 8 year old avid crafter loves Michael's, AC Moore and JoAnnes Fabrics - and we visit various locations of each.  This one has Deplorable service.  (Average for cleanliness and variety/price of items - but Non-existent service).\n\nThe manager had no idea what \"washi tape\" (crafting/scrapbooking tape even was and said that they did not carry any \"colorful\" tape for scrapbooking - only clear tape - but she said we could \"try in aisle 3 A\" - so we did and there was a HUGE display of tons of the stuff - so we snapped up a few rolls.\n\nOdd, odd, odd place.\n\nBut they're near our home - so w'll be back.",
    "date": "2013-04-15 02:24:00"
  },
  {
    "review_id": "ULWgyFEFDTapXy4mYZVBzQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "5e6Kf-t6_6CxhZrtTDy-7A",
    "stars": 2.0,
    "useful": 10,
    "funny": 4,
    "cool": 1,
    "text": "Horrible service, filthy bathrooms, mediocre food and just not worth it in any way.\n\nPerhaps I should give them 1 star but the side order of brussels sprouts was good.\n\nThat ladies room was so nasty - they floors were awful and 2 toilets were clogged.\n\nYick.\n\nI have lost my appetitie.",
    "date": "2020-01-03 13:14:57"
  },
  {
    "review_id": "N1Ip53Uk2ce9XuhAESu0KA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "4GdE_b0FQdjEyZQQuiEyPw",
    "stars": 2.0,
    "useful": 12,
    "funny": 5,
    "cool": 6,
    "text": "It's still bad.  Service is so slow. Prices are better at Giant.\nBetter meats at Acme though - but the produce is pricey and \"meh\".\n\nI shop at Giant in Aston, Trader Joe's, Whole Paycheck and Gentile's for Produce.\n\nAcme is a last resort and everytime I shop here it's out of desparation (Acme is the closest grocery store to my house.)\n\nThat said, when my kid was little they let her girl scout troop sell cookies here and Giant wouldn't.\n\nThey employ great people with diabilities but my inner-Manhattanite can't handle the slow, slow pace.\n\nNot a fan of Acme.",
    "date": "2021-08-04 13:31:15"
  },
  {
    "review_id": "-HpUS2qQYnnqw90hGPOZ_g",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "WIfL5FlNJIjlN4gixWzDoQ",
    "stars": 2.0,
    "useful": 1,
    "funny": 2,
    "cool": 2,
    "text": "I think I am too old to even be allowed entry to H & M. \n\nThis is the epitome of disposable fashion.  Cheaply made, inexpensive clothes for YOUNG, thin gals who need to change outfits often.\nMy fat size 8 (or 10 on a bad day) is a rarity here.  So if you are a stick you may have better luck.\n\nGood for club gear - not so good for my corporate America lifestyle.\n\nThe shoes are truly awful  (Felt flats??  eew.)",
    "date": "2008-08-24 16:30:44"
  },
  {
    "review_id": "vhKyqExVW9SNS8qEvAzbBw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "AqX_5srdyAS1tNiqC3mDvg",
    "stars": 2.0,
    "useful": 1,
    "funny": 3,
    "cool": 0,
    "text": "Ook. Went here about 3 years ago for a \"Happy Hour\" sponsored by the Temple Law Association.  This place was on par with Public House aka \"the Pube\".  Icky.\n\nBad crowd, watery drinks, mediocre bar snacks and a sort of a \"I miss being a frat boy\" vibe.\n\nNot goin' back.\n\nNope.",
    "date": "2010-01-14 20:10:00"
  },
  {
    "review_id": "ba6c_ov5EnShFE3fYXdHaA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "qGrjQ-c1uBfkAzS3YJVoNA",
    "stars": 2.0,
    "useful": 0,
    "funny": 1,
    "cool": 1,
    "text": "I strongly disagree with Veruca - this is \"Mall Chinese\" and just OK.\nMy 9 year old loves the orange chicken and teriyaki (sweet) chicken so if we are in the Mall and she is hungry I will indulge her.\n\nI don't eat here.\n\nIck.\n\nThe good part?  The lady behind the counter is very kind.",
    "date": "2013-09-04 21:18:24"
  },
  {
    "review_id": "D3UlmqcXxcif4jusEiGjNw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "GXM_Uitc3Ep8CvwEq_kpcQ",
    "stars": 2.0,
    "useful": 2,
    "funny": 0,
    "cool": 2,
    "text": "A lady at my office used to call this place $h1tty Gardens and the name stuck.\n\nI just have never had a great meal here.  Usually we've had take-out (they deliver) and I ate in the restaurant (which was loud, crowded and cefeteria like) one time.  NEVER will I return.  If you want GOOD cheap CHinese - go to A Mandarin Restaurant or Square on Square.\n\nThe dumplings were thick and doughy with greasy meat inside.  (Blech).  The Chicken & Brocolli was OK - not bad, actually.  The fried rice just seems old and over-soyed to me.\n\nNot a fan.",
    "date": "2008-08-28 13:57:22"
  },
  {
    "review_id": "DdToWcaNN9DdTZlj7upQNg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "GhJ0L2bavp3FjOF9C9ghdA",
    "stars": 2.0,
    "useful": 1,
    "funny": 0,
    "cool": 0,
    "text": "3 stars is pretty generous - it's more live 2 or 2 and a quarter.\nThe dumplings are crispy and FRIED and the prices seem a mite high for essential fast food noodles.\n\nThe lady at the counter was icy cold toward me - and the place was essentially empty.\n\nI would only go back here in a pinch as Bill M. has said.",
    "date": "2008-12-30 18:24:31"
  },
  {
    "review_id": "RJrIQsJdkeb5g3SQMz-Ovg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "m_5jK3w7t4CS2ReIZI_grQ",
    "stars": 2.0,
    "useful": 1,
    "funny": 4,
    "cool": 0,
    "text": "OMG - I can't believe they've survived for all these years.  It's fruity-drink, frat boy, college chick central.\n\nNot my kinda place - and never was.",
    "date": "2011-01-26 13:25:27"
  },
  {
    "review_id": "Nto0KDbEwxiUAkiKMj43bQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "0HpHVZFlEH5csxSBRVSmsA",
    "stars": 2.0,
    "useful": 5,
    "funny": 0,
    "cool": 0,
    "text": "Not great - and has declined steadily over the years.",
    "date": "2013-02-26 18:06:05"
  },
  {
    "review_id": "-a6ccxifMUDNMfdtReSCUg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "Ob4fDK3LQ3zsKvOBohGU-g",
    "stars": 2.0,
    "useful": 3,
    "funny": 0,
    "cool": 0,
    "text": "I would never stay here.  Absolute mediocrity.  We attend events here and the event people pick this place for the (reasonable) price of conference space.\n\nYuck.\n\nDepressing.\n\nPlease renovate and clean - bathrooms and public spaces, too!",
    "date": "2013-08-25 13:07:36"
  },
  {
    "review_id": "v0h6JyFTMJFZUKnwdbqztg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "peeXG1Ra-DClPQv14jvKvg",
    "stars": 2.0,
    "useful": 3,
    "funny": 0,
    "cool": 0,
    "text": "Finally used my eversave (valid only during dinner - and I sure know why!)\n\nService was just awful - very cold female server worked her butt off - while other guy stood there (not wonder she's so angry).\n\nThe food was good.  \"Happy Hour\" small plates are $5 - I tried the \"Fried Shrimp Joe\" which was kinda like shrimp-toast filling deep-fried and cut into chunks.  Tasty - but so greasy - will not get that again.\n\nSliced beef with eggplant (and I added brocolli - no charge) for $16.50 was a HUGE portion (Took about 1/2 home) and the beef was tender and delicious.\n\nGreat food - but this place is a LUNCH SPOT - and is truly cursed at dinner (dine-in).\nDim lighting, borderline mean servers and just not fun.\n\nWon;t be back so soon.\nMeanwhile - for takeout I love the hot and sour soup here.\nAgain - they have GREAT food.\nIt's a shame my dinner \"dine-in\" was so MEH.",
    "date": "2012-05-17 20:21:47"
  },
  {
    "review_id": "oxxEY7as-Au02xb6ym1iyQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "LiHdRXlcj0GDm_e97oiwKw",
    "stars": 2.0,
    "useful": 5,
    "funny": 1,
    "cool": 2,
    "text": "Very disappointed.  Came back to Pure Fare after being away for a couple of years.\nMy kid ordered a $7 Strawberry Banana Smoothie (Strawberries, 1 Banana and Ice for $7!!!!  Highway robbery) and the cup was not even all the way full.\n\nNot comin' back.\n\nUsed to love it here.  So sad.",
    "date": "2016-06-09 23:10:32"
  },
  {
    "review_id": "34o6LRE09yhxA-yqcfuvGQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "EUpaSsIsfz5ohMGormoREg",
    "stars": 2.0,
    "useful": 5,
    "funny": 2,
    "cool": 3,
    "text": "There are 3 - yes THREE Auntie Anne's in 30th Street Station.\nThe \"main one\" where they can bake pretzels is larger and back by the bar abd Surf City Squeeze.\n\nThere is a kiosk (they cart the pretzels over) on the concorse floor (near Amtrak) and another small store near the SEPTA area.\n\nLike obese Philadelphians really need 3 of these?  Anyhow - it's not good for you - and while a hot cinnamon sugar pretzel (especially fresh and hot) tastes good to me, I nearly always feel ill afterward and regret the 470 cals.\n\nSkip it.  Get some fruit or hummus from Old Nelson's.\nOr better yet - leave the building and go get \"real\" food.",
    "date": "2013-03-08 13:19:54"
  },
  {
    "review_id": "5hVszV1e1O_YiJVynlnf1Q",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "RgIWGfKSdSPNb20iSnpINA",
    "stars": 2.0,
    "useful": 4,
    "funny": 2,
    "cool": 3,
    "text": "Yick.  First of all -it's take out only.  There are (maybe) 2 card tables on which to eat.\n\nMediocre pizza and OK hoagies.\n\nIf you work at the Mercer Museum or nearby, this is a decent enough lunch spot, but for \"hoity-toity\" Doylestowners there are much nicer choices.",
    "date": "2009-05-04 15:09:36"
  },
  {
    "review_id": "m16IU4Ufs2kzG0HQGMVxtA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "qGrjQ-c1uBfkAzS3YJVoNA",
    "stars": 2.0,
    "useful": 1,
    "funny": 1,
    "cool": 0,
    "text": "The food here is just awful.\n\nMy (now) 11 year old, however loves the $2.99 bubble tea - and until we can find another place to get bubble tea (she is partial to honeydew) we get it here.\n\nThe young lads running the front counter are always kind to us.\nWish the food were better. I do not and will not eat here.",
    "date": "2016-08-22 15:00:14"
  },
  {
    "review_id": "bVFbUpaCTqkCIOcksH1P0A",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "4ah69lOJaaUuPS-wXtw_Fg",
    "stars": 2.0,
    "useful": 1,
    "funny": 2,
    "cool": 0,
    "text": "Sooooo dirty.  Eew!",
    "date": "2010-03-11 21:00:55"
  },
  {
    "review_id": "ekEqTy8UZgMEe_0lVEqTPQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "0RcD7PpjWTMcN86NwzgBag",
    "stars": 2.0,
    "useful": 3,
    "funny": 0,
    "cool": 0,
    "text": "Not a great Shoprite - but a little better than the one near the Target.\nNO customer service at all - and lines were pretty long on the (Saturday - duh) day we were there.\n\nWe go to the (also yucky) SuperFresh on Columbus for our bi-monthly shopping trips and supplement with Farmer's Market Fruit & Veggies (in spring/summer) and Whole Foods or Trader Joe's for other things.\n\nOh - and Target.  We're there a few times a month also.\n\nPro:  This shoprite has a BIG parking lot and we found a space easily - even though the store was busy and lines were long.  (Hey - open an extre couple of registers on the weekends, OK?)",
    "date": "2010-07-30 18:10:18"
  },
  {
    "review_id": "WSxflUAyQk5Qy65-U8aUNA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "2BVVhR_Bg6aOu4-hfmZQkA",
    "stars": 2.0,
    "useful": 2,
    "funny": 4,
    "cool": 2,
    "text": "Absolutely horrendous service.\nMy husband, 7 year old and I stopped in for an early (5:45 ish) dinner on a Sunday.\n\nOnly a few tables occupied and 3 staffers seated in the back corner.\nSeveral minutes passed before the cold, bitter hostess reluctantly got up to seat us.  Even my kid asked \"Are we supposed to seat ourselves?\".\n\nWe were given a table way in the back near the kitchen and eventually asked to be moved due to the loud banging and pounding (we could hear every aspect of the food prep.)\n\nMeanwhile the food, once it arrived was surprisingly good - 4 star even - but due to the awful experience we won't be back - at least not for a long while.\nThe rosa sauce is great, but I can get it other places where the servers are kind and attentive.",
    "date": "2012-05-22 13:55:56"
  },
  {
    "review_id": "Ytdtx9hMvanIxZatwdPVlg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "4UVsJ0CX20rmeC6CfC0reA",
    "stars": 2.0,
    "useful": 2,
    "funny": 3,
    "cool": 1,
    "text": "Yuck.  I don't really like fast food anyway - and Wendy's is barely tolerable, but this location (a busy one due to location for sure) is pretty awful.\n\nNot a good choice.",
    "date": "2011-01-01 15:30:19"
  },
  {
    "review_id": "neYLsKt1k9f4ovs0Hn2-uQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "m408YCnvuIywzZkJX3K9KQ",
    "stars": 2.0,
    "useful": 2,
    "funny": 0,
    "cool": 0,
    "text": "You're kidding right?  This Au Bon Pain should probably get 1 star due to the vermin infestation.  But anyway - the over priced, high calorie sandwiches & soups are a godsend when it is raining and I am too lazy to leave my office building, but other than that?\n\nI am so over au bon pain.",
    "date": "2008-10-14 12:04:12"
  },
  {
    "review_id": "JTPFB7cdTiYw41rlDqmgyQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "3YDXcj6vfpIDej7cULGh8A",
    "stars": 2.0,
    "useful": 22,
    "funny": 6,
    "cool": 1,
    "text": "Ook!  I had a horrible ordeal here - albeit years ago - in the emergency room.\n\nI was left waiting in a triage room for HOURS & HOURS because they could not decide whether or not to admit me.\n\nThey eventually decided not to admit me and let me out at about 3 AM in West Philly with no cab fare and I was scared to death.  Thank god a local cop drove me home.\n\n\nMeanwhile the doctors & nurses there seemed very confused and did not display good judgement in my treatment.  I was in need of care and they failed me.\n\nVery, very disappointing.",
    "date": "2010-08-06 01:35:20"
  },
  {
    "review_id": "1yHTCZQwygrrBdODgcEX-A",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "I2ISRV7IybkMc3HEYKUE9g",
    "stars": 2.0,
    "useful": 4,
    "funny": 3,
    "cool": 3,
    "text": "Audrey Claire is weird.\n\nI wanted to like it.  I wanted to love it - but it was only \"meh\".\nThe homey wood-tabled decor was nice - but the acoustics were awful.  So loud.\n\nThe white-aproned staff was kinda snotty - especially when we asked alot of questions - which we always do.\n\nThe food was just OK.  The standout being a plate of whole grilled artichokes that we had for an appetizer - but for the 7-8 bucks - I coulda done that myself.\n\nThe food is very elemental here - simplistic.  Not Horrible (in fact a 3 or even 4 stars for food) but as a total dining experience?  I probably won't be back.\n\nAnd its a BYO.  So bring something -\n- you'll need it.\n\nOh - and bring cash - no credit cards.\n\nWhatever.",
    "date": "2008-07-28 18:04:58"
  },
  {
    "review_id": "8nZLPgwbdOrI-9NIpJL4Cw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "k2w1Zf6F6bRQoOzXAi3Atw",
    "stars": 2.0,
    "useful": 1,
    "funny": 0,
    "cool": 0,
    "text": "I just was not thrilled with the food here.  Yes - it's a busy, Asia-inspired, zen ish decor - even the ladies room has been dollied up to the hilt.  (Maybe it's a little over the top, even??)  The food was just not good.\n\nI had an average sushi roll app and an entree so unmemorable that I can't event tell you what it was.\n\nWe went for lunch and I will not go back.  There are way better places.\n\nMaybe the drinks (which we did not have at lunch time) are why the high reviews?  The food was pretty lame.",
    "date": "2008-10-14 12:31:11"
  },
  {
    "review_id": "mNDK3Duxao5F8e1knTWcxg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "aMfVQdVbKJnZwdf-c1WNcQ",
    "stars": 2.0,
    "useful": 2,
    "funny": 1,
    "cool": 1,
    "text": "I am so NOT a fan of COsi.  After eating in the in NYC in the early 200's when this chain emerged - it seemed cool at first.  And - if the bread is fresh and hot (before it solidifies into cold cardboard) it actually tastes pretty good.\n\nThe hungrier you are the better it'll taste.\n\nMeanwhile - the overpriced sandwich fillings are mediocre at best.\nThere are better places to waste (I mean spend) my $7 bux.\n\nSorry.  Not a big fan.\n\nIf it's in 30th Street Station and I REALLY need food - I would eat here over McDonalds or Au Bon Pain - but that's really not saying much.",
    "date": "2008-08-08 20:09:33"
  },
  {
    "review_id": "UqjBWsF9-D1rRxLrkxO57A",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "ShHdco5F_kje58czuqQp5Q",
    "stars": 2.0,
    "useful": 2,
    "funny": 4,
    "cool": 2,
    "text": "The Doylestown BK has been around for a long, long time - at least 32 years.  (The McDonald's up the road came first, though.)\n\nAs BKs go - and I am not a fan - this one is decent.  often tables and restrooms need more cleaning, though.\n\nIt's a reliable fast food option - though I loathe the stuff.",
    "date": "2009-05-04 16:38:06"
  },
  {
    "review_id": "mP5PaqI8G9ZDG8RsHPKORg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "kQCJRWvfpiW1p_4hgwD8Uw",
    "stars": 2.0,
    "useful": 4,
    "funny": 4,
    "cool": 1,
    "text": "I stopped in at Roller's during the Chestnut Hill Festival basically to get away from the street crowds and hopefully, to score a decent lunch.\n\nNot so great.\n\nThe service was a bit familial and weird.  2 very nice ladies ran the \"front of the house\"  the server was nice - the manager (maybe owner?) not so friendly.  She was way more attentive to the couple to my left and the family to my right - but I guess since I was dining solo - maybe I wasn't worth it??\n\nI asked if lunch was being served (it was 2 in the afternoon) but told olnly brunch and breakfast.  So I ordered a Turkey BLT on Le Bus multi grain toast (menu said 5.75 - was eventually charged 6.25) and the nice server lady said, \"I'm not sure if we have lettuce.  I'll have to go check.\"  (I was like, \"What?\", but did not say anything.)\n\nTurns out they DID have lettuce.  Maybe that's why they charged me more?  But it's a BLT.  The L supposedly stands for LETTUCE.\n\nOh well.  You can't win 'em all.\n\nMeanwhile, I rested my weary self a while and escaped from the throngs of yuppies and suburbanites, and ate a tasty Turkey BLT.\n\nWith Lettuce.\n\nWill I rush back here?  Likely not.\n\n2-3 stars for food.  1-2 for service.\n\nOh - and bring cash - NO CREDIT CARDS",
    "date": "2009-10-04 22:37:55"
  },
  {
    "review_id": "exYZlui-wUvYy_mHxRqalg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "EX-ioSwVMafEBVt-xIzcxA",
    "stars": 2.0,
    "useful": 12,
    "funny": 3,
    "cool": 4,
    "text": "I am ever-so disappointed with Gennaro's - and just went there again for the first time in years as it never is good.\n\nWell, I was right - my cappucino came out with curdled milk.  Ick.\nFortunately the very kind server, Wendy, brought me another one and took it off the bill.\n\nMy close friend eats here ALL the time and loves it, but I just don;t get it.\nIt's never \"quite right\" for me here.\n\nFriendly service, old-school digs (they need new carpeting) and a menu to match.\n\nPeople/Locals love it.  Maybe New Yawk has spoiled me for Delco-Italian.",
    "date": "2020-01-27 15:34:48"
  },
  {
    "review_id": "Y0kpXgG-hvEQ_tFGzZ-rCQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "3sMGEl72eiDbble1RO34ng",
    "stars": 2.0,
    "useful": 8,
    "funny": 1,
    "cool": 1,
    "text": "This starbucks is deceptive.\nFirst of all, parking is horrendous - there's just not enough of it.\nSecondly there is hardly any seating - a few bar stools and a few tiny tables for 2.\nThirdly, the retail area - used also to barricade off the drink line area - is too bulky and wide.\n\nThis location is deceptive in size - it looks like a big store from the outside but is cramped and crowded inside.\n\nMeanwhile the usual Fourbucks menu items prevail.\nService was fine.\n\nIt's just too small.",
    "date": "2012-12-12 11:54:21"
  },
  {
    "review_id": "AvJyE0dyN3oPZ1sGYrsVqw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "P1pP6RIl-RtbSs_hQJJWpg",
    "stars": 2.0,
    "useful": 8,
    "funny": 2,
    "cool": 2,
    "text": "They do not carry Eukenuba nor California Natural (The only foods my dogs(s) eat, so I can't really come here.   They had a few toys and treats on sale.\n\nSeems more fish/aquarium centric than mammal centric, so if you have fish - this could be a good option for you.  Now that Pet Supplies Plus is going out of business, their business should pick up a bit.\n\nPlease consider carrying Eukenuba so I can come here.",
    "date": "2017-12-19 19:11:41"
  },
  {
    "review_id": "GDFjWtoh7qm-G8cGWQvrsA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "D99kvKSnsCtD07mExtN_Pg",
    "stars": 2.0,
    "useful": 1,
    "funny": 2,
    "cool": 0,
    "text": "I am not an Applebee's fan.  I have been to this one twice though - once I was dragged here by my inlaws - who LOVE chain restaurants.  (I guess they make them feel \"safe\"),\n\nThe food was marginal and the service was, of course, by disinterested teenagers.\n\nNot my idea of a good time.",
    "date": "2008-08-25 12:48:25"
  },
  {
    "review_id": "Raft48QPxJFmAknX4jBD8Q",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "dr_nIjj7A0PYfaN6qS2yng",
    "stars": 2.0,
    "useful": 0,
    "funny": 4,
    "cool": 0,
    "text": "It's been here for eh ver.\nNot much good I can say about McDonald's.\n\nClearly I'm NOT lovin' it.",
    "date": "2014-01-21 16:28:18"
  },
  {
    "review_id": "wZBIiH0Qo28Ne3SXunVbFA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "2YyIIdwnYv5cApn1gZo_gw",
    "stars": 2.0,
    "useful": 2,
    "funny": 1,
    "cool": 1,
    "text": "Went here for a late lunch yesterday (a recession Monday) and the place (huge dining area) was nearly empty.  My friend insisted on coming here as I likely never would have (Can't deal with Public House aka \"the Pube\" and knew I would likely not like it here anyhow).\n\nWell, It's a sports bar (big f-in' surprise) - and they brew LOUSY iced tea.\nService was fine (there were 3 waitresses just standing around so the one assigned to us jumped at the chance to do something).\n\nMy friend had the Fieldhouse Burger - which he enjoyed, although I snagged one of his good lookin' french fries and OOK - a mouthful of salt.\n\nMy fieldhouse salad (dressing on the side, no bacon) was surprisingly 3 star.  If I am ever forced back here I will order it again.\n\nSo 2-3 stars it is.  Blasting loud '80's music (Billy Ocean's \"Get Outta My Dreams - Get Into My Car\" was blaring) and ESPN and ESPN2 on every other flat screen.\n\nIt's so not my thang, but OK for what it is.  A MEH sports bar.",
    "date": "2009-03-24 13:12:57"
  },
  {
    "review_id": "-g8WhtkktC3WyaZ0St3q4A",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "58YlriLggVr4_5yShAhA3g",
    "stars": 2.0,
    "useful": 1,
    "funny": 1,
    "cool": 1,
    "text": "Well, this is what we're kinda stuck with - considering that we can't afford to get ALL of our shopping done at Whole Paycheck (aka Whole Foods) or Trader Joe's.  Cleaner than Ackamee and less Ghetto than ShopRite (some may argue this).\n\nSuperFresh is our big-chain grocery store of choice based on location and convenience.  A few of the checkers \"K\" and \"Sophie\" are actually nice, and know us and our DD because we come here nearly every Sunday.\n\nThe produce can be marginal so you must be careful.  \n\nThe deli usually has a line, so we nearly always skip it.\nWe tend to shop aisle by aisle based on a list and coupons (yes, I am currently both BROKE and anal.).\n\nDH like to get 12 packs of canned sodas when they are on special, and I usually get snack foods (healthy-ish when possible, Orange Juice boxes and yogurt for the l'il one.\n\nWe need this SuperFresh - for better or for worse.  It's where we've chosen to shop and although it's not super clean, it's THERE and that's why we're there as well.\n\nOh, and as mentioned by another yelper - they always play SLAMMIN' classic rock - usually loud enough so I can hear it!  (Pink Floyd, Jethro Tull - amazing!  I love that!)",
    "date": "2009-08-22 16:13:39"
  },
  {
    "review_id": "pMc6MxtzROEuKR2yWf7zBg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "utUdOwhOK7bnleFIT8lxpA",
    "stars": 2.0,
    "useful": 2,
    "funny": 2,
    "cool": 0,
    "text": "Stopped in here (cash only) after a production at Arden Theatre.\nOur 7 year old said it was awful and the cake batter flavor made her sick.\n\nThe heat from the 4 yogurt machines (one was broken) was unbearable and the cashier was more interested in picking up her chinese take-out.\n\nWill not go back.  There are many, many better fro-yo spots in Philly.",
    "date": "2012-05-07 13:13:48"
  },
  {
    "review_id": "gnRNYN6MyrkeRgXWxup3PQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "N_dameoyJSMcm7RVwGeZ7w",
    "stars": 2.0,
    "useful": 0,
    "funny": 0,
    "cool": 1,
    "text": "I loathe Domino's so 2 stars is pretty darned generous coming from me.\nThe only reason we got pizza here is because my frugal father in law had a coupon (He normally gets Papa John's - which is still mediocre at best).\n\nThis is a teeny-tiny take-out only \"kiosk\" - small store.\nNot for eating in!\n\nYick.",
    "date": "2014-02-11 15:53:38"
  },
  {
    "review_id": "tlGHjMf-3v74nwsKJqVmnw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "1zNQfRAclJcSXGpO2vEqqA",
    "stars": 2.0,
    "useful": 4,
    "funny": 0,
    "cool": 0,
    "text": "Absolutely disappointed in a private event held in an upstairs room.\nONE waiter passing tiny fried hors d'ouvres and ONE bartender at a jam packed cash bar.\n\nNot enough staff and not enough food for the crowd of 100 plus.",
    "date": "2014-11-05 12:58:22"
  },
  {
    "review_id": "rjgyloPM4-wj9D_g5gKKkA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "2RvssRTzvbP5TcxUoYoi_w",
    "stars": 2.0,
    "useful": 1,
    "funny": 1,
    "cool": 1,
    "text": "Nope.  Not very good Sorry - even though it's been around for-eh-ver, the food is just OK.  (Italian \"red sauce\" fare) and the place needs an overhaul.  I guess what makes it so awful for me is that a spider spun her web down onto my plate while I was eating there.  There was dust and cobwebs in the windowsill and that spider just clinched it for me.\n\nI couldn't even finish my baked ziti.\n\nWon't return.",
    "date": "2008-10-30 19:52:33"
  },
  {
    "review_id": "8Fv_TwaQMDLfxPBGirwHHA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "o6B17dkfUtZTfKabD9uYTQ",
    "stars": 2.0,
    "useful": 1,
    "funny": 0,
    "cool": 0,
    "text": "A tiny, tiny grocery store - but it's got what you need - maybe not at the greatest prices - and for a long while it was all Dublin really had.\n\nBrain-dead clerks & cashiers - but they will smile back if you smile first.\n\nIt's a grocery store - and I am glad it's here - but it sure could use an overhaul both physically (clean up the aisles and floors) and customer-service-wise.\n\nThe older lady at the deli counter was really nice, though - 4 stars for her.  Darned if I can't remeber her name, though. She sliced up some turkey breast for me and 3 slices of liverwurst for my sweet little pug.",
    "date": "2010-09-17 14:03:29"
  },
  {
    "review_id": "Va4gXByOml9ZY3Q_J8RrPg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "V9pSmHb0c-9SSqx5GJbYPg",
    "stars": 2.0,
    "useful": 6,
    "funny": 5,
    "cool": 1,
    "text": "So very disappointed and actually...\nSAD.\n\nYes, I left Ooka tonight feeling sad.\n\nSad - for the fact that we had food (entrees) so bad that we had to send it back.\nSad - to see my favorite D-town sushi spot be anything other than the wonderful we usually expect.\nSad - to have had to defend my right to consume undercooked meat or seafood products.\n\nJust sad.\n\nDo not order duck breast here.  I did - and asked for medium rare - and that duck had the quack cooked right out of it.\n\nAs usual the seared striped bass with foie gras was excellent.\n\nEverything else?  MEH,\n\nSo sad to have to give out 2 Meh stars to Ooka.\n\nWe pray that when and If we give them another chance that they will redeem themselves.\n\nSad\nSad\nSad.",
    "date": "2013-07-06 22:54:14"
  },
  {
    "review_id": "cE2bFpiu50Ok6GW0Cj1Ktg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "mLhVT1B9NtxiDR9ZPfgL1Q",
    "stars": 2.0,
    "useful": 6,
    "funny": 3,
    "cool": 2,
    "text": "i am not a big Macy's shopper - but even for a Macy's this one is lame.\nI used to shop at the Wanamaker/Macy's (in Center City) and if there were sales you could get some decent clothing, shoes and kids clothing.\n\nHere in Springfield?  Not so much.\nIt's hit or miss and I usually miss.\nThe Calvin Klein dress I wanted was full retail at $134.99 - and I got a very similar one at Century 21 (in Philly) for $69.99 - so, I am not too keen on Macy's these days.\n\nFor kids clothes?  Entirely too pricey.",
    "date": "2016-08-22 15:28:17"
  },
  {
    "review_id": "eDJXpcxaD6VdW3Z-qJKEUg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "PdowlCDbc8cpwACPq5Batw",
    "stars": 2.0,
    "useful": 2,
    "funny": 3,
    "cool": 1,
    "text": "Products?  Great.\nService?  Needs work.\n\nI called and left a voice mail weeks before my daughter's birthday to see about getting a quote for a custom donut order (Their donuts are the best in this area - so good, especially when fresh.)\n\nUnfortunately nobody called me back until the night before the event and I had already purchased donuts elsewhere.\n\nI was getting desperate so I went somewhere else and they won't be as good.\n\nI sure wish they had listened to my voice message sooner.\n\n\nWill try again and next time I will call multiple times.",
    "date": "2017-11-03 15:58:37"
  },
  {
    "review_id": "HF8-S6RUqj3vxb6EYpEYyQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "EKSmnS-fup3HNFLR9J17mQ",
    "stars": 2.0,
    "useful": 3,
    "funny": 0,
    "cool": 0,
    "text": "A little dirtier than Midtown 2 - but the same basic old-skool diner vibe.\nGood for breakfasts and cheap dinners.\n\nIt is creepy though - but my 5 year old loves to get one pancake and one scrambled egg here.",
    "date": "2010-10-05 13:43:11"
  },
  {
    "review_id": "aY491rresjj8YloYCYsKXA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "HhaL0aFNFXsxitfL4E7upQ",
    "stars": 2.0,
    "useful": 3,
    "funny": 2,
    "cool": 1,
    "text": "I agree with McThrill - why soooooo many Dunkins so close to each other?  (And amazingly - even in this economy - long lines at each during the morning rush.  (There's your answer.)\n\nI trek through here very often - although not nearly as often as when I commuted in on my beloved-behated R5 (but that's for another review - see SEPTA).  I disagree about the juicebar.  It is not great - the one in the Comcast Center is way better (Sook Hee's Squeeze Juice Bar).\n\nI really liked Pasero's Coffee before they were taken over by Juan Valdez - byt still, it beats Charbucks (Fourbucks - whatever).\n\nMeanwhile, it's a necessary evil.",
    "date": "2009-02-06 20:00:02"
  },
  {
    "review_id": "tK-oovzE3pI_ZqR3iJNtRQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "4sZVseAd2XZrSReEmBlMFQ",
    "stars": 2.0,
    "useful": 2,
    "funny": 0,
    "cool": 0,
    "text": "Just awful.\nOur server Lara was nice enough - and thankfully the manager (who looked about 18 years old) comped my in-edlible over-cooked salmon. Dry.  Awful.  (And I asked them to cook it less than they usually do - which is Medium-well).\n\nThankfully it was very inexpensive (we got the 2 for $25 lunch deal - one app, 2 entrees, dessert).\n\nThe food was just not good - and the service was so slow.\nLike watching paint dry.  45 minutes to get the app, 20 more for entree.\n\nWill NOT return.",
    "date": "2012-02-26 02:50:04"
  },
  {
    "review_id": "S2GJq8AqWKTs6__0CVwhxA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "Mm1QhCmJPmrm6j-vY9m0tg",
    "stars": 2.0,
    "useful": 4,
    "funny": 0,
    "cool": 1,
    "text": "The spotted hog is one of the lower-priced options within the confines of Peddler's Village.  It is certainly way cheaper than Earl's Prime or the Cock 'n Bull which are the more high-end PV establishments.  You can take the kiddies here and refresh yourself on mediocre food and sandwiches before another round of shopping.\n\nAvoid during the holidays.  It gets mobbed.",
    "date": "2008-07-28 19:49:06"
  },
  {
    "review_id": "yWO6p3d0Hmpb6N0UYvHKag",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "VFdwCUNqF2TLHElyhCXgMg",
    "stars": 2.0,
    "useful": 2,
    "funny": 1,
    "cool": 0,
    "text": "The best place to sit in the Sugarhouse casino.  A simple bar with a TV showing \"the\" game.  Go when it's not crowded.\n\nBut truthfully, Sugarhouse is just not my bag, baby.\n\nHonestly?  Were it not for proximity - I would NEVER here  - I'd sooner go to AC or even Bethlehem, PA.\n\nPhilly fought long & hard to get a casino - and THIS is what they get?\n\nSorry - Unimpressed.",
    "date": "2011-01-04 19:44:32"
  },
  {
    "review_id": "3T_0j_urU8ZcFPD7c9ryEQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "7WxwNLWCalq4m3r0Y3nMlg",
    "stars": 2.0,
    "useful": 2,
    "funny": 2,
    "cool": 2,
    "text": "I honestly am at a loss for words.\n\nI went to Franco's tonight as part of a VERY large group (35-40 ladies) with a set menu (that sounded great on paper.).\n\nFranco's had a lovely decor (once we managed to find a spot in the jam-packed lot) and the hostess (a pretty young Asian woman) was friendly and professional.\n\nOur group had a semi private portion of the restaurant.\nWe began arriving for cocktails at 5:30 (dinner was to start at 7) at the packed bar.\n\nBy 7:20 dinner had still not started.\nAt 7;30 the first few salads (all of us were to have the SAME - BORING - mixed greens with 2 grape tomatoes and barely a whisper of balsamic vinaigrette.) started to arrive.\n\nBy 8:00 (we were so hungry we devored the baskets of Uber-SALTY focaccia (UCK) and decent Italian bread), they came to take our orders (IMO they shoulda done that much sooner.)\n\nMy entree (eggplant parm) arrived at 8:45.\nI ate 2 bites (it was just OK) and had ot wrapped to go.\n\nMeanwhile the 4 entrees we have to choose from were Cheese ravioli Marinara, Eggplant Parm with Penne, Tilapia with Capers or Salmion with Olive Oil & Herbs.\n\nOur tablemates had the tilapia and claimed it was under seasoned (perhaps the over-seasoned foccacia would have helped)?\n\nMeanwhile the sweet young boys (er, men??) bussing and serving were clearly way, way, way overwhelmed by our party.\n\nBadly handled.\nMediocre Food.\n\nI had high hopes for this place, but I am in no hurry to rush back.  (Menu prices for the entrees our group had were from $14.75 - $19.75).\n\nI did not get a chance to try the profiteroles for dessert.  The service simply started too late and ran too long.",
    "date": "2010-08-05 01:37:34"
  },
  {
    "review_id": "ELrs3De9t_whgm13M39L4A",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "yfRWuLFs-mp9GbG82yyeTQ",
    "stars": 2.0,
    "useful": 1,
    "funny": 1,
    "cool": 0,
    "text": "Eh.  Meh.\n\nWhatever.  It's OK.  I prefer the pits at Aya's or Mama's.\nIt is a nice alternative to fast food though.\n\nMaybe I should give them 3 stars?\n\nThey are a solid 2 and a half.\nStaff are CLUELESS. Prices are low (which is helpful.)\nIt's relatively clean.\n\nI just wasn't BLOWN away by my chicken pita sandwich.",
    "date": "2009-02-19 17:12:42"
  },
  {
    "review_id": "cxL7zCGSBgJpgoTpjiSuZQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "w5X6SbNptPwPip2bj-A3Cg",
    "stars": 2.0,
    "useful": 10,
    "funny": 3,
    "cool": 8,
    "text": "I have nicknamed Walmart, \"Wal-nuts\" because the people who shop there are truly on the brink of insanity.  Shopping only based on price.\n\nYes, it's cheap - but also chaotic, crowded (the check out experience is not pleasant) and for a few bucks more, I'd rather go elsewhere.\n\nThat said, Walnuts has saved my a$$ on numerous occasions when I needed groceries (This one is a a SUPER-Walnuts - with groceries, dairy and produce) or household supplies.\n\nYup - it's cheap.\n\nBe patient.  This ain't no party.\nThis ain't no disco\nThis ain't no foolin' around...",
    "date": "2021-05-07 17:18:32"
  },
  {
    "review_id": "n62KPqgDs9dgJ6gDq17XrA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "UPKtGQFX9B_oxvmGQdxcKQ",
    "stars": 2.0,
    "useful": 3,
    "funny": 3,
    "cool": 1,
    "text": "Awful excuse for a strip mall.\nRun-down K mart and a few struggling stores.\n\nYUCK.",
    "date": "2013-06-30 20:35:57"
  },
  {
    "review_id": "IospqbVXvLVbTtKQRYN2iw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "D99kvKSnsCtD07mExtN_Pg",
    "stars": 2.0,
    "useful": 2,
    "funny": 2,
    "cool": 0,
    "text": "I was dragged here yet again, and the food and service were decidedly sucky.  (Sorry \"Amanda\" - sweet yet clueless high-school aged server).\n\nMistake 1.  (Our bad) Come on a Saturday night at 6:30\nMistake 2.  Patiently wait for table with5 year old\nMistake 3. Ask for \"a few minutes\" when said server asks \"Ready to order?\"\n\nMy kid nearly had a melt down while waiting for her $3.99 Kraft Mac 'n Cheese and my $9.99 burger - asked for medium- was charred and tasteless.\n\nYick.\n\nHope my inlaws enjoyed the teeny tiny overly salted steaks.\nIf it were not for their generosity, I would never, ever come here.  (They paid, they picked. And, yes, I am grateful to them - but please - there are so many better places to go.)",
    "date": "2010-01-26 20:37:27"
  },
  {
    "review_id": "pgHFlrdxh42XOCsJC9kb2g",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "2YyIIdwnYv5cApn1gZo_gw",
    "stars": 2.0,
    "useful": 3,
    "funny": 0,
    "cool": 1,
    "text": "DH & DD, a friend and I were trapped in the convention center during a freezing cold Flower Show and since Hard Rock was packed (35 minute wait) we snagged a table at the Field-Hole.  \n\nLunch was unsurprisingly unremarkable. My Cobb Salad (regularly $14 with chicken) was jacked up to $20 when I asked to sub steak.  4 oz maybe of just OK steak.  5 cherry tomatoes cut in half, a few chunks of avocado and some over-cooked bacon chunks/chips.  I have had better and worse Cobbs.\n\nThe best part?  Our server Dana was an over-worked sweetheart.  She did her very best in a dining room packed with kids and families weary from the Flower Show.\n\nPrices are a bit too high for the sub-par \"formula\" bar food that is served.",
    "date": "2015-03-09 00:30:08"
  },
  {
    "review_id": "kvfqfbAL75ii6Kb7lsLSSQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "XC30E7D4gfIrLmh4d4prSw",
    "stars": 2.0,
    "useful": 14,
    "funny": 4,
    "cool": 7,
    "text": "No Bueno.\nMy father's crab cake platter (which sounded great on the menu - served with a mushroom risotto and asparagus) was nearly all filler.\n\nYes, this is a diner - but he was sorely disappointed.\n\nWon't be back.",
    "date": "2021-07-28 14:10:52"
  },
  {
    "review_id": "_gfofJ8Fz8kFGvnMATx31w",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "Y96aX7yEyFan_zuQcl6BFA",
    "stars": 2.0,
    "useful": 9,
    "funny": 3,
    "cool": 3,
    "text": "The flowers my friend sent me for the holidays were awful - nearly dead upon arrival, so they sent a replacement which was much fresher.\n\nNot a great florist.",
    "date": "2021-12-07 01:08:28"
  },
  {
    "review_id": "oS7jdp0jsdtZ09AA1Fl1eQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "zgX8sYCRGVJ9M5LETpJ60A",
    "stars": 2.0,
    "useful": 1,
    "funny": 0,
    "cool": 1,
    "text": "It seems like they should have decent food here - but alas, no.  Service is pretty disinterested, and the prices are more than the quality demands.\n\nI did get a nice side of steamed broccoli in lieu of the fries - so that was good.\n\nI don't come here unless co-workers force me to.",
    "date": "2009-03-06 15:37:00"
  },
  {
    "review_id": "tVj38pkOGUkNE9YdDKy6Aw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "9SCZdPbyJHD1fF1k957DiQ",
    "stars": 2.0,
    "useful": 0,
    "funny": 1,
    "cool": 0,
    "text": "Wendy's is never our top choice for dining - but el kiddo wanted something chicken-y so we stopped in (dine in) and she got her \"value menu\" chicken sandwich with lettuce, mayo and bacon added (30 cents extra).\n\nHubby got a few burgers that he ate sans bun.\n\nWe all got 99 cent frosties.\n\nI tried the \"new\" bacon cheeseburger on a pretzel bun.  What a horrific waste of calories.  Bun was overbaked (dark brown and nearly black).  Loaded with both sliced cheese and a nasty fake-cheese whiz-like sauce.\n\nNever again.\n\nBatherroms were moderately clean.\nService was poor - order was worng the first time  but corrected the second.\n\nPlease was dead empty at 5:30 PM on a Sunday.\nDrive through had a line though.\n\nCreepy!",
    "date": "2013-07-15 18:48:03"
  },
  {
    "review_id": "XI75q5vcvqQUxJ27VqFohA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "oGl-gsxNk0z15ucwlB3RcA",
    "stars": 2.0,
    "useful": 1,
    "funny": 0,
    "cool": 2,
    "text": "Just OK today.  I had not been here in quite some time and while the hot foods/cooked foods seem to have expanded the sushi was just not fresh.  I ordered a side order of (\"new\") grilled tofu - at $4.50 which was tasty and safe to eat.\n\nThe $10.95 (pricey) Valentine roll had very questional salmon inside.  So questionable that I still don;t know if it was supposed to be raw fresh salmon, smoked salmon or just old, nasty salmon.\n\nVery disappointed - and I spent over $16 on a carry out lunch.\nI will not be back in a hurry, if ever.",
    "date": "2013-01-04 18:39:48"
  },
  {
    "review_id": "RpEcNmjpqVv8vfDHYYCArg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "4HRtArZJtcAs10gAE7_bzw",
    "stars": 2.0,
    "useful": 3,
    "funny": 2,
    "cool": 1,
    "text": "I am not a Cosi fan but I was genuinely STARVING one morning and popped in here for a cup of soup - which came with apiece of their\"Cosi bread\".\n\nInarticulate, disinterested staff and watery \"Lobster & Butternut Squash\" soup which had little to zero lobster and an oddly fishy note.\n\nI won't be ordering THAT ever again.",
    "date": "2010-05-20 23:46:45"
  },
  {
    "review_id": "1df7FhTnvi150hINRKMDoQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "5AqaSb8ZUYIaEPGV3ZN4nQ",
    "stars": 2.0,
    "useful": 2,
    "funny": 1,
    "cool": 0,
    "text": "Changed location and owners, and so pricey - and not worth it anymore.\n\nI am sad.\nI liked the old Gross'.\n\nRIP.",
    "date": "2014-02-11 16:42:58"
  },
  {
    "review_id": "SD3W5Q1nl5lBQn5Q3A7-2w",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "p7jfs5hei0rIg7abOocFTQ",
    "stars": 2.0,
    "useful": 2,
    "funny": 0,
    "cool": 2,
    "text": "This bar has not changed in the last 25 years.\nMostly biker-type regulars from Q-town or Souderton and a few D-town long-timers.\nNice people in a dark and smoky bar (Hooray - you actually still smoke here).\n\nCheap drinks and easy access to the rest of town.\n\nNot my thing - but OK in a pinch. \nThe bartender Susie is a doll.",
    "date": "2015-09-06 14:45:23"
  },
  {
    "review_id": "55ZExx8hcL1qc2hUr-bkYQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "9bbwPNPYXqP83reSK-hASg",
    "stars": 2.0,
    "useful": 3,
    "funny": 1,
    "cool": 1,
    "text": "I agree with Eveline - and I too am writing this review based on grease-laden memories of my post-collegiate Chinese Truck experience.\n\nI don't understand the love.  Food is (as said before) full of oil, onions and MSG.\n\nYech!\n\nOh - but it's really, really cheap.",
    "date": "2010-06-22 19:04:13"
  },
  {
    "review_id": "dGF7wLT0zN4-lVaf5LIG6Q",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "Hz40F0hsr4CIrHGHcRZ0Xw",
    "stars": 2.0,
    "useful": 0,
    "funny": 1,
    "cool": 0,
    "text": "Their donation policies seem more restrictive and inconvenient (when and what they will accept donations) than other SA or Goodwill stores.  I come here mostly to donate items - not to purchase.  Glad they are here, though.\n\nUpdate:  The building was destroyed in a tragic Collapse in June 2013 - killing 6 people and injurying many more.  So sad.",
    "date": "2008-10-29 18:00:58"
  },
  {
    "review_id": "Y07Fqnc2Js3Xo4kyInCJQA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "pWzrmh1oiU9ngWXGHKnnwQ",
    "stars": 2.0,
    "useful": 6,
    "funny": 1,
    "cool": 1,
    "text": "Walked in, walked out.\nCrowded, poor service, mediocre food.\n\nBut it is convenient when you just NEED to sit down in RTM.\n\nAsked for water several times.\nTripped over strollers.\n\nNot a fun experience at all. (Which is a shame because I LOVE Jack McDavid - not sure if he still has a hand in this biz,)",
    "date": "2009-01-29 14:53:41"
  },
  {
    "review_id": "_eTtk6ydGGvKt5L8MVx6BQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "qdh-HkVRCqqPghhLagfEpw",
    "stars": 2.0,
    "useful": 5,
    "funny": 0,
    "cool": 2,
    "text": "I have been here twice - the first time was when they first opened and it was great - maybe 4 stars.  We had $1.70 sliders and fabulous ginger & pineapple cocktails.  We sat on a sofa in a corner of the bar and had great service.\n\nA few months later we went back - this time for Center City Sips.  The place was PACKED, the menu (food and drinks) had changed and the service was just awful. A 1 star experience.\n\nThus, I am giving them 2 stars and I will not return.",
    "date": "2008-07-18 17:42:44"
  },
  {
    "review_id": "JqV63AXYu1MDAl9TCTNNaQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "FwFJcH8ashI_DyP1VTQRlw",
    "stars": 2.0,
    "useful": 2,
    "funny": 1,
    "cool": 1,
    "text": "2 stars on a bad day - 3 on a good day?\nThis one is way better than the FILTHY friendly's down 611.\n\nMeanwhile, my 4 year old daughter simply MUST have the cone-head sundae, so my DH and I gave in and had lunch here.\n\nIt wasn't AWFUL - but it was very slow service and mediocre food that is really not good for you.  (Fried chicken fingers & burgers.)\n\nNot a fan.  Sorry.",
    "date": "2009-02-25 14:52:40"
  },
  {
    "review_id": "OoHiJ_-t88H05hQv6vyNsQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "sXC_lkNFfUfZkox-RdTJuA",
    "stars": 2.0,
    "useful": 1,
    "funny": 2,
    "cool": 1,
    "text": "I absolutely agree with Zach.  I enter or exit this station several times per week and you have to use the Vine Street side.\n\nPlus - what is the point of that token booth attendant if you can't buy tokens?  There is a change machine - but only for change - no tokens.\n\nMeanwhile I am glad to live so close to a BSL stop, but some changes need to be made.",
    "date": "2010-09-30 17:46:11"
  },
  {
    "review_id": "nTri4R789eL9Yx0jR1rHPA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "RnHZiuEeL2hxKc96BuieBA",
    "stars": 2.0,
    "useful": 2,
    "funny": 0,
    "cool": 0,
    "text": "Absolute mediocrity - but at a very cheap price. (A typical case of \"you get what you pay for\".)\n\nMy 7 year old and I stopped in - for a polish change ($5) and a manicure for me ($10).  Since she got fidgety we both ended up getting polish changes.  Mine chipped right away - even though I coulda sworn she used CND basecoat (which is a great product).  DD chipped hers too - but that was her fault.\n\nNot very clean (I would NOT get a $20 pedi here EVER.).\n\nNot coming back.\n\nCheap and would do in a desparate pinch.",
    "date": "2012-05-22 14:04:57"
  },
  {
    "review_id": "rSBJcEXsTO3_yFFdX4A_FQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "NnXtMdEJ4QRgaw7hTgbkgg",
    "stars": 2.0,
    "useful": 10,
    "funny": 3,
    "cool": 2,
    "text": "Worse and worse every time we come.\nThe firt time we had a great 4 star experience.  This last time?  Not so much.\n\nAnd do NOT get take out here.  No beverages to go (other than sugar-laden Mexican Sodas).  No Diet Coke.  No take out cups.  Bottled water (IF they have it) is $2.25 per bottle.\n\nPlus they got my order wrong - and I called 45 minutes before I needed it.\n\nThey are clearly not well equipped for take out.",
    "date": "2016-08-25 11:03:17"
  },
  {
    "review_id": "99ONvdm4BiyY-ZI9rPlsyg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "8JcdN89xv4AqAVRSDLLUHw",
    "stars": 2.0,
    "useful": 4,
    "funny": 0,
    "cool": 1,
    "text": "2 to 2.5 stars at best.\n\nWhat a disappointment.\nA close friend and I had been planning dinner here for over 2 months.\nWe finally got to go and the food just isn't up to par (or the high prices - $22 - $45 for entrees!).\n\nWe started our meal with delicious fresh bread and garlic-infused oil.  (That and the after-dinner coffee were the best bites of the night!)\n\nI love a good caprese salad and was thrilled when \"Fresh tomato and buffalo mozz\" was a featured special ($12).  My friend and I split it - and the tomatoes were HARD - deli-quality slicing tomatoes.  This - in the middle of August when tomatoes are plentiful - is a sacrilege!  Also - who serves this over iceberg lettuce?  ICEBERG?  On a Caprese?\n\nBlah!!!\n\nOur server Leo tried to please us - but the entrees fell flat.\nMy entree was OK (albeit very over-salted) - al dente linguine with about a doze steamed littlenecks in a garlicky, salt-bath of oil.\n\nMy friends \"veal saute\" was a joke.  While the veal was tender, the sauce was a bland concoction of greasy-oily floury blandness.  It was supposed to be a \"light white wine sauce\" and no wine or flavor was detectable.\n\nWe skipped dessert and had 2 very nice cups of $3 coffee.\n\nI would not go back here.\n\"Founded in 1990\" - looks like they have not renovated since 2002.\n\nFAIL!\n\nSuch a shame.",
    "date": "2013-08-10 14:13:35"
  },
  {
    "review_id": "77Qts-K-9SDqwysoBanQwg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "HddE1bPVuTas6hACmHVcUQ",
    "stars": 2.0,
    "useful": 3,
    "funny": 0,
    "cool": 0,
    "text": "I love CVS - but this branch is RIDICULOUS.  The line is always long, clerks unfriendly (better at the pharmacy - but the \"front line\" is atrocious.   I consider it a neccessary evil, as this is the only CVS near my office. (ANd they do have everything I need - usually higher priced  but, Oh well.",
    "date": "2008-10-19 17:14:18"
  },
  {
    "review_id": "LKLMhJg_bZnQw36tTgIssQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "oU-vzdE38Nk6gAr4yDy6ew",
    "stars": 2.0,
    "useful": 7,
    "funny": 0,
    "cool": 2,
    "text": "Not sure why - but the Philly outpost of crumbs seems a bit...\n...Stale?  Maybe it's because nothing is baked on premises.  It's all trucked in from NYC.\n\nWalked in - excited to see a Crumbs (like those in NYC) here in Philly.\nThe large cupcakes are way too much for one person - and many have an overload of toppings. I tend to stay with the \"Squiggle\" or simpler versions.\n\nMeanwhile - the cake pops on display (push up pops?) looks so artificially colored it was off putting.  Stick with the mini cupcakes.  A better size and price point.\n\nAnd the front of the store is EMPTY - you have to walk in and THEN you see the counter.\n\nA plus? You can get your favorite over-priced fourbucks aka Starbucks latte or mocha.",
    "date": "2012-12-20 14:34:53"
  },
  {
    "review_id": "gHZjayDf20ytbmc1vWNZ4g",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "qdh-HkVRCqqPghhLagfEpw",
    "stars": 2.0,
    "useful": 3,
    "funny": 1,
    "cool": 0,
    "text": "OK, 3 strikes and I'm OUT!  Outta Tavern 17.\n\nThe weird (slightly older, short, surly) bartender treated me very strangely - kinda like I have a stick up my a$$ or something.  Anyhow - I hemmed and hawed a bit as to whether or not to even order alcohol (And bartenders don;t care for this), and ordered an iced tea.  (No, not a long island one - a regular brewed one).  It was nearly BLACK.  Overbrewed.\n\nHe nearly went ballaistic when I dained to ask for Splenda and mocked me a bit.  I guess I deserved it.\n\nI also ordered two of the $1 sliders.  For a buck - they are well worth it and 2 (or 3 if I am absolutely starving) is perfect.\n\nThe best part of the night?  Tish (Leticia) the lovely hostess who got us extra chairs and gave me the ladies room key twice (I pee freely.),  Note ladies:  It's a long trek to the ladies room.  Also note: it's been recently renovated (The loo, that is).\n\nAll in all, had my friends not picked this place (I swear, twas not my idea) I woulda never set foot in the joint.\n\nSorry, Mickey or Mikey or whatever your name is...\n\nTish - you rock.  You deserve a BIG raise!",
    "date": "2010-05-12 00:47:45"
  },
  {
    "review_id": "w6hQG2zOjYZ-b3r9c-vadA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "q3k9lwaHNqbtiGc-XeHnKg",
    "stars": 2.0,
    "useful": 2,
    "funny": 4,
    "cool": 0,
    "text": "Why on earth suburbanites PACK this place (with kids, also) is beyond me.\nWe came here when we were out of other ideas and the wait at Grand Rodeo was 45 minutes.\n\nWell, the wait here was 45 minutes also (even though we were told it'd be 20-25 minutes.)\n\nLiterally THRONGS of people.\n\nAvoid on a Saturday night at all cost.\nMediocrity served in enormous portions with a side of bovine growth hormone.\n\nI'll pass.\n\nBut I bet somebody will drag me back here.",
    "date": "2015-08-21 11:33:22"
  },
  {
    "review_id": "DRQSzlO07-Ri7WuYFYgaaQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "BkTFtgkkOva49Dj3MIPN0Q",
    "stars": 2.0,
    "useful": 0,
    "funny": 3,
    "cool": 0,
    "text": "Meh - 1.5 stars.  food was 2 and service was 1 or zero.  My husband asked them to cut our kid's slice into squares and they could not figure out how to do this.  Odd.  We cut it ourselves.\n\nI had a chicken cheese steak.\nIt was pretty awful.\n\nWe won't go again.",
    "date": "2012-01-08 23:48:52"
  },
  {
    "review_id": "IpRCOTQ8nYDfD-nMveq8Pw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "1AQhRXA6GhMp6FjpS4T8lQ",
    "stars": 2.0,
    "useful": 5,
    "funny": 4,
    "cool": 3,
    "text": "I'm sorry but the food here truly sucks.\nWe came as part of a large group party (I would never dine here of my own accord - I men, El Limon, Chiang Mai and Black Fish are all on the same street!) and they provided a cash bar (luckily sodas were free) and 5 hot appetizers in chafing dishes.\n\nThank g-d for the vegetable tray - it was fresh and fine.\n\nWings?  Mediocre - kinda dry.\nMozz. Sticks - cold\nScaliop pieces (or was in a shrimp, or a piece of cheap fish) wrapped in flabby bacon - ICKY.\nFried Gyoza/Potstickers - clearly frozen but at least edible.\nAnd one other item I forget - as I clearly did not eat it.\n\nNot a fan.\n\nGross food.",
    "date": "2016-08-01 15:07:34"
  },
  {
    "review_id": "zSenk_lqVB04Hn74Lsafgg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "EOKwm-EHp7ToNcJqlYNHQA",
    "stars": 2.0,
    "useful": 4,
    "funny": 0,
    "cool": 1,
    "text": "Dana R.'s review is accurate.  Sarku has never been a favorite of mine - too oily and carb-heavy.  Chicken is just OK - very greasy.",
    "date": "2017-07-06 17:15:29"
  },
  {
    "review_id": "Uwrfd1lRS0H8S_MNWfouBA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "zDC1Tee3BUmq_BfTuq7_Ww",
    "stars": 2.0,
    "useful": 7,
    "funny": 2,
    "cool": 5,
    "text": "Pretty Mediocre.  The family stopped in here while house hunting in this area. Clean but GRAY and cafeteria-like dining area.  DD had a meatball sub (my meatballs are better - these were bready and tasteless), DH had a cheesesteak which he hated and I actually like my (Kronos pre-packed, obviously frozen) Gyro sandwich on Pita.\n\nThe gents behind the counter were friendly and very nice.\nI was leaning toward 3 stars until I tasted DD's sub.  Blech!\n\nBathroom was clean and decent.\n\nThe place needs a facelift for the dining room and a re-vamp of the \"classic\" Greek-owned Pizzeria menu.\n\nI wish I could have liked it better - but we will NOT be back.",
    "date": "2011-10-24 00:32:54"
  },
  {
    "review_id": "lCMyKUYoupI_qPb9lKYK5g",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "V51haBIS2sgRvUV28C978A",
    "stars": 2.0,
    "useful": 10,
    "funny": 6,
    "cool": 6,
    "text": "They opened a brand-new ALDI on 352 near the Wawa, where the old Giant (now across 352) used to be.\n\nI had a pretty crappy first experience, and I was excited to try Aldi as friends have said it is \"really cheap\".  Well, sometimes you get what you pay for...\n\nIn this case my experience sucked before it even began.  In the parking lot.  I walked up to get a cart and you need to put a Quarter in to release a cart.  Feh.  I had no quarters.  So I figured I'd \"wing it\" and only buy what I could carry (which was about  5 items). There are no shopping baskets inside the store, either.  What is this? Grays Ferry?\n\nSo I browse and I shop, and yes the prices are super low, but - BUT - no-name brands or brands I have NEVER heard of and no sourcing info.  (Fresh grated Parmesan-type cheese for $1.99 - distributed by ALDI in IL but WHERE is it from?  US?  Italy (no way)?)  Too scared to buy meat here. Bought my kid a cookies & cream type candy bar from Germany (interesting).\n\nI approach the checkout line and there is ONE lady working (everyone else has scattered) who desperately wants to go on break.  The lady ahead of me is being served and I remarked (out loud - my BIG mistake) Oh, they have no plastic bags?  And the eco-conscious lady ahead of me gave me a HUGE earful about how all stores should do this and how \"You need to bring your own bags\" and how it's better for the environment and on and on.  And, honestly, she is correct - but her snappy, bitchy-toned delivery needed much improvement.\n\nShe left and I paid for my $11 worth of stuff (which would have cost about $15 at Giant) and hand-carried it out to my car.  (Admittedly, I looked around in the parking lot to make sure that lady was gone.  She was really pissed off for some reason.) \n\nNext time I will remember to bring a quarter and my own bags.\n\nIf there is a next time.\n\nI am in absolutely no rush to ever return to ALDI.",
    "date": "2018-07-26 11:40:06"
  },
  {
    "review_id": "V566yTdLKFuZ0hjGzN2U4g",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "MQXOzhLEF-SV4azYDlOLeg",
    "stars": 2.0,
    "useful": 3,
    "funny": 3,
    "cool": 0,
    "text": "2 stars is plenty generous for this chain of BLAH seafood (all pre-frozen) and bisquick (Cheddar Bay) biscuits.\n\nIt's the Olive Garden of the sea.\n\nAnd my brother in law and his wife both worked here when they were just out of high school, met and fewll in love here and now are married.  Best thing to come out of a Red Lobster in my opinion.  Certainly the food is not \"gourmet\".",
    "date": "2008-12-04 21:29:52"
  },
  {
    "review_id": "QITJZPJ8NMpwaa29puKQ-g",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "Etz0yTASdtGnE42ntAdD5g",
    "stars": 2.0,
    "useful": 0,
    "funny": 0,
    "cool": 0,
    "text": "Picked up my stuff and paid $85 by personal check (Whatevah!).\nLady is very nice and clothing seems to be OK and does not smell bad.\n\nStill, I will NOT go back here.",
    "date": "2015-08-07 11:40:06"
  },
  {
    "review_id": "aP4ybbfv73pwtopLHNYaxA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "mieU5pqt_b3qrhkeopZ2Pg",
    "stars": 2.0,
    "useful": 1,
    "funny": 2,
    "cool": 2,
    "text": "So, against my better judgement, I walked in on a whim to see if I could get a (cheap) blow-out.\nI had a special event on a Saturday night and - by some miracle - the place was dead-empty.\n\nDanielle (a 22 year-ish, fresh outta High School stylist) did a simple and decent blow-out (not flat itron - as that would have added $15 - Feh.)\n\nSo my TOTAL was $15 - with tip was $21.  \n\nStill not mad about this place, but at least the high staff turnover has brought in some better people.\n\nWait 6 months - they'll all change again.  (The owner of this franchise owns OVER 50 LOCATIONS.  Wow!)\n\nGlobs of hair by front door - needed sweeping.\n\nI would NEVER get color, highlights or any complex chemical service here.\nIt's basically a training ground for stylists right outta school.\nLots of MEN and kids come here in search of a cheap cut.\n\nYou get what u pay for!",
    "date": "2017-03-15 14:11:26"
  },
  {
    "review_id": "Nf5rWUCxdqn39XkWcXUNSw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "U4yrxSpqLaPrGqcqok2vJg",
    "stars": 2.0,
    "useful": 0,
    "funny": 3,
    "cool": 0,
    "text": "Ok, it does suck here - but what choice do we have?\n\nI am a mother of one of those crying toddlers - and this is where we go to see such classics as Madagascar and Wall-e.\n\nOh, G-d.  Make it stop.",
    "date": "2008-12-30 20:06:29"
  },
  {
    "review_id": "91GmRSUYyK6DNJ41kQQwHA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "IaelRCI4Ah5oxiHuBnFC7w",
    "stars": 2.0,
    "useful": 7,
    "funny": 2,
    "cool": 2,
    "text": "This ShopRite is pretty nasty.  If you happen to come on a weekday, just after the shelves (and produce) are stocked - it's passable, but the weekends are hellish chaos.\n\nCustomer Service?  Slim to none.\n\nAt least the prices are lower than Whole Foods (as is quality) and sometimes lower then SuperFresh.\n\nOh - and when we shop with our child we always disinfect the nasty shopping carts.  Eeew.  Sticky & Gross.  I really loathe taking her there.  the slow moving lines make her antsy.\n\nNot a fave for me, but - since our choices for grocery shopping are so limited in Philly (Where ARE you Fresh Direct?  PeaPod?), I am glad they exist.",
    "date": "2009-06-08 13:27:06"
  },
  {
    "review_id": "_6saNMTYTJHeEiUlIZiGIg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "J6bDpaw9QQ3qqncfIK4StQ",
    "stars": 2.0,
    "useful": 2,
    "funny": 0,
    "cool": 0,
    "text": "I just don't dig the Coffee Bar.  It's OK in a pinch - but ING Direct has bette, cheaper coffee.  This place is EXPENSIVE - you are paying hotel prices.\n\nThe decor is still nicer - nicer than back in the Capriccio Days - and it ain't Starbucks. (Which is a good thing in my book.)\n\nNice place to sit & rest   - I usually buy one cheap beverage and nurse it a while.",
    "date": "2010-05-20 23:35:26"
  },
  {
    "review_id": "ZFpab_zMlTVPTLtRJHAnPg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "6Ps1_xpjEW9EkbqL5sxVpw",
    "stars": 2.0,
    "useful": 2,
    "funny": 0,
    "cool": 0,
    "text": "We ate here on July 2 - during the BIG crowds of the 4th of July weekend pre-fireworks mayhem.  We needed a place to kill 2 hours and eat.\n\nI went with DH & 6 year old DD who was pretty well behaved, considering.\nWe each ordered the $24.95 3 course pre-fixe and DD picked off my plate - Shrimp risotto (which was awful - gloppy and in some sort of weird \"brown gravy\")  Odd.\n\nThe soup - Clam Chowder - was watery and just Meh.\n\nService was bad, too.  The hostess is a doll and our server was fine - but the bus lady took alot of our stuff away before we were ready (I got up to use the ladies room and when I got back my napkin and water glass were gone. - I mean, who clears away the WATER glasses - you wait until the meal is over for that.)\n\nAnyhow, at least they waived the $5 plate sharing charge.\n\nWould NOT rush back - even though I still have dreams about the pierogies (only at lunchtime).",
    "date": "2011-07-04 18:52:35"
  },
  {
    "review_id": "BaTO7EvbwvSkzh7aWdXJZw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "Ag_GeZwOrT0nmyhnKQiVBA",
    "stars": 2.0,
    "useful": 2,
    "funny": 1,
    "cool": 1,
    "text": "Friends don't let friends drink fourbucks.  This particular location is crowded fduring the AM rush especially.\n\nI also call it CHARbucks as the coffee drinks usually are roastde too dark for me.  The espresso drinks are passable - but be careful as they are loaded with sugar and often with fat if you get them made with whole milk.\n\nNot a big fan of Starbucks in general.  We grind and brew our own at home using peregrine coffee beans for a fraction of the price.",
    "date": "2009-01-06 18:43:49"
  },
  {
    "review_id": "BxVfOOWCbNHJDOPL0DGlrg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "36DHttegRgSBnD0VWUhnNw",
    "stars": 2.0,
    "useful": 3,
    "funny": 0,
    "cool": 1,
    "text": "I am vacillating bewteen a 2 and a 3.\nGrabbed a quick sushi (4 pieces of nigiri and 1/2 a california roll) and it was $12.00 and change after tax.  Yikes.\n\nThe Salmon was fine - but the tuna tasted a bit old.\nMall Sushi.  Serves me right, I should know better.\n\nI will not be back in a hurry and if I return I will try the \"cooked\" food instead.\n\nThe hot food looked OK but there were alot of fried items.",
    "date": "2012-09-19 19:42:01"
  },
  {
    "review_id": "XUyCCsnH1Mfd9VGJI0otEw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "jZGqAdBlDnrP-J7--vdPxA",
    "stars": 2.0,
    "useful": 2,
    "funny": 0,
    "cool": 1,
    "text": "Quick cheap and good for college students.\n\nLet me just say that the last time I was in Beijing was 1995.  Really.\nI am amazed it's still here.  It's becoming a Penn institution.\n\nBack in the day I'd get the lunch specials. CHicken & Brocolli or Steamed Shrimp & Veggies.  More than a few orders of thick doughy dumplings, too.  (Not the greatest by any stretch.)\n\nQuick and cheap.\n\nNot superb - but a good value.",
    "date": "2008-07-16 15:51:25"
  },
  {
    "review_id": "-13pAx7IW9JZQ_N-a3-UQw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "aunmz06iWvo3bd6MMHEbqg",
    "stars": 2.0,
    "useful": 10,
    "funny": 3,
    "cool": 0,
    "text": "Meh.  It's really small - and has a coffee bar, a bar and ONE (lame menu) burger-bar food based restaurant.\n\nLots of slots and a few table games.\n\nNot my bag, baby.\n\nHonestly?  Were it not for proximity - I would NEVER come to Sugarhouse - I'd sooner go to AC or even Bethlehem, PA.\n\nPhilly fought long & hard to get a casino - and THIS is what they get?\n\nSorry - Unimpressed.",
    "date": "2011-01-04 19:45:51"
  },
  {
    "review_id": "Ko8WatJoQoQYqb1mvgmzUw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "_1itCzaA3bDVdPSwNCNPtA",
    "stars": 2.0,
    "useful": 1,
    "funny": 0,
    "cool": 0,
    "text": "Yuck.  I really loather chain restaurants and Chili's is no exception.  The one nice this about this Chili's is it's proximity to the Penn Campus and the universally cheap and greasy burgers and other fried foods are the same at any Chili's nation wide.\n\nIt's kinda dirty in here - and the place is run by teenagers.\n\nI guess it beats TGI Friday's - but not by much.",
    "date": "2008-07-14 13:56:40"
  },
  {
    "review_id": "PFYSPSw7EU_G_USgU0Uu4A",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "AcYIHFnobT3yT6bSZg2UgA",
    "stars": 2.0,
    "useful": 1,
    "funny": 0,
    "cool": 0,
    "text": "Yes, Tom A.  everyone IS right.  Total mediocrity and a neccessary evil.  Philadelphia has a piss-poor number of grocery stores and supermarkets.  The Superfresh kinda sucks, the Pathmark is ghetto and this ACME is barely passable.\n\nWe come here when we don't wanna deal with Superfresh's picked-over produce.  And then we'll come here and it'll be just as bad with a  picked over dairy case.\n\nCHECK YOUR FRESHNESS DATES on meat and dairy products especially.  We found yogurt that was 2 weeks past it's date.  (We told the manager who promptly pulled it off the shelves.)\n\nBe careful.\n\nLike Superfresh and Pathmark (which are also filthy), ACME could use a good cleaning.  The floors are just nasty.",
    "date": "2009-01-05 20:59:59"
  },
  {
    "review_id": "ryCl6sklSPHM0eiIuKkKQg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "dD8qp4Ro74EI4DqQl8FFCw",
    "stars": 2.0,
    "useful": 1,
    "funny": 0,
    "cool": 0,
    "text": "Stopped in once while in 30th Street - looked around and left.\nI'm not a big fan of Au Bon Pain.",
    "date": "2013-07-03 18:53:32"
  },
  {
    "review_id": "vilOgiJ3xjvH_aUye2yNxQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "OkybC0J0Qojq515LDGVRZQ",
    "stars": 2.0,
    "useful": 1,
    "funny": 0,
    "cool": 0,
    "text": "I had a mediocre at best experience here.  I would NEVER get a pedicure here.  I came here once to try it out (on just a mani) and I won't return.  First of all, it's very cramped in there - and if you don't have an appointment, you could be waiting a while.\n\nThe techs are mostly Asian and don't speak alot of english.  The lady I had seemed very rushed to get me done and get onto the next client.\n\nThey do not offer massage.\n\nWhatever.  El-Cheapo rushed, basic mani.\n\nI won't be back.",
    "date": "2009-02-18 19:30:45"
  },
  {
    "review_id": "Y4ONP2ngAG7N21eE1HWTUQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "Q1jYPFUp2PCZVhsRwg0rrw",
    "stars": 2.0,
    "useful": 0,
    "funny": 1,
    "cool": 0,
    "text": "This City Nails is not owned by the same people as the $hi*ty  nails on South 17th Street.\n\nThis place is marginally cleaner and better run - but it's still a far cry from clean, sleek & luxurious.\n\nWhat it is is cheap and, for some, convenient.\n\nThe ladies will shout \"Peek-collah\" at you when you arrive.  I usually bring my own base & top coats as I do not care for the no-name  base coat they use.\n\nI would NEVER get a pedi here.  I am uber-picky about pedis and only get them at Spa Elysium from Cheryl Lee.",
    "date": "2009-01-28 20:56:04"
  },
  {
    "review_id": "oddm7dOa51ExxuZtYaVnTQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "Etz0yTASdtGnE42ntAdD5g",
    "stars": 2.0,
    "useful": 2,
    "funny": 2,
    "cool": 0,
    "text": "Uh Oh.  I should have trusted my instincts.\nI dropped off $85 worth of clothes today and she told me it would be cash or check only and I was like \"What???\" Plus it smelled just AWFUL in there.  (She wanted to charge me $13 for each dress - but I talked her down to $11 which is what my other cleaner charges.)\n\nSo against my better judgement I left my clothing there.  They are due to come back Thursday.  I pray they smell OK.\n\nWish I would have read these reviews first.\n\nLady was very nice but also pushy and I felt guilty not leaving my stuff there even though many red flags went up even before the whole \"no credit card\" thing.  It just smells HORRID in there.\n\nI hope I do not get burned,\nI have a sneaking suspicion i may nee to take the clothes somewhere else and re-do them.\n\nFingers crossed.\nIf I can please get my stuff back unscathed I highly doubt i will ever fall for this again.",
    "date": "2015-08-04 18:24:59"
  },
  {
    "review_id": "ZmNQFvvbJDmfiLu2vLvQjA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "qF1NTfE0yfbTc1kb2mX1FA",
    "stars": 2.0,
    "useful": 2,
    "funny": 2,
    "cool": 1,
    "text": "Um - for this part of Philly it's not so bad - but compared to a \"normal\" Pier one?  It's kinda hectic in here at times and the displays get knocked around and messed up due to the crowds of Phjilly folk that rush on through.\n\nA decent place for home decor, furniture and table ware. (Candles on sale are a good deal.)\n\nNot a big fan though, due to the disheveled feeling of the store.",
    "date": "2016-02-22 14:13:34"
  },
  {
    "review_id": "OYfXGMEwcMKj_gty5e_Udg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "FmVJrQGXpW1RKdqItKjVYw",
    "stars": 2.0,
    "useful": 1,
    "funny": 0,
    "cool": 1,
    "text": "Hit or miss - but when you hit, you hit big.\nYou gotta be prepared to wade through the scattered, disorganished racks and try things on,\n\nCheap? Yes.\nPain in the neck to shop here? Yes.\n\nThere are better and worse Marshall's locations.  This one is just MEH.\nAvoid during December and 1st week of Jan (holiday lines are long and sooooo not worth it).",
    "date": "2013-03-06 16:31:59"
  },
  {
    "review_id": "DxKtIqQ8unscd7ZCE0RxZQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "b2WN3yA79dMvCUMywM3I_A",
    "stars": 2.0,
    "useful": 2,
    "funny": 1,
    "cool": 0,
    "text": "What can I say anout Dunkin Donuts - really?  Some people love the coffee here - I think it's just OK.  (I mean, once you've been spoiled by Peregrine it's hard to turn back)  It's better than Charbucks - and cheaper.\n\nI have also tried the regular and white hot chocolates.  They are mixed from powders and come shooting out of a dispenser.  The white hot chocolate is like drinking a cup of sugary fat.  It's sickening.  The \"regular\" hot cocoa - while also sugar laden is at least drinkable.\n\nThe donuts are not baked on premises and thus sometimes are not too fresh.  \n\nI guess I'm just not a DD gal. America may run on Dunkin - but I'll be running away.  Oh - my 5 year old LOVES DD - especially munchkins - but she's 5 and will eat anything sweet.",
    "date": "2010-01-03 20:41:16"
  },
  {
    "review_id": "gS7AxjPk73pcAqJEvdyKtg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "hqXEIbAt-4bYKoDbXWFiBw",
    "stars": 2.0,
    "useful": 1,
    "funny": 0,
    "cool": 1,
    "text": "kKnda grungy - but they DO play classic rock tunes while you shop.\nI get a few staples/non perishable items here and then hit whole foods for produce and hormone-reduced dairy.",
    "date": "2009-02-27 16:26:17"
  },
  {
    "review_id": "r5o7rssz77gayJb5sndWKg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "nnj7qBkatEsflXfnPzsBZw",
    "stars": 2.0,
    "useful": 2,
    "funny": 2,
    "cool": 3,
    "text": "In the old days when 94.1 WYSP was classic rock (with Andre Gardner and Debbie Calton) I loved it.  Now all the good Classic rock is at WMGK 102.9 (Oddly enough that was the lite hits - valium rock channel back in the day.)\n\nAlso John DiBella (from WMMR is now on WMJK in the mornings - and is still as wacky as ever.  But I digresss..\n\nAnyhow, now 94.1 plays alot of commercials.  In between the have a good mix of harder and softer well-known and lesser known rock and urban-rock hits.",
    "date": "2008-08-15 19:58:09"
  },
  {
    "review_id": "2MnnmuuGnMNdTaWOaCgZsQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "kuKlsfJ4MFFzGAw92OS1XA",
    "stars": 2.0,
    "useful": 7,
    "funny": 4,
    "cool": 3,
    "text": "Better than it used to be - and schedules are still often late/behind.\nTake the train if you can afford it - Greyhound is just awful.\n\nSepta or Amtrak are much better than the buses.\n\nSurly service from underpaid workers.",
    "date": "2019-07-14 18:14:57"
  },
  {
    "review_id": "Ye8AlwiFjYHQ2on5yTGXeQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "P3bw4h4kCaMaYqGGNLt3Jg",
    "stars": 2.0,
    "useful": 2,
    "funny": 0,
    "cool": 1,
    "text": "Started out GREAt and was all down hill from there.\n\nIn the fall of 2007 I went to Mission grill and had the most AMAZING lunch.  A delicious salad with shrimp & crab - fresh avocado and mango.  Cilantro-lime-yumminess for dressing and cute little tortilla strips.  Four to Five star food and great service.\n \nIt was so good - and the place so new (I had yet to realize that \"The pube\" - public house - owns it.) that I even RECOMMENDED others at my firm to try it.\n\nI had another good lunch.  And another.\n\nAnd then my (now husband, then) fiance and I went for New Years eve.\nAnd it was about 3 stars.  (Now, I know, I know, NYE is a bad night on which to judge a rest-o - but wait...)\n\nIn February 2008 I retuned for another lunch - and lo... the menu was completely changed.\n\nNo more salad.\nNo more empananas\nMediocre gazpacho.\n\nAnd service has gone waaaaaaaaay downhill.\n\nI also came for a happy hour in April 2008 where I had a \"$5. Margarita\" that tasted like lime pixie dust.\n\nSorry.\n\nThe place has peaked and is now on the way down.\nI hope they'll turn it around.",
    "date": "2008-07-28 18:14:44"
  },
  {
    "review_id": "iNryPtMsgQ8b8N1JsJceXg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "lJGE2v4S6gV4dIlw3E8ydw",
    "stars": 2.0,
    "useful": 1,
    "funny": 2,
    "cool": 1,
    "text": "OMG Romano's is just AWFUL.  Yes, it's a chain.  Yes they serve sub-par bitter (often rancid) carafes of inedible olive oil on every table.  Yes, the food is loaded with salt.\n\nNo, this is not what Italian-American food should be.  No, I do NOT want to ever come back here.",
    "date": "2009-10-12 00:21:24"
  },
  {
    "review_id": "HtLYLt3AM-ZYsF_6cYxUUQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "eZldAV-8VNSnrlbG270Wzg",
    "stars": 2.0,
    "useful": 5,
    "funny": 4,
    "cool": 1,
    "text": "Customer service is slacking - especially if you order inside the store (They are all busy dealing with the drive thru).  You need better counter people - some of the old crew has left and you can tell.\n\nStep it up, Media, Starbucks.  We need you!",
    "date": "2019-05-06 18:20:16"
  },
  {
    "review_id": "bPhdxnq4VLaKGnmE_TKDiw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "F43ox1eEedpvt6968xp0sA",
    "stars": 2.0,
    "useful": 8,
    "funny": 3,
    "cool": 2,
    "text": "Meh.  Just ok, but my elderly parents love it here. Inexpensive and \"safe\" breakfast, lunch and dinner, too.\n\nAvoid the fish (salmon, talapia), ick.\n\nStick to eggs and pancakes",
    "date": "2019-08-24 17:30:27"
  },
  {
    "review_id": "bAQQ2xh_vsPQcMBL5R1mNQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "zc5VAa0CBWIvk7GLr9d5Qw",
    "stars": 2.0,
    "useful": 3,
    "funny": 7,
    "cool": 2,
    "text": "This place is way passed its prime.  It's been around since the late eighties - and back then was one of the only \"Adult\" shops around.  Frankly, I can't believe they are still here.  \n\nBut yes, you can stock up on toys and party favors here - and other \"naughty bits\".\n\nAnd yes, it is in the BASEMENT - and theirs just something psychological for me about going DOWN into a sex shop.  (Ba dum, bump!)",
    "date": "2008-11-14 17:48:25"
  },
  {
    "review_id": "l63DiqIU4hpkvTEkL0ETjQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "9ZiARoddTm3anAtWzZo4Bg",
    "stars": 2.0,
    "useful": 8,
    "funny": 17,
    "cool": 4,
    "text": "Pretty darned awful.  We were cajoled into coming here by our 5 year old after dining at the illiustrious IHOP next door.  After purchasing $10.00 worth of tokens it was off to the filthy, sticky, germ-laden \"rides\" and games. \n\nI could feel myself contracting a rhinovirus by the minute.\nOh - and when I put a token in the mini carousel (my kid was the only one on it) about 5 little kids sensed \"free ride\" and pushed their way on board freaking her (and me) right out.  NO PARENTAL supervision of these kids.  Ugh.\n\nWe also played some \"ski-ball\" and then the little one fed the tickets into the \"ticket muncher\" to have them counted which took about 23 minutes.  The 103 tickets got her a cheap plastic ring, stickers and some small plastic object that I still don;t know what it is.\n\nAnd we still have about 8 tokens left over for next time.\n\nNext time?\n\nOh dear g-d please don;t make me come back here.",
    "date": "2009-12-12 22:12:00"
  },
  {
    "review_id": "gdbfhHQ235Bp3E5EKkucKA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "jkGQQ4_LgJx3hwPtCFkzbQ",
    "stars": 2.0,
    "useful": 5,
    "funny": 5,
    "cool": 4,
    "text": "We were greeted in a very friendly manner and offered free chocolates.  After being seated though, we just had to leave.  This is not an appropriate venue for a business lunch.  Loud, distracting decor and a predominantly chocolate menu made it hard to choose from the over priced snacky-type lunch menu.\n\nSave this place for a date or (if you're rich) bring the kids who are sure to be entertained here.\n\nThis place will fail if they don;t offer some sensible lunch choices (Salads were $13.95) or lunch specials.",
    "date": "2009-08-12 11:31:58"
  }
]