[
  {
    "review_id": "CmOfzihsuWQFLK1cPDB7-A",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "JUlsvVAvZvGHWFfkKm0nlg",
    "stars": 2.0,
    "useful": 7,
    "funny": 2,
    "cool": 3,
    "text": "Read Catherine L.'s review - and my sentiments are echoed.\n\nA close friend and I came here  for dinner.  When we had trouble finding the place (we were at the \"A Full Plate\" end of Liberties walk, we called on the phone and a nice man came out to get us and walked us over.  This, alas, was the best part of the meal.  Things got progressively worse and worse.\n\nFirst we were seated (inside - at our request) and our drink order was taken by a clearly overworked, spread-too-thin male server (who was very nice and tried his best - 3 stars for him).\n\nAfter taking our meal order we waited, and waited, and waited...\n\nAnd waited some more...\n\nAnd finally asked harried server to please bring our chips and salsa (as he had just brought some to another table nearby).  We were starvin'!\n\nThe smoky salsa and salsa verde arrive - in hot bowls \"fresh from the d/w\" and thus we had warm salsa.  Yech.  And the salty chips were \"chipettes\" (or to be mean - crumbs.)  smashed to smithereens.\n\nOK, things aren't so great - but we await our entrees.\nWow - Impressive looking - I order a single beef shortrib and feel like Fred Flintstone.  This thing is HUGE.   Gi-normous!  Like a brontosaurus rib.  Alas - there is no sauce.  My friend orders an \"OK\" pair of Chicken burritos that are no better than Qdoba.  \n\nSo here's the kicker...  About 3/4 through the entrees, frantic server appears again with a six-pack of sauce.  He gives me a bottle of HOT and a bottle of SWEET.  I pour out a bit of the sweet onto my plate (disregarding the crust around the rim of the squeez bottle) and dip my meat in.  UGH!!!  Racidity Central.\n\nThe HOT sauce is not rancid - and has a nice flavor but it just to hot for me.\n\nMy appetite is now officially GONE.\n\nAnd shortly thereafter, so were we.  I will not return.\n\nSuch a disappointment.",
    "date": "2009-08-17 00:36:10"
  },
  {
    "review_id": "p1-KOZGOrrANK_ADvIKJDw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "A9rVxmIBtHZRvNhbBaGAWg",
    "stars": 2.0,
    "useful": 5,
    "funny": 3,
    "cool": 1,
    "text": "Not sure why so many raves.\nThe place is so dingy and needs a good cleaning.\nThey do offer many authentic dishes like Duck Tongue and Frog, but we were not interested.\n\nWe got the ($32) Peking Duck and the meat was dry.\nEggplant with garlic sauce (the best dish of the night) was so hot we could barely eat it.\n\nFood is very spicy - even dishes marked mild (but that is also part of the Szechuan experience).  Compared to Han Dynasty in Philly - this place is awful.\n\nNot coming back any time soon.",
    "date": "2014-01-20 00:02:09"
  },
  {
    "review_id": "pJyeC5qB3zVRgl_elEVnOw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "_EKvNMC2Mm67HzqNIzLgXg",
    "stars": 2.0,
    "useful": 2,
    "funny": 3,
    "cool": 7,
    "text": "Not good, Temaki.\nI am sorry to report that our last visit (albeit it was \"Dining Under the Stars\" aka \"Chaos out in the Heat\") the service and food quality both were Just \"Meh\".\n\nMike tried hard to please us but after receiving 2 warm and watery diet cokes (they were, thankfully, removed from the bill) and cold, soggy sweet potato tempura rolls - I am not a fan.  Also, this is now the 2nd time the salmon tasted \"fishy\".  Fresh raw salmon should not taste this way.\n\nUnfortunately for me, my 8 year old ADORES the place - especially the tasty shrimp shumai (served with a saffron cream sauce and fresh sweet corn kernels) and california rolls.\n\nWe'll be back - and pray you won't take it out on us, but food and beverage quality needs to improve.\n\nThe female manager is very sweet.\nI think the guy hates me.  (He might really hate me now.)  \n\n:(",
    "date": "2013-08-08 12:10:42"
  },
  {
    "review_id": "S2Yi_sdlnjJCCnzT0-1_8A",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "GUMVStVaJfWmCIpQA4TtHg",
    "stars": 2.0,
    "useful": 0,
    "funny": 0,
    "cool": 0,
    "text": "Meh.\nYou get what you pay for and they do go crazy with the Kewpie Mayo here - so either avoid rolls with mayo or ask for sauces on the side.\n\nI had seen the place (walked by) and read the other yelp reviews - but for $8 (2 maki - you can get 3 for $12) I figured I'd give it a shot.\n\nService was icy-cold at first (one lady was kinda mean - she was prepping a table for a large party that was not there yet and clearly did not want to stop to help another table) but then my \"real\" server showed up and was very sweet. Vibe is kinda icy too - with colored LEDlights that change color and rock-hard banquettes that are straight up & down and not that comfortable to sit at.  Water was brought instantly (YAY!) and green tea (which I had to ask for) was free.\n\nI ordered a yellowtail scallion roll (had decent yellowtail but hardly any scallion in it) and a roll with salmon and grilled onions (loaded with mayo blobs on top which I scraped off - seriously, at least 3-4 tsp. of mayo.  Eew).  It was also supposed to have masago but there was NOE in there - and when I asked the (sweet) girl about it she said they don;t include masago on the lunch special.\n\nThese people are certainly cost consious - as the lettuce & dressing salad indicated (no tomato, no nothin').\n\nI am in absolutely NO HURRY to come back here - yet - oddly enough - I ran into a friend here with another aquaintance and the LOVE it here.\n\nMeh. Meh. Meeeeeeh.\n\nSorry.\n\nDoma and Vics cost more - but are sooooo much better.\n\nNope.",
    "date": "2013-09-13 16:45:01"
  },
  {
    "review_id": "cXs9yW2V5xIOz7SZCVOCMg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "3BJxm-HnvzdwD1zjmSbmyQ",
    "stars": 2.0,
    "useful": 4,
    "funny": 5,
    "cool": 3,
    "text": "Ok, I came here on the advice of co-workers who basically said \"Don't eat at Long River\" - which is across the street from my office.\n\nSo I trudged over the 2-3 blocks to Golden Chopstick, stood in a pretty long line and ordered a Chicken & Stringbean lunch special with brown rice to go. \"Light on the sauce\", I implored.\n\nService was friendly and the order took about 6-8 minutes to come out (not bad considering there were 7 people ahead of me.)\n\nWalked the take-out grub back to my desk and voila.  Tasteless - abut thankfully not greasy due to the lack of sauce.  Beans were the best part - crisp.  Chicken (thankfully white meat) was bone dry and flavorless.\n\nNot sure If I'd ever come back.\n\nNow I am really in fear of Long River.  This is supposed to be the \"good\" Chinese place near my office.\n\nOh well.",
    "date": "2009-04-23 17:05:22"
  },
  {
    "review_id": "Mvx7-ehbv5Vv94JV5McamA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "1OgRJcJ2tsfkZn5tCjhNKg",
    "stars": 2.0,
    "useful": 5,
    "funny": 1,
    "cool": 0,
    "text": "A true CLASSIC dive-bar - but luckily the low, low prices ($4.95 for a patty melt - no fries) and decent \"greasy short order\" cookery match the dated '70's décor.\n\nGretchen is a great bartender and the locals all gather round to down a few beers and grab a quick smoke out back.\n\nNOT a yuppy-Media-bar at all.\nThis is one of the TRUE Media originals.\nFamily owned - great customers and low-brow food and décor.\n\nJust what I need when I want a CHEAP drink.",
    "date": "2017-03-17 18:22:40"
  },
  {
    "review_id": "7UrfkXSSJP-qf31r4BvFiQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "qgAIg5FCQl5bUNpYvg_SbQ",
    "stars": 2.0,
    "useful": 3,
    "funny": 1,
    "cool": 2,
    "text": "This is the Perkins where my then-unemployed friend and I (in our late teens) experienced that great grease-fest of '90.  We ordered a fried appetizer combo of mozz. stix, chicken things and other fried stuff.\n\nAnd coffee.\n\nLots of coffee and cigarettes.  (You USED to be able to smoke in a pancake house, but alas, no more.)\n\nWhat a regrettable meal.\nI shoulda just had pancakes.",
    "date": "2008-08-25 00:52:50"
  },
  {
    "review_id": "wc58_xUQO7EVmzlJlRt8TQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "xrUtLEFyxzfjflTC2nqLXQ",
    "stars": 2.0,
    "useful": 2,
    "funny": 0,
    "cool": 1,
    "text": "I won't be returning to Coco anytime soon.\nI stopped in at 7:45 AM this morning after passing by many times and seeing the sign advertising over 6 different kinds of soup.\n\nI figured that soup would not be available in the early AM - but the lady said that it was if I really wanted it and what kind would I like?\n\nI settled on a small Chicken & Dumpling soup.\nAfter a while she brought out a styrofoam bowl from the kitchen and asked me, \"Do you want that heated up\"?\n\nWhat?  Are you kidding me?  \"Yes, of course\".\n(I was thinking, what?  I'm gonna eat cold soup?)\n\nWhatever.\n\nMeanwhile the one male cashier was very, very cute.\nThe soup itself was fine - not mind blowing but certainly not worth a rush back.\n\nService here is just plain odd.\n\nI will not be back.",
    "date": "2013-01-15 13:31:02"
  },
  {
    "review_id": "65nNp6jhFZ4l1JY6ozBTgg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "Ee0DwQtmCxhcwSFvX1Gl6g",
    "stars": 2.0,
    "useful": 2,
    "funny": 3,
    "cool": 3,
    "text": "Ugh.  Don't get me started on O.G. - and this one in particular is where 2 out of 3 of my DH's brothers had their wedding rehearsal dinners.\n\nThus, my (then future) FIL wanted US to have our rehearsal dinner there too.  NO WAY!!!  (We wound up going to Bensi's across the street).\n\nMeanwhile - O.G is NOT Italian.  It's faux-talian-american.  And it's full of kids.\n\nI am not a fan of the over cooked, over sauce formula-cooked pastas.\nIt's OK in a pinch but there are so many way better choices.",
    "date": "2009-04-15 14:21:41"
  },
  {
    "review_id": "rDfvkdRukdwle9XoPYyPqQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "iUZEGx29miZObLd6_lt7Vg",
    "stars": 2.0,
    "useful": 2,
    "funny": 2,
    "cool": 1,
    "text": "OK.  I have to tell you that I DID NOT GET TO ACTUALLY EAT HERE.  So I can not comment on the food - who friends and colleagues tell me is great. I have also been told that when they screw up, they screw up in a big way.  Well they screwed up today.\n\n I am rating Sabrina's on the abysmal way in which I was treated this morning at 9:40 AM.  Yes - on Saturday AM's the place gets slammed - but I was BY MYSELF - solo - and could have easily been greeted and asked to sit at the counter which had 4 open stools.  Since it was before 10 (don't even think about coming at 11 on a weekend) there were even 2 tables open (where the 2 other parties got seated.)\n\nNevertheless the host ignored me and proceeded to seat the party before (natch) and after me and NEVER GREETED me.  \n\nI pulled a menu off of the pile on the host/hostess stand and read it for a few minutes (sounded good- medium to high prices).  Still nothing.\n\nI just said \"screw it\" and left.\n\nI hope to actually get a chance to eat here in the future.  I guess singles aren't too welcome here.  Next time I'll bring my adorable 4 year old.  I bet we'll get seated.",
    "date": "2008-10-19 21:22:10"
  },
  {
    "review_id": "C2dkh2xjWL13BvXghzjCeA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "HurD0KDmuuHVNnh1lGb_OQ",
    "stars": 2.0,
    "useful": 5,
    "funny": 1,
    "cool": 2,
    "text": "OMG - horrible.\nStay away.\n\nDisinterested service that does not acknowledge when you walk in.\nCheap, but overly fried and greasy food (Lunch combos are all under $6).\n\nI drank my 85 cent diet coke and threw most of my fried (They would not make it for me steamed even though I asked) tofu and broccoli.\n\nBrown rice (they do have it - probably a big mistake) was gluey.",
    "date": "2016-02-19 17:20:59"
  },
  {
    "review_id": "f8M55yzOXzpvllcjEO4muw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "Ee0DwQtmCxhcwSFvX1Gl6g",
    "stars": 2.0,
    "useful": 4,
    "funny": 1,
    "cool": 1,
    "text": "1 star for food but 4 star service from our 2 female servers and the chic Manager on Duty.\nWe had a private part for 10 on a Sunday for lunch,\n\nMy food was inedible but the other folks snarfed theirs down.\nSo salty/oily (Shrimp Scampi) and even though I asked for the pasta to be cooked al dente, I do not think they know the meaning of those words.\n\nNot a fan and never will be.\nMy in-laws family loves it here for whatever reason so every year or two I get dragged along.\n\nThis is NOT Italian food.  This is formula cooking administered by college kids.",
    "date": "2016-01-11 13:07:44"
  },
  {
    "review_id": "t-2xvTxh5YrXy0OsuKOlPw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "T9nNz9-3mfNga0T0Nfzvsw",
    "stars": 2.0,
    "useful": 6,
    "funny": 4,
    "cool": 1,
    "text": "Otto's dumpy brauhaus has been around for years & years & years - as long as I can remember.  I went twice over the years and both were pretty bad - but I am not a \"wurst\" gal.\n\nYou can drink yourself silly with the NUMEROUS beers on tap and in bottles.  (Alas, I am not a beer gal either) You can watch the game, ogle the dusty old busts of deer on the walls or count the multi-colored beer steins hanging on the walls.\n\nIt's just not that great.  The food is mediocre at best and some of the servers (who've worked there for eons) just really don't care any more.\n\nIf you LIKE German food - then go, otherwise I'd skip it.",
    "date": "2009-01-07 15:19:26"
  },
  {
    "review_id": "qHU4TykQ7fFsGTf_t2SNww",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "by2wRASwOKpCZU9KtZ3MHA",
    "stars": 2.0,
    "useful": 1,
    "funny": 1,
    "cool": 0,
    "text": "Mediocrity.  Came here when I was in a huge rush and Hip City Veg (next door) was bustling and Nom Nom ramen had a long line.  Spent about $6 on a latte and a stale bagel with veggie \"light\" cream cheese, tomato and cucumber.\n\nBitter overpriced latte.  \n\nBLAH.\n\nWaste of calories.\n\nNot goin' back.",
    "date": "2013-04-23 17:33:20"
  },
  {
    "review_id": "DJP1m2TLscsS8D-UNJ1HIA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "2-6E1sAD1MKUixksDw-hkw",
    "stars": 2.0,
    "useful": 0,
    "funny": 0,
    "cool": 0,
    "text": "This Mickey-D's has been on Sugan road for years and years.  I rarely stop in (I don;t \"do\" fast food) unless dragged in by a friend or relative.  But - they have clean (relatively) bathrooms and that has saved us on occaision.",
    "date": "2013-03-06 16:26:19"
  },
  {
    "review_id": "ORXyEYHP5fMZr_8o4C-KGQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "K2svtoFXk68mFIIwLjG36g",
    "stars": 2.0,
    "useful": 2,
    "funny": 0,
    "cool": 0,
    "text": "Meh.  Just like the ones in NYC - over priced but quck and convient with food that looks better than it tastes.\n\nAnd $3.50 for a small bowl of lettuce (add ingredients to make a salad) is robbery!\n\nAnd my egg bagel was flavorless and slightly stale.\n\nWon't be back.",
    "date": "2013-06-12 13:49:30"
  },
  {
    "review_id": "vpQnEA7ZmrnHVJba-ZGeCg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "eFKG-I-rfuBmzWlDoiZwRQ",
    "stars": 2.0,
    "useful": 5,
    "funny": 2,
    "cool": 2,
    "text": "So disappointed with our take-out order from Chin's - which is pretty much the \"only game in town\" for D-town Chinese nowadays.\n\nThe spare-ribs were burnt and just plain bad - we threw one away (You get 5 for $8/95.  The pepper steak with onion was loaded with onion and very little beef - although what was there tasted great. \n\nThe best part was the house special fried rice - made to order and very good but man, everything else was not great this time.\n\nWhat happened?\nChin's is our go-to and we'd hate to stop going.",
    "date": "2020-01-27 15:30:30"
  },
  {
    "review_id": "OgvB1kpmjpk5zjvUtcPfAw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "SCjUeZfjafJ88fWWQjRh2w",
    "stars": 2.0,
    "useful": 4,
    "funny": 1,
    "cool": 2,
    "text": "Not a happy camper.\nWent to El Rey at 4:40 PM - was told no dinner until 5 - but we could have a drink and chips & salsa ($3.50 - very tasty).\n\nI ordered what i always get - the classic margarita.  Ugh - it was so bitter.\nI asked them to re-make it, explaining that it tasted unusually bitter.  they remade it - and it tasted the same - dreadful.  They remade it a second time and it was good - but not the smooth, limey-sweetness that it usually is.  So I drank it.\n\nI got fish tacos ($9 for 3 tacos) and they are the exact same tiny tacos you get for $1 during happy hour - no rice or beans or anything with them.  So I got a side order of corn on the cob (good stuff!).\n\nI am sticking to happy hour here from how on.\nMy husband will stick with Qdoba.",
    "date": "2011-12-19 15:04:51"
  },
  {
    "review_id": "em3dOPnzt2nz91LZc3ferA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "55WfAHNTRR_GdNB9ko84tQ",
    "stars": 2.0,
    "useful": 1,
    "funny": 0,
    "cool": 0,
    "text": "I was a Big OS catalog customer (website) back in tha day, so I went in to see if I could get some bone-in 14 oz. Strips.\n\nThere were 2 other customers and a delivery man ion the store all waiting to be helpeed.\n\nSo I browsed around a bit and left.\nMeh customer Service.\nI will order online if I need help quickly.\n\nThis location is gonna die.\nHorrible Parking lot.",
    "date": "2014-04-03 15:25:34"
  },
  {
    "review_id": "2LUiJ9d6m-6tWPdwXS7Wsg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "qEcBKBjkuOCtcPIfcuNEIg",
    "stars": 2.0,
    "useful": 2,
    "funny": 2,
    "cool": 0,
    "text": "OMG - it's still here!\nThis is the Taco Bell from my childhood - and it has been renovated a couple of times since the '90's.\n\nNot a big T-bell fan - but in a pinch, it's here.\nI avoid fast food whenever possible.",
    "date": "2016-07-06 15:11:49"
  },
  {
    "review_id": "Vp0cDblLB2s9s9LdFyq2gw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "7gyFoLqapUSW94EI6pFekQ",
    "stars": 2.0,
    "useful": 5,
    "funny": 2,
    "cool": 2,
    "text": "I am NOT an Outback fan - and this location is no exception.  I was dragged along for a family birthday celebration - and the person who's birthday it was is on Atkins and can only eat big hunks of meat.\n\nSo here we go - we had a party of 7 - and were seated right away because we can at 4:40 PM - otherwise I can only image how long a wait would have been on a busy Saturday night.\n\nService was absolutely fine - but the ladies room was HORRIBLE.  I told a guy in the bar area about the trash on the floor and they cleaned it up right away.\n\nAs for the \"formulaic\" food - it was edible.  Not good but not inedible.\nI had a rib-eye steak (asked for it without the salt-lick seasoning they usually use - I have learned my lesson from past salt-lick-steak experiences). Added a grilled lobster tail for $11.95.  Seriously?  This this was barely 2.5 ounce.  I could have had a bunch of shrimp for a fraction of the cost.\n\nAnyhow - I also got a naked sweet potato as a side (not brown sugar - and the giant lump of butter came along side.)\n\nOur 11 year old got a salad topped with grilled shrimp (again sans seasoning - as it is just too salty for our family's tastes).  She said - and I quote she felt, \"unsatisfied\".\n\nUnsatisfied - that is just about the perfect way to describe our experience.\n\nBlargh!",
    "date": "2016-08-08 11:50:05"
  },
  {
    "review_id": "iihRifj5MYwPxikyBLglEg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "IkY2ticzHEn4QFn8hQLSWg",
    "stars": 2.0,
    "useful": 11,
    "funny": 7,
    "cool": 8,
    "text": "I'd skip Geno's and walk around the corner to Pat's - or better yet - go to Jim's.\nOr Tony Luke's.\nOr Pastificio's for the real deal.\n\nLet me just add that I am NOT a cheessteak eater - I get a Chicken Cheesesteak 'wit Provolone and 'shrooms once or twice a year.\n\nGeno's is filthy and to quote below - the owner is a racially prejudiced \"ass clown\".",
    "date": "2008-08-21 18:34:02"
  },
  {
    "review_id": "24bl9OQY7dnYodoyfrYQOA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "lH_UKAJy6YTa1ArfdACU4g",
    "stars": 2.0,
    "useful": 5,
    "funny": 2,
    "cool": 1,
    "text": "Olive Garden is Faux-talian-American and is really not that great.\nMy inlaws insist on going to chain restaurants like this, Buca di Beppo, Romano's Macaroni' Grill (how the heck do you grill Macaroni??) and other sub-par poser-Talian chains.\n\nMeanwhile, my 3 year old loves it here - so there's no accounting for taste.\nAnd it used to be cheap - but no longer.  I had a so-so shrimp scampi (angel hair here is a definite AVOID - ads it is always overcooked and mushy.) and it was $16.95.\n\nThe unlimited iceberg & white-bread (Oh, sorry, I meant salad & grease-sticks) are a big turn on to college kids and cheap in-laws alike.\n\nFor my time & money - there are FAR better places to go (even in the spectra of Faux-talian chains.) [See my review of Bensi's]",
    "date": "2008-08-12 15:19:47"
  },
  {
    "review_id": "SxlnlENM7yPlYlB1gulHEA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "AEhfYqXSFx1EtqI8ajabXg",
    "stars": 2.0,
    "useful": 2,
    "funny": 4,
    "cool": 6,
    "text": "No.\nJust No.\n\nCame here for Dining Under the Stars because we knew they'd have a table (and here's why).\nFood is Meh and service is confused and chaotic.\n\nForgot to write down our order on a check thus we never got a check and had to TELL them what we got.  Then it took a while to actually pay.\n\nMeanwhile people are waiting for our (now coveted outdoor) table.\n\nPad Thai (Chicken) was good - yes, it was.\nTom Kha was average.\n\nBathroom is gross.\n\nThey need to step up their game or they won;t be around many more years.",
    "date": "2015-06-11 02:07:21"
  },
  {
    "review_id": "kgxBFwwJdHC93TQ9s9REbQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "GhLCh9fL9Nc8c33eHszX5A",
    "stars": 2.0,
    "useful": 5,
    "funny": 3,
    "cool": 4,
    "text": "I am not and have never been a 7-11 person, however, I was desperate. Stopped in on a Saturday morning before 9 AM and the place was empty.  Bought a few low carb snack items, paid the friendly (owner? Manager?) cashier and left.\n\nNo issues.",
    "date": "2019-09-14 17:14:41"
  },
  {
    "review_id": "XtjVjGpM6xy9iMorUpmGQg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "w7kKNELhnc00MwPOQhaZpQ",
    "stars": 2.0,
    "useful": 11,
    "funny": 2,
    "cool": 3,
    "text": "Just OK - I had a salad bowl and the cucumber salad and baba ghanouj were fine - the rest (hummus, limp romaine, dry chicken and tough-mediocre \"steak\") was edible but blah.\n\nDo not get the steak.  Not at all juicy.\n\nI love this type of food and have tried 2 other local mini chains Naya and Cava and they were both better than Naf Naf.\n\nI wanted to love it but it is just Meh.\n\nThat said they staff greeted me upon entrance (I came in early before the long-ass line)  and the cashier was very friendly and polite.\n\nMight try it again but might now.",
    "date": "2020-01-23 18:27:20"
  },
  {
    "review_id": "s7ZZxsyG8bwHC3aLF5wUFw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "mE4D25vY8SNxpNOZZtEauA",
    "stars": 2.0,
    "useful": 5,
    "funny": 1,
    "cool": 2,
    "text": "I have come here a few times and on 2 occasion now they have gotten my drink order wrong.\nBoth times they fixed it right away though.\n\nOne time they gave me regular when I asked for decaf and I could feel it right away - wow.  What a jolt!\n\nThe 'Bux in Paoli is way better.",
    "date": "2016-07-08 13:19:07"
  },
  {
    "review_id": "XBoEFE6WOhu3eQ1CMlXDdw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "EFci0tbSrb7wko6tpVDnbA",
    "stars": 2.0,
    "useful": 1,
    "funny": 2,
    "cool": 1,
    "text": "Affectionately known as Charbucks or Fourbucks - we have adopted the slogan of:\n\n\"Friends don't let friends drink starbucks.\"\n\nSave money by brewing at home with Peregrine Coffee (the BEST) or go to La Colombe or Caffeination.",
    "date": "2009-03-03 19:50:50"
  },
  {
    "review_id": "U-agBiRtrwl30U5DEtsuKQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "6ZNKHkXETW26YFMtvWtPrg",
    "stars": 2.0,
    "useful": 0,
    "funny": 1,
    "cool": 0,
    "text": "I loathe fast food - so when my fast-food eating spouse (and newly indoctrinated child) demand frosties - we stopped here.\n\nMy bad.\n\nMeanwhile, the food was (the usual unhealthy) edible.\nThis place is very \"old school\" in decor and could use a makeover.\n\nDo not try the \"new\" homestyle mac 'n cheese - swimming in velveeta-like goo.\nYUCK.\n\nSalad greens were not so fresh.\n\nHamberger was fine (the same ole, same ole).\nOh - and I asked said 7-year-old if the chicken sandwich was better here or at Chik-Fil-A she empatically declared Chik-Fil-A the winner.  But she loves those darned frosties.\n\nFor less than $15 for 3 people to eat?  CHEAP.\nBut - you get what you pay for.  I never recommend eating fast food.\nUGGH!",
    "date": "2012-07-16 13:13:13"
  },
  {
    "review_id": "ZVrNphvotWNeQMccJ46Kug",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "bIDyzk1VBkpofSORapAiew",
    "stars": 2.0,
    "useful": 3,
    "funny": 0,
    "cool": 2,
    "text": "This food court used to be much better.  It now has a saladworks, a chinese place, and Italian place, a cheap mexican place and is only open for lunch.\n\nSuper crowded.\n\nI am not a fan.",
    "date": "2009-01-02 14:43:51"
  },
  {
    "review_id": "AhmDbnUPSs7bXjmSz7EOXw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "z-2pRvQXAWqcZdLW2fKj9g",
    "stars": 2.0,
    "useful": 14,
    "funny": 2,
    "cool": 6,
    "text": "This is a review for the Deerhead Hot Dogs food truck.\nThe 2 guys working the truck were very pleasant, but FRANKly (pun in tended) they just could not handle our corporate lunch crowd.\n\nI waited 25 minutes for my $7 lobster dog.\nThe lobster was fine but the cheese sauce was awful and the dog itself had been split and grilled - try BURNT to a blackened crisp.\n\nI basically ate some lobster chunks and a tablespoon of greasy cheese-whiz-like sauce for lunch.\n\nBetter luck next time.\nNext time, go to the store - not the truck.",
    "date": "2018-05-16 17:51:48"
  },
  {
    "review_id": "_KtnHxRxa-s6dj4_8PJdvA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "XokXeGm3Jy-ksFlD7fAjCA",
    "stars": 2.0,
    "useful": 0,
    "funny": 1,
    "cool": 1,
    "text": "2-3 stars.\n\nWhat in G-d's name possessed me?\nI was hungry.  It was 9:30 PM on a Thursday night.\nWhere else could I go?\n\nI sat at the bar and had inattentive service from the 22 year old over-worked, stressed out bartender.\n\nI plowed my way through a very heavy cheese burger quesadilla.  (I felt righteous by not eating the fries.)  I left.\n\nNot coming back unless someone else drags me here.\n\nBlargh!",
    "date": "2014-03-28 02:52:38"
  },
  {
    "review_id": "rmQKa6K0KwcPvq1TPwMyxw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "XokXeGm3Jy-ksFlD7fAjCA",
    "stars": 2.0,
    "useful": 1,
    "funny": 3,
    "cool": 0,
    "text": "Crapplebee's.\nMy 9 year old loves it here - and thus, we sometimes go.\nOddly enough her 9 year old BFF's fam loves it here, too - so again - we are dragged here.\n\nThe service is actually pretty good if you come at an off- peak time (Crystal is a lovely server).  The food though?  Ech!\n\nThe kiddo & I shared a Two for $20 deal and I added $1 extra to get the 7 oz (tiny) steak.  I asked for it rare and it had absolutely no flavor other than salt.  The steamed white rice and brocolli were sitting in a pool of water on the plate.\n\nBlech!\n\nThe overly fried and greasy boneless wing app drenched in a sticky-sickly-sweet sauce was all I ate and that was bad enough.\n\nLord help us!\nThere are so many better places to eat.  I only come here under duress.",
    "date": "2014-06-23 14:00:07"
  },
  {
    "review_id": "eIDueUZr5fvRRNriwubbpw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "MfKScMsPZfE66VQ1CsbS0A",
    "stars": 2.0,
    "useful": 6,
    "funny": 5,
    "cool": 5,
    "text": "I only eat at Chili's when my friend (who loves it - why, I will never know) drags me here.  So last night we dines here - my first time to this location in 8 years.  We got the 2 for $25 - shared an app of onion petals, I had baby back ribs and she got chicken fajitas.\n\nDessert she took home - we were too full to eat it.\n\nThe best part?  Dinner for 2 with tax, tip and 2 soft drinks was $40.40.\nThe worst part?  That food is so salty - it's like a sodium bomb.\n\nKudos to our server Mahnyah who was working her tail off - she was so friendly and great - unlike the aloof and disinterested hostesses.\n\nThe service here in general needs an upgrade.\n\nAvoid if possible and take your blood pressure meds.\nChili's is not for me!",
    "date": "2020-02-04 13:00:38"
  },
  {
    "review_id": "oWkijTiIhG8KDiCx9Hxf1g",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "YfGVsl-8YUcTmtNI0jQfhQ",
    "stars": 2.0,
    "useful": 5,
    "funny": 0,
    "cool": 1,
    "text": "I am fairly certain this is the correct location of Papa John's that we order from.  My 6 year old loves the plain pizza here and pepperoni.\nI find it to be cardboard-like with plasticky cheese.  And a weird garlic margarine comes with it.  Eeeew.\n\nShe hates the sausage and finds it \"too spicy\".\n\nMeanhwile I am unimpressed - I ate a salad.\nThankful they deliver, though.",
    "date": "2011-07-04 19:09:18"
  },
  {
    "review_id": "tl_Z-7I5dqpwAiGDJ1zJ_g",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "p0Sl_o64n-2l2pxiG489AA",
    "stars": 2.0,
    "useful": 8,
    "funny": 1,
    "cool": 1,
    "text": "So awful it makes the Warrington Chuck E. Cheese's look like paradise.\nWe had our DD's 4th birthday party here about 2 years ago, and came back here on July 2, 2011 during the July 4th weekend madness.\n\nAfter trying unsuccesfully to use the broken credit card machine to pay for $10 worth of tokens (There was a long line for tickets and tokens)  I succumbed and boought them at the counter.\n\nIt was DEAFENING in there and 3 of the machines DD tried to play were broken.  The manager was summoned and agreed to give us a refund.\n\nNot happy!\n\nFortunately my kid will grow out of this phase of life very soon.\n\nAVOID on holiday weekends!\n\nGiggleberry staff:  FIX YOUR MACHINES!!!!",
    "date": "2011-07-04 19:06:21"
  },
  {
    "review_id": "QDXBj7mi6zBS8f1GgpMCiA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "AG8L1ytgr6t_QNquAVhKRw",
    "stars": 2.0,
    "useful": 0,
    "funny": 1,
    "cool": 3,
    "text": "Holy smokes, it's hot as blazes in here!\nAll those freezer cases in a tiny cramped (dirty) space.\n\nService is slow as molasses - but they are trying.\nFor Dining under the Stars - they had ONE person in addition to the kind but over-worked owner.\n\nCash only.\n\nMeanhwhile my year old ADORES this place.",
    "date": "2015-06-11 02:11:09"
  },
  {
    "review_id": "Ytkrn1XKbyADTpWtSCyq_w",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "ZzCcljlsQco6WsRDGaV8mQ",
    "stars": 2.0,
    "useful": 3,
    "funny": 1,
    "cool": 0,
    "text": "I have definitely had better - this place is a mix of Halal, Fried CHicken, Pizza and Indian dishes and seems to get none of them quite right.  Very cheap - $6 for lamb platter over rice - but lamb was dry and stringy.\n\nI may try again - but not rushing back,",
    "date": "2016-02-08 17:57:36"
  },
  {
    "review_id": "pHc2nR99SWlIj-ad3nqxUg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "R-OvuW9vK3_hPJTN9WetDA",
    "stars": 2.0,
    "useful": 3,
    "funny": 0,
    "cool": 0,
    "text": "I do not like this chain at all!\nThis one is marginally better than the hellish one in Doylestown.\n\nThe Gyro is a joke.\nThe tortilla I had was cold.\n\nNot good.\nChipotle and Qdoba are better for \"fast food Mex\".\n\nUck!\n\nCool things:  Cheap prices, wall of hot sauces and \"mix your own\" soda flavors.\n\nOtherwise - I'll pass.",
    "date": "2012-01-20 20:00:44"
  },
  {
    "review_id": "B3sJc-fSm6xjhowNEhvWSQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "q3Bm2CHAVRBFw8Pqji2zQA",
    "stars": 2.0,
    "useful": 5,
    "funny": 1,
    "cool": 0,
    "text": "Very Upset.\nSince my initial review - which was terrific - we have been here several times.  Each time the food quality was a bit worse - maybe 3 stars.\n\nBut this last time - now I am so angry,\nI cam in at about 4:15 PM and was hungry so I got 2 garlic knots to go for my kid and asked the (albeit young and feisty, but apparently clueless) counter gal how much a side order of the chicken tortellini would be.  She said $2.99 and I said \"fine\".\n\nGot to the cashier (same manager guy as before) and he rings up my order at nearly $7 - and I'm like \"What??\".  He says it's $4.99 for the chicken tortellini.  I reluctantly agree and pay for it.\nI sit down and start to eat it and it tastes slightly sour.  Then more sour.  I threw half of it away and walked out.\n\nI will not return unless my kid demands it.\n\nI bet that had been sitting out since lunchtime - and shame on me for ordering it.\n\nNOT COOL, Bravo Pizza.  Not cool at all!",
    "date": "2015-09-22 13:39:09"
  },
  {
    "review_id": "dDBJaQRCCPBT2THvHk_02g",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "vkFyV7uIbd_VzbWS793lsw",
    "stars": 2.0,
    "useful": 0,
    "funny": 0,
    "cool": 0,
    "text": "TCT. (TCCT)\nTypical Chinese (cheap) Takeout.\n\ngreasy, fast, inexpensive - especially for lunch specials - I had Tofu w/ Mix. Veg. - light on the sauce which was a smart move.\n\n2 Spring rolls (grease fest) for $1.85.\n\nDesparate times called for quick lunch.\nThis place looks like it has been here for years - and could use a new menu board (pictures are ancient) and a good cleaning.\n\nTake out only - or eat on one of the 2 greasy tables..",
    "date": "2014-03-11 16:41:46"
  },
  {
    "review_id": "d056CiabZciNxH0wZyfsZw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "w9GGB7vFK6jgReDykEwhqQ",
    "stars": 2.0,
    "useful": 11,
    "funny": 5,
    "cool": 6,
    "text": "Mediocre food and truly awful management.\nThere was a private event upstairs and we were told TWICE that all ages were welcomed - but it is a BAR and 21 and under are not allowed upstairs.\n\nWe wound up dining in a booth downstairs and our server Cindy was the best part of the night - she was terrific, but the manager?  Just awful.\nSo rude.\n\nIn the mean time the $8 chicken fingers and $5 side salad were fine.\nNothing to write home about,",
    "date": "2018-10-31 18:02:25"
  },
  {
    "review_id": "UG20jg03hVuMH1c2Qg8Slw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "HP8kVUCXWR7m5S8GXSKh7g",
    "stars": 2.0,
    "useful": 7,
    "funny": 3,
    "cool": 4,
    "text": "Nope.  Tried again as my 13 year old loves it here and loves Poke and Sashimi in general.\n\nFish is just not fresh enough and the $8.95 \"regular\" sized bowl has so little fish anyway.  She got salmon and added avocado ($1 extra).\nThe greens are not my favorite - I like romaine over spring mix, but most people disagree.\n\nAnyhow, I will not return for me but if kiddo wants it, I will get it.\n\nUnsatisfied.\n\nAlso - it was so LOUD in there I could barely hear myself think.\n\nGet takeout.",
    "date": "2018-09-17 13:14:15"
  },
  {
    "review_id": "d-03DkwdPtc0CkFdQIAyhQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "JcVEMcSdNJA-qJClXqsTqA",
    "stars": 2.0,
    "useful": 2,
    "funny": 2,
    "cool": 1,
    "text": "Incredibly mediocre.\nI have never been an Uno fan - but recent visits (dragged there by my chain-loving in-laws) were surprisingly good, at the Warrington, PA location.\n\nToday's early lunch with a co-worker was a last minute decisions and the place was nearly empty when we arrived at 11:40 AM.  Even still service was painfully slow.\n\nWe both ordered off the \"super fast\" (10 minutes or less) lunch menu and both ordered nearly the same thing - salads with 2 sliders. After about 13 minutes we got fidgety, and finally EVERYTHING came out at once.\n\nSalad was on rusty lettuce (I opted for the Garden Salad as I feared the Caesar would be only romaine and croutons) with ONE tomato wedge and ONE Slice of cucumber.  Oy.\n\nSliders were OK but VERY salty (due to the cheddar cheese).\n\nWould NOT order this $7.99 deal ever again.\nServer admitted to us she was exhausted from the night before.\n\nSorry, UNO, today's lunch was a fail.",
    "date": "2015-07-27 17:07:06"
  },
  {
    "review_id": "XEgL_6tTXPIKPG5s5A5qsw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "gdyMIBAitsQubj0OEJoiMg",
    "stars": 2.0,
    "useful": 2,
    "funny": 2,
    "cool": 2,
    "text": "Totally average.  Not clean, not dirty.\nNot good, not bad.\nNot tasty, not yucky.\n\nJust \nPlain\nMEH.",
    "date": "2008-10-01 18:26:15"
  },
  {
    "review_id": "Pxvs0SxdBMU1Ma20SrJ3Dg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "WxB8498ejPtHE7wFa89_fA",
    "stars": 2.0,
    "useful": 9,
    "funny": 9,
    "cool": 8,
    "text": "Was dragged here by a rich coworker who \"just loves\" it here. Blargh. My $14 salad was just ok at best and they have no creamy dressings, only 1001 vinaigrettes. Yes, they are house made, but I wanted a non vinaigrette.\n\nThe lettuce mix was very cabbage-heavy. \n\nMy lunch turned out to be $22 including tax and tip and it was unsatisfactory and unsatisfying. \n\nSo upset.",
    "date": "2019-11-21 22:07:47"
  },
  {
    "review_id": "gYZzZlYJZPcLs5OkuWCBBw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "b-tkLHoLjOxFBBewAOhn4Q",
    "stars": 2.0,
    "useful": 1,
    "funny": 3,
    "cool": 1,
    "text": "A total dive - with decent (mediocre) greassy, fairly thick-crusted, Neapolitan-style pie.\nIt was one of the FIRST original pizza joints from \"back in the day\",\n\nBelieve me - back then they were awesome - simply because the choices were so very limited.\n\nSo anyhow, I am glad they are still in business - but somehow I can't believe that they are.\n\nA MAKEOVER is needed. Stat.",
    "date": "2010-09-09 18:01:54"
  },
  {
    "review_id": "JHe2_duj8czXmjby6fsj0A",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "BIxkykL8meGkcNszRNWSyA",
    "stars": 2.0,
    "useful": 8,
    "funny": 3,
    "cool": 4,
    "text": "I was thrilled to see my local Giant (in Aston, PA) carried Talluto's frozen beef ravioli and I caved and bought a dozen (1 box) for $7.99.\n\nThey were so salty (570 mg of sodium per 4 rav serving) the filling was nearly inedible.  I ate the pasta (tender yet firm and so good) but de-filled them.\n\nSad.",
    "date": "2020-06-30 18:36:00"
  },
  {
    "review_id": "gJLddvvWzyyx62RFaBF9gQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "qd0boC38gSOci6LRS67akw",
    "stars": 2.0,
    "useful": 6,
    "funny": 2,
    "cool": 3,
    "text": "Ate here out of desparation and a lack of knowledge.\nMediocre at best.  Overly salt and fat laden garbage.\nHey, it's inexpensive and very filling - and many people love it here - but I just don't.\n\nNope.\n\nNever again.",
    "date": "2017-05-25 16:33:49"
  },
  {
    "review_id": "-WgxxETc9fKMwJX7Y7UQmw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "WxB8498ejPtHE7wFa89_fA",
    "stars": 2.0,
    "useful": 2,
    "funny": 1,
    "cool": 0,
    "text": "Very disappointed in the flavorless, dry black quinoa salad that set me back $10 for lunch.  Also had an OK $3.00 Arnold Palmer.  The quinoa salad at Pure Fare (and even the frozen Quinoa Bowls I get at Whole Foods) are far superior and cheaper.\n\nNot a fan of this place any more.\nOver-priced and not that good.\n\nI should have stuck with the green submarine (glad it's still on the menu).\nSkip this place and go elsewhere for a better lunch for less money.",
    "date": "2013-03-04 13:07:09"
  },
  {
    "review_id": "BrfgWIIcSJA4MgGnlxORLA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "4GdE_b0FQdjEyZQQuiEyPw",
    "stars": 2.0,
    "useful": 6,
    "funny": 1,
    "cool": 3,
    "text": "I'm sorry but I hate shopping at this Acme, and Acme in general.\nThis branch is near the old Granite Run Mall - now a construction site for a new shopping center.\n\nWhile I am happy to see that Acme employs disabled people, the check out lines are painfully, painfully slow.  Freindly, but slow.\n\nSelection is average.\nCleanliness just average.\n\nNot my go to.",
    "date": "2017-12-14 14:50:01"
  },
  {
    "review_id": "ULWgyFEFDTapXy4mYZVBzQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "5e6Kf-t6_6CxhZrtTDy-7A",
    "stars": 2.0,
    "useful": 10,
    "funny": 4,
    "cool": 1,
    "text": "Horrible service, filthy bathrooms, mediocre food and just not worth it in any way.\n\nPerhaps I should give them 1 star but the side order of brussels sprouts was good.\n\nThat ladies room was so nasty - they floors were awful and 2 toilets were clogged.\n\nYick.\n\nI have lost my appetitie.",
    "date": "2020-01-03 13:14:57"
  },
  {
    "review_id": "N1Ip53Uk2ce9XuhAESu0KA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "4GdE_b0FQdjEyZQQuiEyPw",
    "stars": 2.0,
    "useful": 12,
    "funny": 5,
    "cool": 6,
    "text": "It's still bad.  Service is so slow. Prices are better at Giant.\nBetter meats at Acme though - but the produce is pricey and \"meh\".\n\nI shop at Giant in Aston, Trader Joe's, Whole Paycheck and Gentile's for Produce.\n\nAcme is a last resort and everytime I shop here it's out of desparation (Acme is the closest grocery store to my house.)\n\nThat said, when my kid was little they let her girl scout troop sell cookies here and Giant wouldn't.\n\nThey employ great people with diabilities but my inner-Manhattanite can't handle the slow, slow pace.\n\nNot a fan of Acme.",
    "date": "2021-08-04 13:31:15"
  },
  {
    "review_id": "ba6c_ov5EnShFE3fYXdHaA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "qGrjQ-c1uBfkAzS3YJVoNA",
    "stars": 2.0,
    "useful": 0,
    "funny": 1,
    "cool": 1,
    "text": "I strongly disagree with Veruca - this is \"Mall Chinese\" and just OK.\nMy 9 year old loves the orange chicken and teriyaki (sweet) chicken so if we are in the Mall and she is hungry I will indulge her.\n\nI don't eat here.\n\nIck.\n\nThe good part?  The lady behind the counter is very kind.",
    "date": "2013-09-04 21:18:24"
  },
  {
    "review_id": "v0h6JyFTMJFZUKnwdbqztg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "peeXG1Ra-DClPQv14jvKvg",
    "stars": 2.0,
    "useful": 3,
    "funny": 0,
    "cool": 0,
    "text": "Finally used my eversave (valid only during dinner - and I sure know why!)\n\nService was just awful - very cold female server worked her butt off - while other guy stood there (not wonder she's so angry).\n\nThe food was good.  \"Happy Hour\" small plates are $5 - I tried the \"Fried Shrimp Joe\" which was kinda like shrimp-toast filling deep-fried and cut into chunks.  Tasty - but so greasy - will not get that again.\n\nSliced beef with eggplant (and I added brocolli - no charge) for $16.50 was a HUGE portion (Took about 1/2 home) and the beef was tender and delicious.\n\nGreat food - but this place is a LUNCH SPOT - and is truly cursed at dinner (dine-in).\nDim lighting, borderline mean servers and just not fun.\n\nWon;t be back so soon.\nMeanwhile - for takeout I love the hot and sour soup here.\nAgain - they have GREAT food.\nIt's a shame my dinner \"dine-in\" was so MEH.",
    "date": "2012-05-17 20:21:47"
  },
  {
    "review_id": "m16IU4Ufs2kzG0HQGMVxtA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "qGrjQ-c1uBfkAzS3YJVoNA",
    "stars": 2.0,
    "useful": 1,
    "funny": 1,
    "cool": 0,
    "text": "The food here is just awful.\n\nMy (now) 11 year old, however loves the $2.99 bubble tea - and until we can find another place to get bubble tea (she is partial to honeydew) we get it here.\n\nThe young lads running the front counter are always kind to us.\nWish the food were better. I do not and will not eat here.",
    "date": "2016-08-22 15:00:14"
  },
  {
    "review_id": "ekEqTy8UZgMEe_0lVEqTPQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "0RcD7PpjWTMcN86NwzgBag",
    "stars": 2.0,
    "useful": 3,
    "funny": 0,
    "cool": 0,
    "text": "Not a great Shoprite - but a little better than the one near the Target.\nNO customer service at all - and lines were pretty long on the (Saturday - duh) day we were there.\n\nWe go to the (also yucky) SuperFresh on Columbus for our bi-monthly shopping trips and supplement with Farmer's Market Fruit & Veggies (in spring/summer) and Whole Foods or Trader Joe's for other things.\n\nOh - and Target.  We're there a few times a month also.\n\nPro:  This shoprite has a BIG parking lot and we found a space easily - even though the store was busy and lines were long.  (Hey - open an extre couple of registers on the weekends, OK?)",
    "date": "2010-07-30 18:10:18"
  },
  {
    "review_id": "Ytdtx9hMvanIxZatwdPVlg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "4UVsJ0CX20rmeC6CfC0reA",
    "stars": 2.0,
    "useful": 2,
    "funny": 3,
    "cool": 1,
    "text": "Yuck.  I don't really like fast food anyway - and Wendy's is barely tolerable, but this location (a busy one due to location for sure) is pretty awful.\n\nNot a good choice.",
    "date": "2011-01-01 15:30:19"
  },
  {
    "review_id": "neYLsKt1k9f4ovs0Hn2-uQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "m408YCnvuIywzZkJX3K9KQ",
    "stars": 2.0,
    "useful": 2,
    "funny": 0,
    "cool": 0,
    "text": "You're kidding right?  This Au Bon Pain should probably get 1 star due to the vermin infestation.  But anyway - the over priced, high calorie sandwiches & soups are a godsend when it is raining and I am too lazy to leave my office building, but other than that?\n\nI am so over au bon pain.",
    "date": "2008-10-14 12:04:12"
  },
  {
    "review_id": "exYZlui-wUvYy_mHxRqalg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "EX-ioSwVMafEBVt-xIzcxA",
    "stars": 2.0,
    "useful": 12,
    "funny": 3,
    "cool": 4,
    "text": "I am ever-so disappointed with Gennaro's - and just went there again for the first time in years as it never is good.\n\nWell, I was right - my cappucino came out with curdled milk.  Ick.\nFortunately the very kind server, Wendy, brought me another one and took it off the bill.\n\nMy close friend eats here ALL the time and loves it, but I just don;t get it.\nIt's never \"quite right\" for me here.\n\nFriendly service, old-school digs (they need new carpeting) and a menu to match.\n\nPeople/Locals love it.  Maybe New Yawk has spoiled me for Delco-Italian.",
    "date": "2020-01-27 15:34:48"
  },
  {
    "review_id": "Y0kpXgG-hvEQ_tFGzZ-rCQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "3sMGEl72eiDbble1RO34ng",
    "stars": 2.0,
    "useful": 8,
    "funny": 1,
    "cool": 1,
    "text": "This starbucks is deceptive.\nFirst of all, parking is horrendous - there's just not enough of it.\nSecondly there is hardly any seating - a few bar stools and a few tiny tables for 2.\nThirdly, the retail area - used also to barricade off the drink line area - is too bulky and wide.\n\nThis location is deceptive in size - it looks like a big store from the outside but is cramped and crowded inside.\n\nMeanwhile the usual Fourbucks menu items prevail.\nService was fine.\n\nIt's just too small.",
    "date": "2012-12-12 11:54:21"
  },
  {
    "review_id": "GDFjWtoh7qm-G8cGWQvrsA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "D99kvKSnsCtD07mExtN_Pg",
    "stars": 2.0,
    "useful": 1,
    "funny": 2,
    "cool": 0,
    "text": "I am not an Applebee's fan.  I have been to this one twice though - once I was dragged here by my inlaws - who LOVE chain restaurants.  (I guess they make them feel \"safe\"),\n\nThe food was marginal and the service was, of course, by disinterested teenagers.\n\nNot my idea of a good time.",
    "date": "2008-08-25 12:48:25"
  },
  {
    "review_id": "Raft48QPxJFmAknX4jBD8Q",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "dr_nIjj7A0PYfaN6qS2yng",
    "stars": 2.0,
    "useful": 0,
    "funny": 4,
    "cool": 0,
    "text": "It's been here for eh ver.\nNot much good I can say about McDonald's.\n\nClearly I'm NOT lovin' it.",
    "date": "2014-01-21 16:28:18"
  },
  {
    "review_id": "gnRNYN6MyrkeRgXWxup3PQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "N_dameoyJSMcm7RVwGeZ7w",
    "stars": 2.0,
    "useful": 0,
    "funny": 0,
    "cool": 1,
    "text": "I loathe Domino's so 2 stars is pretty darned generous coming from me.\nThe only reason we got pizza here is because my frugal father in law had a coupon (He normally gets Papa John's - which is still mediocre at best).\n\nThis is a teeny-tiny take-out only \"kiosk\" - small store.\nNot for eating in!\n\nYick.",
    "date": "2014-02-11 15:53:38"
  },
  {
    "review_id": "rjgyloPM4-wj9D_g5gKKkA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "2RvssRTzvbP5TcxUoYoi_w",
    "stars": 2.0,
    "useful": 1,
    "funny": 1,
    "cool": 1,
    "text": "Nope.  Not very good Sorry - even though it's been around for-eh-ver, the food is just OK.  (Italian \"red sauce\" fare) and the place needs an overhaul.  I guess what makes it so awful for me is that a spider spun her web down onto my plate while I was eating there.  There was dust and cobwebs in the windowsill and that spider just clinched it for me.\n\nI couldn't even finish my baked ziti.\n\nWon't return.",
    "date": "2008-10-30 19:52:33"
  },
  {
    "review_id": "8Fv_TwaQMDLfxPBGirwHHA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "o6B17dkfUtZTfKabD9uYTQ",
    "stars": 2.0,
    "useful": 1,
    "funny": 0,
    "cool": 0,
    "text": "A tiny, tiny grocery store - but it's got what you need - maybe not at the greatest prices - and for a long while it was all Dublin really had.\n\nBrain-dead clerks & cashiers - but they will smile back if you smile first.\n\nIt's a grocery store - and I am glad it's here - but it sure could use an overhaul both physically (clean up the aisles and floors) and customer-service-wise.\n\nThe older lady at the deli counter was really nice, though - 4 stars for her.  Darned if I can't remeber her name, though. She sliced up some turkey breast for me and 3 slices of liverwurst for my sweet little pug.",
    "date": "2010-09-17 14:03:29"
  },
  {
    "review_id": "Va4gXByOml9ZY3Q_J8RrPg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "V9pSmHb0c-9SSqx5GJbYPg",
    "stars": 2.0,
    "useful": 6,
    "funny": 5,
    "cool": 1,
    "text": "So very disappointed and actually...\nSAD.\n\nYes, I left Ooka tonight feeling sad.\n\nSad - for the fact that we had food (entrees) so bad that we had to send it back.\nSad - to see my favorite D-town sushi spot be anything other than the wonderful we usually expect.\nSad - to have had to defend my right to consume undercooked meat or seafood products.\n\nJust sad.\n\nDo not order duck breast here.  I did - and asked for medium rare - and that duck had the quack cooked right out of it.\n\nAs usual the seared striped bass with foie gras was excellent.\n\nEverything else?  MEH,\n\nSo sad to have to give out 2 Meh stars to Ooka.\n\nWe pray that when and If we give them another chance that they will redeem themselves.\n\nSad\nSad\nSad.",
    "date": "2013-07-06 22:54:14"
  },
  {
    "review_id": "cE2bFpiu50Ok6GW0Cj1Ktg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "mLhVT1B9NtxiDR9ZPfgL1Q",
    "stars": 2.0,
    "useful": 6,
    "funny": 3,
    "cool": 2,
    "text": "i am not a big Macy's shopper - but even for a Macy's this one is lame.\nI used to shop at the Wanamaker/Macy's (in Center City) and if there were sales you could get some decent clothing, shoes and kids clothing.\n\nHere in Springfield?  Not so much.\nIt's hit or miss and I usually miss.\nThe Calvin Klein dress I wanted was full retail at $134.99 - and I got a very similar one at Century 21 (in Philly) for $69.99 - so, I am not too keen on Macy's these days.\n\nFor kids clothes?  Entirely too pricey.",
    "date": "2016-08-22 15:28:17"
  },
  {
    "review_id": "IospqbVXvLVbTtKQRYN2iw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "D99kvKSnsCtD07mExtN_Pg",
    "stars": 2.0,
    "useful": 2,
    "funny": 2,
    "cool": 0,
    "text": "I was dragged here yet again, and the food and service were decidedly sucky.  (Sorry \"Amanda\" - sweet yet clueless high-school aged server).\n\nMistake 1.  (Our bad) Come on a Saturday night at 6:30\nMistake 2.  Patiently wait for table with5 year old\nMistake 3. Ask for \"a few minutes\" when said server asks \"Ready to order?\"\n\nMy kid nearly had a melt down while waiting for her $3.99 Kraft Mac 'n Cheese and my $9.99 burger - asked for medium- was charred and tasteless.\n\nYick.\n\nHope my inlaws enjoyed the teeny tiny overly salted steaks.\nIf it were not for their generosity, I would never, ever come here.  (They paid, they picked. And, yes, I am grateful to them - but please - there are so many better places to go.)",
    "date": "2010-01-26 20:37:27"
  },
  {
    "review_id": "kvfqfbAL75ii6Kb7lsLSSQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "XC30E7D4gfIrLmh4d4prSw",
    "stars": 2.0,
    "useful": 14,
    "funny": 4,
    "cool": 7,
    "text": "No Bueno.\nMy father's crab cake platter (which sounded great on the menu - served with a mushroom risotto and asparagus) was nearly all filler.\n\nYes, this is a diner - but he was sorely disappointed.\n\nWon't be back.",
    "date": "2021-07-28 14:10:52"
  },
  {
    "review_id": "XI75q5vcvqQUxJ27VqFohA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "oGl-gsxNk0z15ucwlB3RcA",
    "stars": 2.0,
    "useful": 1,
    "funny": 0,
    "cool": 2,
    "text": "Just OK today.  I had not been here in quite some time and while the hot foods/cooked foods seem to have expanded the sushi was just not fresh.  I ordered a side order of (\"new\") grilled tofu - at $4.50 which was tasty and safe to eat.\n\nThe $10.95 (pricey) Valentine roll had very questional salmon inside.  So questionable that I still don;t know if it was supposed to be raw fresh salmon, smoked salmon or just old, nasty salmon.\n\nVery disappointed - and I spent over $16 on a carry out lunch.\nI will not be back in a hurry, if ever.",
    "date": "2013-01-04 18:39:48"
  },
  {
    "review_id": "Y07Fqnc2Js3Xo4kyInCJQA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "pWzrmh1oiU9ngWXGHKnnwQ",
    "stars": 2.0,
    "useful": 6,
    "funny": 1,
    "cool": 1,
    "text": "Walked in, walked out.\nCrowded, poor service, mediocre food.\n\nBut it is convenient when you just NEED to sit down in RTM.\n\nAsked for water several times.\nTripped over strollers.\n\nNot a fun experience at all. (Which is a shame because I LOVE Jack McDavid - not sure if he still has a hand in this biz,)",
    "date": "2009-01-29 14:53:41"
  },
  {
    "review_id": "rSBJcEXsTO3_yFFdX4A_FQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "NnXtMdEJ4QRgaw7hTgbkgg",
    "stars": 2.0,
    "useful": 10,
    "funny": 3,
    "cool": 2,
    "text": "Worse and worse every time we come.\nThe firt time we had a great 4 star experience.  This last time?  Not so much.\n\nAnd do NOT get take out here.  No beverages to go (other than sugar-laden Mexican Sodas).  No Diet Coke.  No take out cups.  Bottled water (IF they have it) is $2.25 per bottle.\n\nPlus they got my order wrong - and I called 45 minutes before I needed it.\n\nThey are clearly not well equipped for take out.",
    "date": "2016-08-25 11:03:17"
  },
  {
    "review_id": "99ONvdm4BiyY-ZI9rPlsyg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "8JcdN89xv4AqAVRSDLLUHw",
    "stars": 2.0,
    "useful": 4,
    "funny": 0,
    "cool": 1,
    "text": "2 to 2.5 stars at best.\n\nWhat a disappointment.\nA close friend and I had been planning dinner here for over 2 months.\nWe finally got to go and the food just isn't up to par (or the high prices - $22 - $45 for entrees!).\n\nWe started our meal with delicious fresh bread and garlic-infused oil.  (That and the after-dinner coffee were the best bites of the night!)\n\nI love a good caprese salad and was thrilled when \"Fresh tomato and buffalo mozz\" was a featured special ($12).  My friend and I split it - and the tomatoes were HARD - deli-quality slicing tomatoes.  This - in the middle of August when tomatoes are plentiful - is a sacrilege!  Also - who serves this over iceberg lettuce?  ICEBERG?  On a Caprese?\n\nBlah!!!\n\nOur server Leo tried to please us - but the entrees fell flat.\nMy entree was OK (albeit very over-salted) - al dente linguine with about a doze steamed littlenecks in a garlicky, salt-bath of oil.\n\nMy friends \"veal saute\" was a joke.  While the veal was tender, the sauce was a bland concoction of greasy-oily floury blandness.  It was supposed to be a \"light white wine sauce\" and no wine or flavor was detectable.\n\nWe skipped dessert and had 2 very nice cups of $3 coffee.\n\nI would not go back here.\n\"Founded in 1990\" - looks like they have not renovated since 2002.\n\nFAIL!\n\nSuch a shame.",
    "date": "2013-08-10 14:13:35"
  },
  {
    "review_id": "w6hQG2zOjYZ-b3r9c-vadA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "q3k9lwaHNqbtiGc-XeHnKg",
    "stars": 2.0,
    "useful": 2,
    "funny": 4,
    "cool": 0,
    "text": "Why on earth suburbanites PACK this place (with kids, also) is beyond me.\nWe came here when we were out of other ideas and the wait at Grand Rodeo was 45 minutes.\n\nWell, the wait here was 45 minutes also (even though we were told it'd be 20-25 minutes.)\n\nLiterally THRONGS of people.\n\nAvoid on a Saturday night at all cost.\nMediocrity served in enormous portions with a side of bovine growth hormone.\n\nI'll pass.\n\nBut I bet somebody will drag me back here.",
    "date": "2015-08-21 11:33:22"
  },
  {
    "review_id": "DRQSzlO07-Ri7WuYFYgaaQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "BkTFtgkkOva49Dj3MIPN0Q",
    "stars": 2.0,
    "useful": 0,
    "funny": 3,
    "cool": 0,
    "text": "Meh - 1.5 stars.  food was 2 and service was 1 or zero.  My husband asked them to cut our kid's slice into squares and they could not figure out how to do this.  Odd.  We cut it ourselves.\n\nI had a chicken cheese steak.\nIt was pretty awful.\n\nWe won't go again.",
    "date": "2012-01-08 23:48:52"
  },
  {
    "review_id": "IpRCOTQ8nYDfD-nMveq8Pw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "1AQhRXA6GhMp6FjpS4T8lQ",
    "stars": 2.0,
    "useful": 5,
    "funny": 4,
    "cool": 3,
    "text": "I'm sorry but the food here truly sucks.\nWe came as part of a large group party (I would never dine here of my own accord - I men, El Limon, Chiang Mai and Black Fish are all on the same street!) and they provided a cash bar (luckily sodas were free) and 5 hot appetizers in chafing dishes.\n\nThank g-d for the vegetable tray - it was fresh and fine.\n\nWings?  Mediocre - kinda dry.\nMozz. Sticks - cold\nScaliop pieces (or was in a shrimp, or a piece of cheap fish) wrapped in flabby bacon - ICKY.\nFried Gyoza/Potstickers - clearly frozen but at least edible.\nAnd one other item I forget - as I clearly did not eat it.\n\nNot a fan.\n\nGross food.",
    "date": "2016-08-01 15:07:34"
  },
  {
    "review_id": "zSenk_lqVB04Hn74Lsafgg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "EOKwm-EHp7ToNcJqlYNHQA",
    "stars": 2.0,
    "useful": 4,
    "funny": 0,
    "cool": 1,
    "text": "Dana R.'s review is accurate.  Sarku has never been a favorite of mine - too oily and carb-heavy.  Chicken is just OK - very greasy.",
    "date": "2017-07-06 17:15:29"
  },
  {
    "review_id": "Uwrfd1lRS0H8S_MNWfouBA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "zDC1Tee3BUmq_BfTuq7_Ww",
    "stars": 2.0,
    "useful": 7,
    "funny": 2,
    "cool": 5,
    "text": "Pretty Mediocre.  The family stopped in here while house hunting in this area. Clean but GRAY and cafeteria-like dining area.  DD had a meatball sub (my meatballs are better - these were bready and tasteless), DH had a cheesesteak which he hated and I actually like my (Kronos pre-packed, obviously frozen) Gyro sandwich on Pita.\n\nThe gents behind the counter were friendly and very nice.\nI was leaning toward 3 stars until I tasted DD's sub.  Blech!\n\nBathroom was clean and decent.\n\nThe place needs a facelift for the dining room and a re-vamp of the \"classic\" Greek-owned Pizzeria menu.\n\nI wish I could have liked it better - but we will NOT be back.",
    "date": "2011-10-24 00:32:54"
  },
  {
    "review_id": "V566yTdLKFuZ0hjGzN2U4g",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "MQXOzhLEF-SV4azYDlOLeg",
    "stars": 2.0,
    "useful": 3,
    "funny": 3,
    "cool": 0,
    "text": "2 stars is plenty generous for this chain of BLAH seafood (all pre-frozen) and bisquick (Cheddar Bay) biscuits.\n\nIt's the Olive Garden of the sea.\n\nAnd my brother in law and his wife both worked here when they were just out of high school, met and fewll in love here and now are married.  Best thing to come out of a Red Lobster in my opinion.  Certainly the food is not \"gourmet\".",
    "date": "2008-12-04 21:29:52"
  },
  {
    "review_id": "BaTO7EvbwvSkzh7aWdXJZw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "Ag_GeZwOrT0nmyhnKQiVBA",
    "stars": 2.0,
    "useful": 2,
    "funny": 1,
    "cool": 1,
    "text": "Friends don't let friends drink fourbucks.  This particular location is crowded fduring the AM rush especially.\n\nI also call it CHARbucks as the coffee drinks usually are roastde too dark for me.  The espresso drinks are passable - but be careful as they are loaded with sugar and often with fat if you get them made with whole milk.\n\nNot a big fan of Starbucks in general.  We grind and brew our own at home using peregrine coffee beans for a fraction of the price.",
    "date": "2009-01-06 18:43:49"
  },
  {
    "review_id": "-13pAx7IW9JZQ_N-a3-UQw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "aunmz06iWvo3bd6MMHEbqg",
    "stars": 2.0,
    "useful": 10,
    "funny": 3,
    "cool": 0,
    "text": "Meh.  It's really small - and has a coffee bar, a bar and ONE (lame menu) burger-bar food based restaurant.\n\nLots of slots and a few table games.\n\nNot my bag, baby.\n\nHonestly?  Were it not for proximity - I would NEVER come to Sugarhouse - I'd sooner go to AC or even Bethlehem, PA.\n\nPhilly fought long & hard to get a casino - and THIS is what they get?\n\nSorry - Unimpressed.",
    "date": "2011-01-04 19:45:51"
  },
  {
    "review_id": "PFYSPSw7EU_G_USgU0Uu4A",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "AcYIHFnobT3yT6bSZg2UgA",
    "stars": 2.0,
    "useful": 1,
    "funny": 0,
    "cool": 0,
    "text": "Yes, Tom A.  everyone IS right.  Total mediocrity and a neccessary evil.  Philadelphia has a piss-poor number of grocery stores and supermarkets.  The Superfresh kinda sucks, the Pathmark is ghetto and this ACME is barely passable.\n\nWe come here when we don't wanna deal with Superfresh's picked-over produce.  And then we'll come here and it'll be just as bad with a  picked over dairy case.\n\nCHECK YOUR FRESHNESS DATES on meat and dairy products especially.  We found yogurt that was 2 weeks past it's date.  (We told the manager who promptly pulled it off the shelves.)\n\nBe careful.\n\nLike Superfresh and Pathmark (which are also filthy), ACME could use a good cleaning.  The floors are just nasty.",
    "date": "2009-01-05 20:59:59"
  },
  {
    "review_id": "ryCl6sklSPHM0eiIuKkKQg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "dD8qp4Ro74EI4DqQl8FFCw",
    "stars": 2.0,
    "useful": 1,
    "funny": 0,
    "cool": 0,
    "text": "Stopped in once while in 30th Street - looked around and left.\nI'm not a big fan of Au Bon Pain.",
    "date": "2013-07-03 18:53:32"
  },
  {
    "review_id": "DxKtIqQ8unscd7ZCE0RxZQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "b2WN3yA79dMvCUMywM3I_A",
    "stars": 2.0,
    "useful": 2,
    "funny": 1,
    "cool": 0,
    "text": "What can I say anout Dunkin Donuts - really?  Some people love the coffee here - I think it's just OK.  (I mean, once you've been spoiled by Peregrine it's hard to turn back)  It's better than Charbucks - and cheaper.\n\nI have also tried the regular and white hot chocolates.  They are mixed from powders and come shooting out of a dispenser.  The white hot chocolate is like drinking a cup of sugary fat.  It's sickening.  The \"regular\" hot cocoa - while also sugar laden is at least drinkable.\n\nThe donuts are not baked on premises and thus sometimes are not too fresh.  \n\nI guess I'm just not a DD gal. America may run on Dunkin - but I'll be running away.  Oh - my 5 year old LOVES DD - especially munchkins - but she's 5 and will eat anything sweet.",
    "date": "2010-01-03 20:41:16"
  },
  {
    "review_id": "bPhdxnq4VLaKGnmE_TKDiw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "F43ox1eEedpvt6968xp0sA",
    "stars": 2.0,
    "useful": 8,
    "funny": 3,
    "cool": 2,
    "text": "Meh.  Just ok, but my elderly parents love it here. Inexpensive and \"safe\" breakfast, lunch and dinner, too.\n\nAvoid the fish (salmon, talapia), ick.\n\nStick to eggs and pancakes",
    "date": "2019-08-24 17:30:27"
  },
  {
    "review_id": "l63DiqIU4hpkvTEkL0ETjQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "9ZiARoddTm3anAtWzZo4Bg",
    "stars": 2.0,
    "useful": 8,
    "funny": 17,
    "cool": 4,
    "text": "Pretty darned awful.  We were cajoled into coming here by our 5 year old after dining at the illiustrious IHOP next door.  After purchasing $10.00 worth of tokens it was off to the filthy, sticky, germ-laden \"rides\" and games. \n\nI could feel myself contracting a rhinovirus by the minute.\nOh - and when I put a token in the mini carousel (my kid was the only one on it) about 5 little kids sensed \"free ride\" and pushed their way on board freaking her (and me) right out.  NO PARENTAL supervision of these kids.  Ugh.\n\nWe also played some \"ski-ball\" and then the little one fed the tickets into the \"ticket muncher\" to have them counted which took about 23 minutes.  The 103 tickets got her a cheap plastic ring, stickers and some small plastic object that I still don;t know what it is.\n\nAnd we still have about 8 tokens left over for next time.\n\nNext time?\n\nOh dear g-d please don;t make me come back here.",
    "date": "2009-12-12 22:12:00"
  },
  {
    "review_id": "gdbfhHQ235Bp3E5EKkucKA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "jkGQQ4_LgJx3hwPtCFkzbQ",
    "stars": 2.0,
    "useful": 5,
    "funny": 5,
    "cool": 4,
    "text": "We were greeted in a very friendly manner and offered free chocolates.  After being seated though, we just had to leave.  This is not an appropriate venue for a business lunch.  Loud, distracting decor and a predominantly chocolate menu made it hard to choose from the over priced snacky-type lunch menu.\n\nSave this place for a date or (if you're rich) bring the kids who are sure to be entertained here.\n\nThis place will fail if they don;t offer some sensible lunch choices (Salads were $13.95) or lunch specials.",
    "date": "2009-08-12 11:31:58"
  }
]