[
  {
    "review_id": "kHp4ISY3ug9v2n2vxP0XXA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "1UNorskttXSWuEcgzKzXcA",
    "stars": 5.0,
    "useful": 3,
    "funny": 0,
    "cool": 2,
    "text": "Xo-Cheat on your diet!  It's Xo-worth it and Xo-great to come here.  I love the Oaxacan cuisine and kick-y cocktails with real tropical fruits used in making them.  I have been here twice already and, although pricey - and sometimes unbearably crowded, I will be back again and again.  It's Xo-Good!\n\nThe Aussie Bartender is muy, muy caliente!\nTry a couple of Dona Florinda cocktails with fresh prickly pear cactus fruit.  Super Yum!",
    "date": "2008-05-29 15:15:17"
  },
  {
    "review_id": "ekDIqTVyYgYZXU-BYVEl_A",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "bFO_XYnYMDF1GMY9LK3oxQ",
    "stars": 5.0,
    "useful": 4,
    "funny": 0,
    "cool": 2,
    "text": "A few lucky PWCG members took part in a share of delicious, sustainable salmon from  OTOLITH SUSTAINABLE SEAFOOD in Philadelphia.  The 15 lbs of Salmon came in convenient (approx.) 1 lb portions.\n \nWith my first lb (I have gotten 3 lbs so far) here's what I made:\n \nKaren Flam's \"Grilled Gravlax\".\n \nSince I hadn't the time to do a proper \"cure\" here's what I did:\n \nDry-rub the clean, thawed salmon with:\n \n1.5 tsp. Penzey's Shallot Salt\n1 tsp. Penzey's Vanilla Sugar (yes, really)\nA few healthy shakes of granulated Garlic\nA few cracks of fresh black pepper\nLOTS of fresh or dried dill.\n \nThen, squeeze on the juice of one (or two) fresh lemons, or use 3-4 TBSP of bottled lemon juice.\n \nWrap in plastic and refrigerate for 4-6 hours (I couldn't wait any longer) - ideally - cure longer (and add some juniper berries - I didn;t have any).\n \nHeat a skillet with 1-2 tsp of good olive oil and pan-grill (or use a real grill or grill pan).\nI seared mine (First with skin side down, then flipped and seard the flesh side).\n \nSlice thinly and serve.\n \nDo not over cook!\n \nMy 6 year old gobbled up the small slice I gave her and asked for more right away.\nShe proceeded to eat about 4 oz!",
    "date": "2011-08-30 22:26:25"
  },
  {
    "review_id": "oWVeR7pZpsPzX25OnrV6yg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "htO_nlxkEsYHzDrtbiUxew",
    "stars": 5.0,
    "useful": 3,
    "funny": 1,
    "cool": 1,
    "text": "I am giving 5 stars not so much to the coffee shop (which is about 3.5 stars) but to the FABULOUS customer service we got from Nicolas Capes at the MAIN site of La Colombe.\n\nYou see, we wanted to have individually wrapped foil pouches of coffee as wedding favors for our June 2008 nuptuals.  DiBruno Brother's couldn;t help us.  Neither could Dunkin Donuts, nor Cappriccio (though the manager tried).\n\nThe coffee favors available on \"wedding\" websites as favors is sub-par pre-bagged swill.\n\nWe wanted QUALITY - and with La Colombe - our guests got it - for reasonable coin, too.\n\nWe ordered a case (96 pouches) of the house blend and bagged each pouch in a cute little tulle bag, and added a Yankee Candle \"buttercream\" votive.  Between the coffe and the cream - our closet smelled heavenly.\n\nThe coffee favors were a huge hit and La Colombe is the ONLY Philly coffee place to come through for us.",
    "date": "2008-09-30 14:54:54"
  },
  {
    "review_id": "WUZa6GNZHHG_2fTE6zsssA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "_PQzeo8P2sGczzFEifrK-Q",
    "stars": 5.0,
    "useful": 3,
    "funny": 1,
    "cool": 2,
    "text": "OMG I echo Emily A.  I just discovered the Italian Market (I know, I know -what took me so long) and I went to Claudio's for home-made ricotta (so creamy, fresh and good - and CHEAP - $2.99 a lb.) and mozzarella.\n\nCan't weait to pre-order a Burrate for later this month.  Burrata is Mozzarella with a creamy-buttery cream in the middle - so decadent.\n\nI have FOUND my source for mozzarella.  Hooray!",
    "date": "2009-01-12 14:20:13"
  },
  {
    "review_id": "xLUxLQd5uZg23bqeRAm3gQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "KTGEa8V9ec0QBYM_uk1YLQ",
    "stars": 5.0,
    "useful": 4,
    "funny": 1,
    "cool": 4,
    "text": "Three cheers for the kielbasi boys (one of them was smokin' hot!) and their CHEESESTAK filled pierogies.\n\nThey gave our group of 11 a tour of the smokehouse - and we got to sample the turkey kielbasi, and several other varieties.\n\nYou gotta check this place out!  This is the real deal.  \n\n$8.00 a dozen.\nCash only.",
    "date": "2011-05-07 17:54:01"
  },
  {
    "review_id": "wEWmxH3JKP6rlQjzVlg5Xw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "00szsg8vQy6yX5f-m9sI4A",
    "stars": 5.0,
    "useful": 5,
    "funny": 0,
    "cool": 2,
    "text": "Pick your own Strawberries in season has given me and now my little one spring after late spring of red-stained -face bliss.  None Such has great, fresh, farm-raised, seasonal produce.  (That means berry bliss in May/June and Corn late summer.)\n\nWe love it.  The same family has owned and run None-such for years!",
    "date": "2009-02-17 20:50:13"
  },
  {
    "review_id": "cNi557dQUGot_qsm5DDDnw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "_PQzeo8P2sGczzFEifrK-Q",
    "stars": 5.0,
    "useful": 2,
    "funny": 0,
    "cool": 0,
    "text": "I recently discovered the Italian Market (I know, I know -what took me so long?) and I went to Claudio's for home-made ricotta (so creamy, fresh and good - and CHEAP - $2.99 a lb.) and mozzarella.\n\nCan't weait to pre-order a Burrata for later this month.  Burrata is Mozzarella with a creamy-buttery cream in the middle - so decadent.\n\nI have FOUND my source for mozzarella.  Hooray!",
    "date": "2010-12-27 16:48:57"
  },
  {
    "review_id": "Omgw60Ez0ftDkfLPOekSPw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "Ei0wJeADbNtwvA9CrvknJw",
    "stars": 5.0,
    "useful": 5,
    "funny": 1,
    "cool": 3,
    "text": "Honestly, this place's sorbettos and gelatos rival Capogiro in Philly and any of the joints in NYC.  The Biscotti, Vanilla, Irish Whiskey (tastes like Bailey's) and Banana varieties rocked my world.\n\nI had a first-class affogato with a delicious espresso pulled just for me.\n\nEVERYthing is home-made - cakes, novelties - even Pizzelle.\n\nCan't wait to return and so glad a local chick turned me on to this place.\nCheaper than Rita's.  No comparison.  JUST GO!!!!",
    "date": "2016-05-19 00:36:45"
  },
  {
    "review_id": "LPV8GsrNJsv1ewHEsSJipg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "-JStjL-8mRZq4ov4uI1FaQ",
    "stars": 5.0,
    "useful": 2,
    "funny": 1,
    "cool": 2,
    "text": "OMG!!!!  I can't even believe I am the first person to Yelp this.\n\nDo I dare tell you all how really, really, really great this place is?  It's crowded enough as it is - if I tell you I'll never get a table.\n\nOK, I'll tell you a little bit.\nIt's a no-decor, little atmosphere place run by a genuinely NICE family (the hostess/daughter is marrying the pizza chef in August 2008 in Brooklyn).  They make their own mozzarella, and bake fresh brick-oven pizza on a thin - but not-too-thin crust.\n\nThe shrimp scampi is ENORMOUS - they give you over a dozen shrimp.\nIt is garlicky & oily - so if you order it light on the garlic 'n oil it's even better (IMHO).\n\nThe Veal Parm is a flam-family (that's FLAMILY) staple and my mom & I can easily split it.  (Comes with a side of pasta.)\n\nFresh (onion-y) bruschetta arrives on the table nearly as soon as you are seated.\n\nCappucino is light and frothy.  (mmmn, mmmn good.)\n\nA great place for families and kids.\n\nI LOVE IT HERE!!  So much!",
    "date": "2008-08-11 19:14:00"
  },
  {
    "review_id": "u3dgV-mV_7vupc793TRaEg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "9XpU6r6ATXSWYfbU7kibaQ",
    "stars": 5.0,
    "useful": 1,
    "funny": 2,
    "cool": 1,
    "text": "Passero's morning (and 3 PM - 4 PM ish) crew is wonderful - they move the line quickly and get my order (which varies0 correct easch and every time.\n\nI love the iced coffee, cafe au lait and teas here.\n\nSuch a world of difference here vs Charbucks.\nI also love Old City Coffee - but Passero's is right in Suburban station so I can stop there to (and from) work so easily.\n\nLove it here!",
    "date": "2013-09-03 16:13:47"
  },
  {
    "review_id": "JJREp6RNTQd1sdjf3JJK6w",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "J-ciDDEdIHMcChGIyKZnOg",
    "stars": 5.0,
    "useful": 7,
    "funny": 1,
    "cool": 2,
    "text": "Lily and Erin (the owners of ACW) are two sweeties who MAKE sweeties! The cupcakes are custom decorated - and the cake itself is moist and yum-a-licious. \n\nNeed cupcakes for your kids party? Come here? Need something more upscale or elegant? Like for a wedding? They do that, too. A real find!\n\nI especially love that I never have to bake again!  (I am lazy and need home-made cupcakes at least twice a year for my kids school) ACW to the rescue.\n\nGive these ladies a try - MUCH better than Brown Betty!  (Sorry, Brown Betty - their cake is moister.)",
    "date": "2010-05-12 01:09:59"
  },
  {
    "review_id": "rK2XlWViMdb2iDulYwgtFA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "J-ciDDEdIHMcChGIyKZnOg",
    "stars": 5.0,
    "useful": 9,
    "funny": 0,
    "cool": 5,
    "text": "Lily has a new partner now and brand-new digs in Port Richmond.\nHer cupcakes won her the $10K prize on Food Networks Cupcake Wars - and she also appeared on Cupcake Champions.\n\nHer decorations are gorgeous - but more importantly - the cupcakes taste amazing!!!\n\nWe love you, Lily!!!",
    "date": "2012-05-15 13:42:02"
  },
  {
    "review_id": "aUcq1jzZna-WtHcB9NVEoQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "-JStjL-8mRZq4ov4uI1FaQ",
    "stars": 5.0,
    "useful": 1,
    "funny": 1,
    "cool": 3,
    "text": "A family favorite for years - and now our kid is nearly 9.\nSalmon over angel hair with fresh tomato and spinach is divine.\n\nVeal parm platter is large enough for 2 to share.\nCappucino is some of the best around.  (GET ONE!)\n\nWe love coming here at lunch time (when there is less or no line).\n\nThe owners just had a 2nd baby - Congrats!",
    "date": "2013-09-01 01:00:28"
  },
  {
    "review_id": "5WzC6COFazrAvoUk9lO5UQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "-JStjL-8mRZq4ov4uI1FaQ",
    "stars": 5.0,
    "useful": 10,
    "funny": 3,
    "cool": 8,
    "text": "While no longer owned by the Luberto family, the food is still magnificent here.  Our favorite Italian spot in the D-town area.\n\nTry Chicken Marsala, Veal or Chicken parm, Crab Ravioli (a special - if they have it, get it) or anything in pink vodka sauce.\n\nDelicious! And big portions to take some home.\n\nCasual.",
    "date": "2018-10-14 19:52:37"
  },
  {
    "review_id": "Qn4TMUdOoqm7XbdwkrLZmQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "-JStjL-8mRZq4ov4uI1FaQ",
    "stars": 5.0,
    "useful": 2,
    "funny": 1,
    "cool": 0,
    "text": "Now our dd is 7 and this place is still a multi-generational family fave.\nThe pizzas, pasta and (my fave) veal parm are served in huge portions (prices are not cheap but an entree for $14.95 feeds 2 easily.)\n\nOh - and don't miss the cappucino here - it really is a well-kept secret - what a treat!\n\nBe prepared to wait on weekend nights.",
    "date": "2011-11-06 19:17:08"
  },
  {
    "review_id": "mzgV7UW8Rtu0NZDkvWlOIw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "bFO_XYnYMDF1GMY9LK3oxQ",
    "stars": 5.0,
    "useful": 3,
    "funny": 2,
    "cool": 2,
    "text": "A fine kettle of fish, indeed!  Otolith provides sustainable seafood (much from Alaska) - in my case, specifically salmon as a CSA-type \"Share\" to my group of women from the PWCG (Philadelphia Women's Culinary Guild.)\n\nThis year, I am sharing my share through Panache Foods - a home-delivery service of fresh, local produce.\n\nCan't wait to get my individually-wrapped 1 lb packs of fresh, delcious, heathy, sushi-grade salmon!\n\nYUM!",
    "date": "2011-05-23 16:27:09"
  },
  {
    "review_id": "LKwLO2Q6JPbaLhtmImNdWA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "EtKSTHV5Qx_Q7Aur9o4kQQ",
    "stars": 5.0,
    "useful": 1,
    "funny": 1,
    "cool": 2,
    "text": "A delight ful lunch at a table (A TABLE!!!!!) at 11:45 AM on a Tuesday - before the crowds began, along with a stellar veggie burger (with guacamole) and divine pickled beets with heavenly (or devil-ish??) lemon ricotta has made me give them that ellusive 5th star.\n\nA friend and I also shared the tater tots with a smoked onion creme fraiche dip (yum-city!) and our service was spot-on!\n\nThe bathroom was even cleaner - again - we were there at 11:45 AM on a Tuesday.\nBy the time we left at 12:45 PM - the place was PACKED.\n\nGo today!  Get a burger!  Get some pickles. (Beets, green beans or tomatoes - all are great.)  Get happy!",
    "date": "2012-03-06 21:08:40"
  },
  {
    "review_id": "aXljXkjqrVvVPRCrTo56tQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "-JStjL-8mRZq4ov4uI1FaQ",
    "stars": 5.0,
    "useful": 4,
    "funny": 0,
    "cool": 1,
    "text": "OMG!!!!  We ate here (again) tonight - party of 7 including my 4 year old daughter.  Reasonable prices and just terrific Italian-American fare.  Everything from my little one's hand tossed mini Margarita pizza to classic Chicken Parm to my MIL's Lobster ravioli (a special) was wonderful.\n\nFriendly service and just GREAT!!\n\nEveryone in Dublin and Doylestown (and all points in between) should know about this fabulous find!",
    "date": "2009-07-12 00:55:15"
  },
  {
    "review_id": "RE-rjzW1WvUZFaHmlNG9tQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "EtKSTHV5Qx_Q7Aur9o4kQQ",
    "stars": 5.0,
    "useful": 9,
    "funny": 3,
    "cool": 5,
    "text": "We arrived just before Happy Hour (5 pm) officially starts and what an amazing evening of food, drinks and stellar service we experienced.\n\nWe began with expertly mixed drinks, tasty devilled eggs and always terrific pickled beets. Service from Katelyn was just perfect, but what really stood out was when Candace presented us with those delightful pickled beets, served in a mason jar on a beautiful wood platter accompanied by delectable whipped ricotta and olive tapanade.\n\nWe also sank our teeth into a well cooked yet juicy burger on a potato roll with cheddar, lettuce, tomato and house made dressing.  Recalled that backyard barbecue from childhood.\n\nI am not a burger person, but Village Whiskey after 10 years, is still nailing it.\n\nWe love you, Candace!!!! Clearly, after 21 years in the biz, you KNOW what you're doing.  Brava!!!",
    "date": "2019-11-21 00:34:10"
  },
  {
    "review_id": "ce6M6rsyByWN9Sy_lk_jAw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "ptLOmLGPbmq9QH6CXDGRZg",
    "stars": 5.0,
    "useful": 7,
    "funny": 3,
    "cool": 6,
    "text": "A nicer ambience than El Primo (right behind it) but higher prices, too.\nWe had a muy authentico lunch including excellent Guacamole Morita, Tacos al Pastor (terrific flavor and the tortillas were fresh) and a sope on a scrumptious home-made masa base.\n\nMany choices of meats and great veggies.\n\nThe star of the show was the whompin'-huge Burrito Suizo ($14 but 2 people can easily share it).\n\nFriendly service and a great choice for super-tasty Mexican fare.",
    "date": "2021-08-10 21:10:50"
  },
  {
    "review_id": "Nft2j5-StEPHIYHCVOcB2w",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "HTqXI5S2XcSlh_ylx9sE6g",
    "stars": 5.0,
    "useful": 3,
    "funny": 0,
    "cool": 2,
    "text": "I agree with Joy G.  The cannolli are filled to order, the taralli are the real deal, sfolliatelle,  EVERYTHING is delicious and amazing.  Be sure to order in advance for holidays like Xmas and Easter - they get BUSY.\n\nCan't wait to visit the original location.",
    "date": "2010-05-23 13:25:56"
  },
  {
    "review_id": "pgfeAMdRMl49Q9HcrNoQXA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "JNHEadNYIm5eY_4lTjmISQ",
    "stars": 5.0,
    "useful": 2,
    "funny": 0,
    "cool": 1,
    "text": "Curds & Whey catered a small dinner party (9 people) for a charitable organization that I support.  The salmon, cold broccoli/craisin salad, pasta salad and enormous cookie/rugelach platter were all terrific.\n\nThe salmon was moist and perfectly cooked - accompanied with a garlicky-herby-yogurt sauce.  YUM!!!!\n\nThe owner is somehow related to one of the ladies on \"the board\" of the group I am in so, I bet that's why they use them - but related or not - this food was \"as good as it gets\".\n\nGreat job C&W!  One day I will come and eat there - I can't wait!",
    "date": "2013-07-17 22:26:56"
  },
  {
    "review_id": "ZbLVJqtG47YkcedDm15J7g",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "cPDX2Y4H0fks-Qj5tfBduA",
    "stars": 5.0,
    "useful": 2,
    "funny": 0,
    "cool": 0,
    "text": "Such a cute little pink shop.  And the scents wafting from the window on a crisp fall day just made me HAVE to go in.  (Note:  they have sporadic hours - so read the door).  Super-friendly gals (and one guy) were baking and glazing before my eyes.\n\nGanache coated cookies, cupcakes, tarts.\n\nLove it.\n\nSo glad I walked by and walked in.  Bring cash - they don't take plastic.",
    "date": "2008-12-16 15:17:04"
  },
  {
    "review_id": "ZBWLfPhOHot6Cs-DkC1YzA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "Vcn_cuQNKRF0eQ16TXVaXQ",
    "stars": 5.0,
    "useful": 2,
    "funny": 0,
    "cool": 2,
    "text": "They did our 3 tiered, multi flavored wedding cake and the results were picture-perfect and so yummy.  They are pricey - but you get what you pay for.\n\nCustomer service was terrific from initial cake tasting and consultation, through color and design selection.\n\nPerry (the pastry chef) is a master!\n\nWe loved our wedding cake.",
    "date": "2008-08-21 18:00:02"
  },
  {
    "review_id": "U1py5VM8EYfqQRWHN1QyGg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "JNHEadNYIm5eY_4lTjmISQ",
    "stars": 5.0,
    "useful": 2,
    "funny": 0,
    "cool": 3,
    "text": "Attended a catered event for8-10 people and it was amazing.  A delicious pasta salad with tomatoes, spinach and feta (not too salty).  Green salad wth nuts, cinnamon pears and a Maple-Walnut dressing that was so good you could drink it.\n\nDesserts and more!\n\nLove this place and wish I lived closer.",
    "date": "2016-06-21 16:55:53"
  },
  {
    "review_id": "x4h8tTsLXqmz0ezaacuiuA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "JD2SkbWJFpKyMZjqzT8fdA",
    "stars": 5.0,
    "useful": 8,
    "funny": 2,
    "cool": 4,
    "text": "A 5 star, new, clean, spacious SUPER WAWA.",
    "date": "2019-01-28 13:27:40"
  },
  {
    "review_id": "cLtODrm40-GtqUhldVAmKg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "S6AP1meHAC0RxJXW26fq1g",
    "stars": 5.0,
    "useful": 6,
    "funny": 4,
    "cool": 8,
    "text": "I joined Philly Foodworks in the spring on 2019 after taking a few years hiatus from my old CSA.  I love that you can customize the boxes and add meat, dairy and pantry items.\n\nThe user interface is not super easy, but the customer service from Dylan and the team is so great that I don't care.  I just email changes to them if I can't get the website to work, but I almost always can.\n\nI get an egg subscription too, and if I need to cancel it one week or three?  Nobody minds.\n\nThere is a $28 minimum (easy to meet - organic veggies are not cheap) but everything is fresh and so delicious.\n\nLOVE, LOVE, LOVE!",
    "date": "2019-07-05 16:53:47"
  },
  {
    "review_id": "u-QSwzf_41RBaGGN4S3yzg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "ffi48yk8tmg6NY9iIKZBBQ",
    "stars": 5.0,
    "useful": 8,
    "funny": 1,
    "cool": 4,
    "text": "Good news!  Media Bean Company now brings their fabulous breads, pies, FOCCACIA PIZZA ($4 a slice and worth every penny) and artesanal baked good to the Media Farmers Market on Sundays from 9 AM - 1 PM.\n\nWe just love that pizza - especially the kind with fresh mozzarella, fresh basil (with or without a balsamic drizzle).  My 13 year old gets 2 slices to go from the market and they are usually mostly gone by the time we drive home.\n\nSoooooo delicious - and supports working people with disabilities.\n\nKeep it up, Media Bean Co!",
    "date": "2018-08-02 18:24:02"
  },
  {
    "review_id": "HvyjrPY85RbW0w8h_Yoqsw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "S6AP1meHAC0RxJXW26fq1g",
    "stars": 5.0,
    "useful": 11,
    "funny": 4,
    "cool": 10,
    "text": "I can't say enough great things about Dylan, James and the entire Philly Foodworks team.  I am a subscribing member now and I just love this service and the best local, seasonal produce around.  So great!",
    "date": "2020-11-18 13:10:47"
  },
  {
    "review_id": "-nYQUqAGm_-xf2AOr5SATQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "S8ZFYEgMejpChID8tzKo9A",
    "stars": 5.0,
    "useful": 10,
    "funny": 3,
    "cool": 4,
    "text": "OK, here's the secret to having a 5 star experience at Amada - go on a slower night (like a Monday during the summer) so that you can be seated comfortably and the noise level won't be too deafening (this is a LOUD, busy place).\n\nGo with a crowd - we had 7 ladies and ordered 2 plates each.  Sounds like not enough?  WRONG!!!  Many of the choices are heavy. (Even at tapas size.)\n\nStandouts amoung the 14 different items we tried?\n\nGambas (your basic garlic shrimp - done just right), Flatbread with Artichokes (divine), Yellow tomato gazpacho (perfect on a summer night) was garnished with crab salad and avocado ice cream (Yes - a savory icecream pluche).\n\nThe crab-stuffed peppers were so incredibly creamy, crabby and tasty we ordered one more plateful.  (So I guess we had 15 dishes among 7 ladies).\n\nThe plate of veggies (can't remember the name) was simple and perfect - tomato, pepper, onion and a delectable eggplant dip.  It was accompanied by crispy-thin bread smeared lightly with a chive goat cheese.  HEAVENLY.\n\nLamb meatballs were too rare (nearly raw)  for most of the groups liking, but the sherry cream sauce and fresh green peas were tasty.\n\nThe salad with figs and blue cheese came literally wrapped in Jamon.  Weird and not my bag - but it, too, disappeared.\n\nMeanwhile, they ARE heavy handed with the salt and the (salty) cheeses - so if you KNOW this (you, smart -yelper-who-pre-reads before you go, you!)  Ask for items light on the (salt) (Cheese) (Sauce) etc.\n\nI can't wait to come back here - at an off time - with more than 2 other people.\n\n2 dishes apiece for 7 people came to $280 (including tax 'n tip) including ONE sangria each.  (Well, not I, I had 2 virgin mojitos with a splash of pineapple juice).  \n\nJose, baby,  you live up to your hype.\n\nAnd I have now been to all 5 Philly Garces joints.  Huzzah!\n\nOh - and if you don't eat pork or shellfish - you'll have a TOUGH time here.  And if you are vegan - fuggedaboutit!  (Dairy is hidden in things)",
    "date": "2010-07-27 02:01:11"
  },
  {
    "review_id": "31HvGPkdUYhM8CsaCCSKFA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "ESgGX4_yw6pnVVQA-oyHsg",
    "stars": 5.0,
    "useful": 1,
    "funny": 1,
    "cool": 3,
    "text": "Still the best bang for the buck THAI food in the entire city.\nSalmon\nCurry\nTom Kha that ROCKS.\n\nLove it!!!\nAnd still lovin' it years later and after trying lots of Thai places in Philly. (And elsewhere)",
    "date": "2013-04-12 16:00:32"
  },
  {
    "review_id": "RlsVgE8t8NLseYVfAVDykA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "ChMvzo7WYSZzxlwGMS7CFA",
    "stars": 5.0,
    "useful": 4,
    "funny": 2,
    "cool": 3,
    "text": "An unbelievably excellent meal and service at Dos Gringos Mexican Kitchen. Those short-ribs were meltingly tender, and the veggie enchiladas and tostones al pastor are Da Bomb! Shout outs to Danielle and your new expediter/busser. Terrific. A +! Wonderful birthday celebration.\n\nGreg treats us like old friends.\n\nMuch love.",
    "date": "2015-10-25 00:40:56"
  },
  {
    "review_id": "L24anyCQriUzHKPkxZPAow",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "gihNKyt5d6lIZQem2r12Lw",
    "stars": 5.0,
    "useful": 2,
    "funny": 0,
    "cool": 1,
    "text": "This is a GREAT place to buy beef.  (For chicken I like Harry Ochs - also on the Market).  The steaks are gorgeous - and you certainly pay for that care & expertise.  The butcher will custom cut and package the meat for you (which is great for our small family.)\n\nI love to shop at RTM and Giunta's is a welcome addition (or mainstay -  should say!).\n\nNice selection of ground beef, pork & veal, too.\n\nLovely looking veal chops - but alas, I could not afford them that day.",
    "date": "2008-09-03 14:02:00"
  },
  {
    "review_id": "WHS3L9PIki7VlrYbL6jjUA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "ChMvzo7WYSZzxlwGMS7CFA",
    "stars": 5.0,
    "useful": 2,
    "funny": 0,
    "cool": 0,
    "text": "As always - fabulous food and service.",
    "date": "2015-04-05 22:20:23"
  },
  {
    "review_id": "QA7Hk9lmbzwxeBmOpapiOg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "R0JUjyjGEzUlY3auVhY_tg",
    "stars": 5.0,
    "useful": 1,
    "funny": 1,
    "cool": 1,
    "text": "I can't say enough good things about Lori & Victoria at North Bowl - also John and Erin and everyone who helped make my 6 year old's birthday party with 14 5 & 6 year olds a smashing success.\n\nThe food was good - plain pizzas from rustica, veggies 'n dip, the famous tots, chicken fingers.\n\nThe bowling was great!\n\nAnd the single shot on Absolut Vanille hit the spot.\n\nGot a party to plan?  I highly recommend you consider North Bowl.",
    "date": "2010-10-17 21:51:26"
  },
  {
    "review_id": "DhI8jabjZZv-WUh_nbvmWQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "30cpm1uq6xcQCmN6JTrB8w",
    "stars": 5.0,
    "useful": 7,
    "funny": 4,
    "cool": 1,
    "text": "Now on my 2nd visit - I am on my way to becoming a lobstah mobstah.  This time I got 1 lobster roll and a side ($6) of Jonah Crab claws. The taste of summer in New England.\n\nCan't wait to take my 8 year old here - she'll love it.  She's a lobster roll fan big-time.\n\nSo awesome!!!!",
    "date": "2013-07-03 16:09:35"
  },
  {
    "review_id": "zHxGONjyyhs6_WAk79vsWg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "KqUinf0QEeiZdxko2dFEsA",
    "stars": 5.0,
    "useful": 2,
    "funny": 0,
    "cool": 1,
    "text": "Even better than the original Shane's!\nThe fabulous guys who run the Franklin Fountain have re-opened (and gussied up) Shane's.\n\nIt's a REAL  old-time confectionary shop - replete with barley sugar (toy) candies (made in molds), chocolate creations and \"penny candy\" (that starts at $4 for a generous small).\n\nMy daughter (age 7) proclaimed the large plump, multi-colored and distinctly multi-flavored gummy bears, \"The best I've ever eaten in my entire life!\".\n\nWe are so gleefully happy that Shan'es is back - and better than ever.\n\nSee you at Valentine's Day!\nAnd Easter!\n\nAnd whenever I get a hankering for Necco Chcoclate Wafers...\n\nThank goodness for the new & improved Shane's!",
    "date": "2011-12-12 18:22:50"
  },
  {
    "review_id": "Xjqp7I4VxgtMT-8kRWmw8Q",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "ESgGX4_yw6pnVVQA-oyHsg",
    "stars": 5.0,
    "useful": 6,
    "funny": 1,
    "cool": 3,
    "text": "OMG!!!! Do not let my secret out.  $2.00 Tom Ka Gai can not be beat (the most addictive Thai Coconut Soup - with chicke or shrimp - for $2.50 - or just vegetarian.)\n\nI love the pad thai and curries, too.\n\nCASH ONLY and you don't need much - for around $6.00 you can get a full delicious Thai meal.  (Bring some home tonight - the eat-in ambience leaves something to be desired.\n\nYUM!!!!!!",
    "date": "2008-07-15 18:34:38"
  },
  {
    "review_id": "9Et_J78FIydNztI0ABLJrQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "KqUinf0QEeiZdxko2dFEsA",
    "stars": 5.0,
    "useful": 5,
    "funny": 0,
    "cool": 2,
    "text": "We LOVE this place and always will.\nThe Berley Brothers rock!\n\nExcellent gummy bears (seriously - the best my 11 year old has ever tried) and great chocolate treats.\n\nPackaging, music, decor and experience is second to none.\nLOVE IT HERE!",
    "date": "2016-05-25 22:26:38"
  },
  {
    "review_id": "dVwa-c2mQJVTRFP5QCT9tw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "ChMvzo7WYSZzxlwGMS7CFA",
    "stars": 5.0,
    "useful": 4,
    "funny": 1,
    "cool": 1,
    "text": "A five star experience with Greg & the gang (the entire crew was top notch and working hard).  Even Greg's parents were sitting next to us at the bar and enjoying their BYO Eggplant.  Jess was terrific, too!\n\nOur 10 year old, once again, devoured her plate of surf & turf fajitas.  She loves this dish.  DH had the Seared Tuna special - and I had a bite, too.  Delish!  My enchilada was superior and the salsa verde just makes the dish.  They even had PERNIL on the menu.  Real PERNIL!  So impressive.\n\nThe service was just terrific and we were made to feel like family.\nThus - a 5 star dining experience all the way around - even on a super crowded Saturday night.\n\nWe're coming back in 2 weeks - but this time we made a reservation using their new, cool app.\n\nTHANK YOU!!!!!! (And thank you to Greg's parents for the gift of Greg.)",
    "date": "2015-02-09 13:28:41"
  },
  {
    "review_id": "x_tju6CDCkyA-qjgc89qrA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "kxKai8GE5oDMPevV7oxvbA",
    "stars": 5.0,
    "useful": 3,
    "funny": 1,
    "cool": 1,
    "text": "I adore much this place.  Everything from the decor and service once inside (the receptionists rudely demand that EVERYONE in your party be present before being seated - and they don't reserve for small groups.  BLAH!!!!).  The waiters are so entertaining - and even balance drinks and tray of drinks on their heads.\n\n(Maybe one of the pre-requisites to employment there is to have a flat head?)\n\nAnyhow, the food is really great - especially the Molcajete dishes and Guacamole.  The appetizers are great too and for lunch try the (affordable) enchildas.\n\nExpensive - but so worth it - for true haute-Mexican cuisine.  This ain't no Qdoba and I am glad of that.\n\nOh - and the tequila selection and CLASSIC Margaritas are perfectly balanced, fresh and re-freshing.  LOVE 'EM!!!",
    "date": "2008-07-17 20:03:07"
  },
  {
    "review_id": "NmnEMbXnu4fKHi9DaHdgxg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "Zqd_DHAtrdzRJ8u3zwrvEA",
    "stars": 5.0,
    "useful": 3,
    "funny": 0,
    "cool": 0,
    "text": "Now that I have explored lots of deli options in PHilly and South Jersey - I goot say - for corned beef?  Hershel's is absolutely 5 star in my book.  I often will get a 1/4 or 1/2 lb of sliced corned beef to go along with my fruits & veggies from Iovine's or Fair Food Farmstand.  A few decadent slices are all I can handle.\n\nThis is GOOD stuff!",
    "date": "2011-07-15 15:44:08"
  },
  {
    "review_id": "2ythP26stzWjukf5oIldHQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "_C7QiQQc47AOEv4PE3Kong",
    "stars": 5.0,
    "useful": 3,
    "funny": 1,
    "cool": 4,
    "text": "You really haven't lived until you've had brunch and dinner (they are different experiences) at Commander's.\n\nBananas Foster is a MUST try here.\n\nThe service is white-glove and attentive.\n\nThe classic dining rooms (even post-Katrina) recall a bygone era.\n\nIt's worth the money and time to come here.  FOR REAL.",
    "date": "2010-09-21 18:55:40"
  },
  {
    "review_id": "ODNmOA0zYqHUvW4LjYtwGA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "sl3Lm8ZNuY_oIop0ZFRzuw",
    "stars": 5.0,
    "useful": 3,
    "funny": 0,
    "cool": 0,
    "text": "The 5 stars goes to John for his incredible customer service. He personally delivered meals for my and an office mate to our office up toward Claymont, all the way from New Castle.\n\nMy friend had the Penne Florentine with Chicken and I had a delicous Veal Platter with a side of fettucine.  Everything arrived piping hot.  (Unfortunately, so did my side salad - I put it in the fridge at work to re-chill.)\n\nWish they weren't so far away.\n\nInexpensive, SIMPLE (not 5 star fancy, but 5 star tasty), classic Italian/American faves.",
    "date": "2011-02-17 20:20:14"
  },
  {
    "review_id": "xSqRVRx90oAb5n3zFY_ehQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "R0JUjyjGEzUlY3auVhY_tg",
    "stars": 5.0,
    "useful": 4,
    "funny": 2,
    "cool": 3,
    "text": "My little girl enjoyed her 6th birthday so much that we are having her7th here as well later this year.\n\nMeanwhile, DH, DD and I bowl a quick couple of games today and ordered a single order of tater tots.\n\nA fun afternoon - and even worth the 25 minute wait for a lane.  I forgot that Saturdays can be a zoo here.  Best to come at a quieter time.\n\nGood clean family fun (and mama can even get a cocktail).",
    "date": "2011-09-10 19:32:09"
  },
  {
    "review_id": "oVXZDzBiw8sM4-KVyZa8jw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "IWqQjclp1fxK3vuqs5nNzA",
    "stars": 5.0,
    "useful": 4,
    "funny": 0,
    "cool": 2,
    "text": "We love you, Mai!\n\nAnd we love the treats from BTH - especially the 70 cent egg tarts and $1 chocolate croissants.  The sponge cake treats in the fridge are a fave for our 7 year old.\n\nStill some of the best tapioca pearl tea in the city!\n\nBTH rocks!",
    "date": "2012-03-05 14:37:02"
  },
  {
    "review_id": "NgMtQsNWUlsse870NoHGwQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "5NtlI8JSlVcDNcsstl9oeQ",
    "stars": 5.0,
    "useful": 4,
    "funny": 0,
    "cool": 2,
    "text": "Ok - I upgraded them to 5 stars based on our last visit (we have now been there about 4-5 times.)\n\nThis time we came with our 6 year old at night and had pancakes, a chef salad (with delicious FRESH cooked turkey breast) and FABULOUS home-made pierogi.  Do not miss them.\n\nThe re-modelled and added 2 new bathrooms (lovely) and I just love the Court Diner.",
    "date": "2010-10-20 15:17:38"
  },
  {
    "review_id": "wrNfQ7Kkv7kvg2ZCtDKf8w",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "IWqQjclp1fxK3vuqs5nNzA",
    "stars": 5.0,
    "useful": 9,
    "funny": 3,
    "cool": 7,
    "text": "Ok, it's official.  We are now friends with the owner/baker Mai.  She also has an adorable 7 year old daughert and 1 other child.  They treat my daughter like family whenever we come in for sponge cakes and shrimp dumplings.\n\nAnd we never spend more than 5-6 dollars - ad you get so many treats for such a small sum.\n\nThere are still only 2 tiny tables out front - and today there was a gaggle of elderly men chatting away and laughing over 60 cent cups of coffee.  This place is a gem.\n\nMy little one ate her shrimp dumplings, a hot dog bun, a piece of cream-filled sponge cake and then colored in her coloring book while I watched the steady stream of customers come in and out to pick up cake orders, loafs of freshly baked bread and lots of fresh-cut mango bubble tea.  ($3.00)\n\nDon't miss a chance to support a terrific TRUE CHinatown neighborhood, family-run business.\n\nYUM!",
    "date": "2009-08-31 20:48:32"
  },
  {
    "review_id": "f_gPnjtDTnnTAladYVB0QA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "TnwGFR_5ntHByM1VMD9etg",
    "stars": 5.0,
    "useful": 3,
    "funny": 0,
    "cool": 2,
    "text": "I had a party for 11 people and had Panda Express cater it.\nWe ordered 2 Panda Feasts and a tray of 12 Veggie spring rolls.\n\nThe food arrived hot, fresh and on time.\n\nJay - the manager and Rob - who delivered the food - were great to work with and even gave us additional side orders of Fried Rice and Noodles - so we had ample food.\n\nThe Honey Walnut Shrimp was a big hit.\nWe also got Chicken & Broccoli and Beef & Broccoli for \"safe\" choices.\n\nEveryone enjoyed the food - and the price was withing my budget.\n\nI will definitely use them again.\nI am so amazed at how good this \"fast food\" Chinese is - especially when they cook it fresh to order.",
    "date": "2011-07-18 15:31:38"
  },
  {
    "review_id": "kT1rBGRi09D-UfpcKONdxA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "5NtlI8JSlVcDNcsstl9oeQ",
    "stars": 5.0,
    "useful": 4,
    "funny": 0,
    "cool": 1,
    "text": "We are treated so very well whenever we visit the court (usually for breakfast or lunch),\nDon't miss the home-made pierogies.\n\nGood coffee and moderate prices.\nIs the food 5 star (not really)?  No, but the service is so nice and pleasant.\n\nLove coming here.",
    "date": "2014-02-23 15:30:49"
  },
  {
    "review_id": "EpwEzxUJoF-dVfZprI_xUw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "XJvOamdhTQI65jmzTfreDQ",
    "stars": 5.0,
    "useful": 1,
    "funny": 0,
    "cool": 1,
    "text": "A truly excellent source for kitchenware, cutlery and gadgetry.  They have a large selection and can order whatever you need if they don't have it in stock.  Plus, the Italian Market location makes it easy to snag some fresh ingredients to use in your newly procured kitchenware.\n\nI also enjoy shopping at Kitchen Kapers.",
    "date": "2009-02-04 18:35:35"
  },
  {
    "review_id": "xc0XgDlxinGKXTfXCLpWxg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "JwUu2KahLe3WraLvHkzQMQ",
    "stars": 5.0,
    "useful": 7,
    "funny": 0,
    "cool": 4,
    "text": "Fan-frikkin-tastic.\nSuper fresh foods for meat eaters and vegetarians.  4 kinds of Tabbouleh - one with Quinoa.\nLentils.  Eggplant.  Labni.  Dolmas.  Schwarma.\n\nI'm in heaven!",
    "date": "2017-03-24 17:19:39"
  },
  {
    "review_id": "jbc9AiTA8fmVFg3mkAohJw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "DNMDGalFejExZqwb_YVQnQ",
    "stars": 5.0,
    "useful": 10,
    "funny": 4,
    "cool": 8,
    "text": "One of the best La Colombe cafe au laits that I have ever had.\nPuts Starbucks to shame!\n\nLovely!",
    "date": "2016-03-13 20:56:52"
  },
  {
    "review_id": "pHx8sDt0HJUStjWipamp_A",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "DNMDGalFejExZqwb_YVQnQ",
    "stars": 5.0,
    "useful": 5,
    "funny": 3,
    "cool": 2,
    "text": "Friends don't let friends drink Charbucks.  (Ok, Ok, I still drink it sometimes...) But not when 7 Stones is so conventient and wonderful.  Between the La Colombe coffee drinks and a huge selection of teas, fine pastries, quiche and even ice cream, this place is a WINNER in every way.\n\nLove. Love. Love it here.",
    "date": "2017-10-02 12:01:26"
  },
  {
    "review_id": "IFe6URfWWbnaaI8P3odFWg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "wm5mQ4cSpvko9WlCq07RFw",
    "stars": 5.0,
    "useful": 12,
    "funny": 1,
    "cool": 10,
    "text": "Still great - and nice new digs.\nTaco Salad is great with (small, but plentiful) grilled shrimp.\n\nCorn Tacos al Pastor are always a tasty winner.\n\nFriendly service and quick, too!",
    "date": "2021-03-04 17:29:36"
  },
  {
    "review_id": "JfM8WigjKipKZTTv5wS-IA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "L5U9dBXYKNDyWp4lk9j9QQ",
    "stars": 5.0,
    "useful": 10,
    "funny": 3,
    "cool": 6,
    "text": "5 stars for service from Emily (and the male manager and a pink-haired server who's name I did not catch).\n\nEmily served our group of 9 ladies for a long-awaited and long-planned Happy Hour.\n\nWe got a large table (a few tables pushed together) in the back and ordered apps to share (delicious fried Brussel's sprouts and thick-cut sweet potato fries with 2 delectable dipping sauces - try the vanilla sauce).\n\nFolks ordered their own drinks and dinners - but 4 of us had the pan-seared scallops with a creamy risotto.  DIVINE.\n\nOur only complaint?  The $15 nachos (close to $20 if you want chicken) used to be an enormous platter - not anymore.   The nachos are still wonderful but you get much less - plenty for 3 people - but not for 9.\n\nThe 5 stars goes for the tremendous service including separate checks and rushing in a happy hour order (Iron Hill's Happy Hour drink specials end at 6 PM!!!!) for us.\n\nSo glad I planned my Ladies Night Happy Hour here.",
    "date": "2021-09-15 13:02:06"
  },
  {
    "review_id": "J4jptlPCP5sgl8dSO_iWwg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "L5U9dBXYKNDyWp4lk9j9QQ",
    "stars": 5.0,
    "useful": 2,
    "funny": 0,
    "cool": 1,
    "text": "I hosted a party for a group of 20 at Iron Hill and things went WAY better than ever expected or imagined.\n\nWe enjoyed delicious nachos, wings, guacamole, crab quesadilla, cheesesteak egg rolls and a few folks ordered dinners.  There were Salmon, Scallops  - and my 9 year-old demolished a big plate of fettuccine carbonara (Ah to be 9 again and to be able to eat like that). Desserts like cheesecake and the Chocolate Brownie Sundae (it has a special name) were show stoppers. (And many pints of Raspberry Wheat were consumed as well).\n\nWe are so pleased and grateful to our server, Megan and all the expediters, servers, bussers and hosts/greeters for a wonderful and fun evening.\n\nI would not hesitate to recommend Iron Hill to friends and colleagues when planning their holiday parties or other group events.\n\nWhat a great experience.\n\nBrava!",
    "date": "2013-11-17 01:38:44"
  },
  {
    "review_id": "uHIoG4_-FRwkvIk9gTUrTw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "YzluF3FNGjnW-tOrLZt8JA",
    "stars": 5.0,
    "useful": 4,
    "funny": 2,
    "cool": 1,
    "text": "Oh, Zama - you truly rock my sushi lovin' world.\nTonight I dined alone but was still treated well (thank you!) as I sat at the 8 chair sushi bar and watched the chefs work their magic.\n\nA single negi-chu-toro hand roll was buttery perfection.\nA $28 (7 piece nigiri) of market specials was delicious and 5 of the 7 fish I had never tried or never even heard of.  All delicious.\n\nPerfectly marinated ikura (salmon roe) - although for $5.00 a piece - the portion was very tiny.  (Like 18 eggs or so.  Come on, guys!)\n\nAnd for \"dessert\" 2 perfect slices of house-made tamago (none of that frozen garbage here!).\n\nDomo! Domo!\n\nI am infatuated (once again) with Zama.  Decor is Zen, sleek & lovely.  (Look up to see the giant Koi above you.)\n\n$60 including tax 'n tip (no alcohol) is pretty steep though.  My husband may freak out on me.  It also underscores what a GREAT value Doma is and how high-priced Morimoto is.  (Zama is right in between.)",
    "date": "2011-05-28 01:40:12"
  },
  {
    "review_id": "WYPumaPoY4QS4g7EVYnWFQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "Ko7mOX4Kqm3MeGKA81DZDw",
    "stars": 5.0,
    "useful": 2,
    "funny": 1,
    "cool": 3,
    "text": "A great source for poultry - whol and parts (and eggs!) right in the Reading Terminal Market.  Ground Turkey, turkey and chicken cutlets, boneless skinless chicken thighs and whole fryers are some of the GREAT things I have bought here.\n\nGreat place!",
    "date": "2009-03-06 17:55:44"
  },
  {
    "review_id": "RRRFmjxcJ54Euxgi0zpL3Q",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "BnprLJ4Lr33--YjTmgk9Zg",
    "stars": 5.0,
    "useful": 4,
    "funny": 1,
    "cool": 3,
    "text": "Since my last update, we have been to Doma 3 or 4 times including New Year's Eve (amazing) and last night just me and my 6 year old.\n\nShe ate 2 orders of Shrimp Shumai. and a bunch of edamame.\nAnd then she said, \"Mommy, I don;t want any chocolate lava cake this time\".\n\nSmart kid.\n\nI had the Naked Salmon roll (sans jalapenos) and it was so good, I ordered a second one.\n\nAnd that was it.\n\n2 rounds of Shumai 'n salmon.\n\nAnd we were stuffed.\n\nDan & the guys are so great with my little one.  She loves to sit at the high-top tables in the back.  (I prefer the regular tables, but I was out voted.)\n\nOh - and if you go to DOMA - save room for dessert (if you can).  The mochi-coated strawberries dipped in fudge and chocolate lava cake (sounds trite - but they make a good one) are amazing.",
    "date": "2011-02-17 15:21:49"
  },
  {
    "review_id": "yfM3X7NCocnIIjuZVRhkyA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "BnprLJ4Lr33--YjTmgk9Zg",
    "stars": 5.0,
    "useful": 3,
    "funny": 0,
    "cool": 2,
    "text": "Doma!!!!\nWhat a treat to be able to dine here again.\n\nTonight re-affirmed that Doma is one of the best restaurants in the city.\nIt's my fave and my 9 year kid (who has been coming here since age 3 or 4) loves it too and scarfs down salmon sushi, edamame and her favorite - BIG shrimp shumai.\n\nI had a delectable Kalbi dinner with 9 large pieces of tender, juicy short-ribs.\nDH had a variety of sushi including our love - the Naked Salmon.  (try this!!)\n\nThank you DOMA (and Pat and staff) for wonderful food and service for all these years - and hopefully many more.\n\nWe love you!! (And we miss you - now that we are out in the 'burbs.)",
    "date": "2013-11-17 01:21:19"
  },
  {
    "review_id": "hfHJFF65feqfwahvruAiTA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "YzluF3FNGjnW-tOrLZt8JA",
    "stars": 5.0,
    "useful": 6,
    "funny": 0,
    "cool": 2,
    "text": "Updating my review - and once again terrific food and service (by John).\nThe black belt sashimi plate (great for 3 to share) had Chu Toro, Kanpachi, Salmon-toro, branzino, Saba and many other tasty fresh fish.\n\nNY Strip Strips were amazing - especially the asparagus and \"magic\" mushrooms it is served with.\n\nCalamari Salad and red miso soup are also good choices.\n\nA  winner!",
    "date": "2016-02-26 13:59:00"
  },
  {
    "review_id": "4CJ4UWniMJWd0QVR_uVZrQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "hm_vd7AoipjSa3i0AFAR5A",
    "stars": 5.0,
    "useful": 3,
    "funny": 1,
    "cool": 0,
    "text": "For a bar this is truly as good as it gets.\n\nWe had a Food Coma inducing lunch at TJ's Restaurant & Drinkery today - but soooo delicious. BLTC&E (Bacon, Lettuce, Tomato, Cheddar and a fried egg - on Rye with a light smear of lemon aioli. - WOW!) Everything I have ever ordered here has been terrific and the hostess (older lady) is delightful. Love this place!!!!\n\nMy colleague ordered Mac & Cheese with Bacon & Tomato - and it, too, was delicious but a full plate of that would send me straight to nappy-land! \n\nI wish they'd offer a side of the plain Mac or a 1/2 order. PLEASE CONSIDER THIS!!!!!\n\n Oh - and the Turkey Cobb is amazing too (sounds like whatever - but the turkey is fresh roasted and the composition is ON POINT.)\n#FoodOnFleek",
    "date": "2015-07-31 17:52:38"
  },
  {
    "review_id": "_Jx8RWtQpKY_Bt2a9gjItQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "R17gwW6zn9ilslbdvKdgsg",
    "stars": 5.0,
    "useful": 4,
    "funny": 3,
    "cool": 4,
    "text": "Alma, you never disappoint me.  I hade my birthday party here in March (11 women with mucho mojitos, caipirinhas and many apps.)\n\nTonight however was a simple evening - executied perfectly.  A close coleague and I shared the divine thinly-sliced scallop ceviche - bright with tangy acidity.\n\nWe also shared (gotta have 'em) the tuna tartare tacos and royal palm dates.  A heavy but delicious bowl of duck confit fried rice - brimming with umami goodness, topped with poached egg and studded with currants and edamame beans.  And of course, a sweet side of maduros with a drizzle of crema.  (Who needs dessert?  Heck, who needs entrees? We were stuffed.)\n\nInstead of dessert she had a Mighty Leaf tea and I got a delicioso cafe con leche.\n\nWhat a meal!  What a night!\n\nAnd fabulous service from the lovely lady who served us.   I wish i could remember her name, but I just can't.\n\nOh - and I had 2 virgin Clasicos and my friend had a black cherry caipirinha and a Clasico Mojito.\n\nStill on top of its game.\n\nLove you Doug-y baby!  Even though you beat my sorry a$$ on \"Ready Set Cook\" in 1996.  Poor me - I was paired with a wimpy pastry chef from California.",
    "date": "2011-05-07 01:27:40"
  },
  {
    "review_id": "ML0tloYuXJPlhDpcp2_Q1A",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "MPEih4jFKkjvgJn6tuEZEQ",
    "stars": 5.0,
    "useful": 0,
    "funny": 1,
    "cool": 0,
    "text": "OMG - I just went Liqueur crazy and Lambic nuts in here today - with a wide variety of every alcohol under the sun.\n\nSo enjoyable to shop at an alcohol supermarket.",
    "date": "2013-06-30 20:43:21"
  },
  {
    "review_id": "cbkwg1VIuk0l4makvtlxtw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "nKGHbVaymrq2xjMM9mxydg",
    "stars": 5.0,
    "useful": 2,
    "funny": 0,
    "cool": 1,
    "text": "What a great place!\nThey make their own ice cream (not soft serve) and have great flavors.\nCaramel Macchiato had a substantial swirl of sot caramel in it.\nBanana ice cream was rich in Banana flavor.\nCake, Pretzel, Waffle and Sugar cones available.\nExcellent and friendly service (and they get PACKED).\n\nCash only.\n\nWonderful, new & clean. Plenty of picnic tables out side to eat at.",
    "date": "2015-06-14 13:37:07"
  },
  {
    "review_id": "j1i6PXlmQvgqEpNxLFmi8g",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "BnprLJ4Lr33--YjTmgk9Zg",
    "stars": 5.0,
    "useful": 7,
    "funny": 0,
    "cool": 4,
    "text": "Now that we've moved to a house in the \"burbs, how I miss my beloved DOMA more than ever.\n\nI popped in at 5:15 ish (they don't open until 5:30) and was seated anyway - and waited a while and relaxed.\n\nOrdered a Naked Salmon (not a maki at all - but gorgeous salmon over an avocado puree atop crispy fried (evil but so good) rice.  More like a canape.\n\nTuna Hwe dup bap was sublime - uber-fresh quail egg yolk, crisp cucumber and cool asian pear.  (The toasted pine nuts are no longer on it - too bad.)\n\nI miss it here!!!",
    "date": "2012-04-19 14:56:51"
  },
  {
    "review_id": "fhSt1kOR6Zu53hQr0_Aq7w",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "YaLKDgS_zIYIm6jkXWCxgA",
    "stars": 5.0,
    "useful": 3,
    "funny": 2,
    "cool": 1,
    "text": "Freakin' awesome when eaten in store.\nHad a $3.00 (tax included) single slice of a fresh white pie with arugula, a sungle large artichoke heart (and stem) drizzled in a sweet baslamic glaze.\n\nFor me - this is the penultimate of pizza.\n\nSeating is limited.",
    "date": "2011-09-10 19:28:40"
  },
  {
    "review_id": "DwRrf1F3ro6CT54Xyg0aqg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "BnprLJ4Lr33--YjTmgk9Zg",
    "stars": 5.0,
    "useful": 3,
    "funny": 0,
    "cool": 3,
    "text": "Family dinner on a Sunday night (not crowded) at Doma was blissful and AWESOME as usual.  We are regulars now and they ALL know us (for better of for worse, I guess.)\n\nDD enjoyed her shumai and a DIY Salmon roll.  Dh had a plate of various rolls including the decadent Naked Salmon roll (served on crispy rice).\nI had a Negi-hamachi handroll (lightly chopped upon my request) that was sheer perfection.\n\nA gratis hamachi naruto was our luscious gift from the chefs.\n\nWe love you, Doma - see you again May 19 if not sooner.\nThis is my 6 year old's favorite restaurant ever (and she's been to quite a few, believe it or not.)  DH & I love it here too. We thank you for always accomodating our family (some folks cringe when they see a family with kids).\n\nDo you love sushi?  Do you like Korean or Japanese influences?  You MUST try DOMA.  \n\nP.S.  If you are a sushi purist - this place may not be for you - I have learned with time which dishes to order sauceless or with sauce on the side.",
    "date": "2011-05-09 00:35:13"
  },
  {
    "review_id": "obJViyE1OO6R_ZDbzqT0Sw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "BnprLJ4Lr33--YjTmgk9Zg",
    "stars": 5.0,
    "useful": 7,
    "funny": 2,
    "cool": 7,
    "text": "Went there again!!!!  This time alone - no kid, no DH and ordered the $42 Omakase sushi/sashimi platter and nothing else (and I was stuffed to the gills - pun intended).\n\nI poissoned myself with fresh lucious fish - hamachi, sea bass, salmon, tuna, 1 piece of buttery toro, a single sweet shrimp.  A small piece akimono (fish liver - the foie gras of sushi), a gently torched single scallop and some poppin' fresh ikura completed the mix.\n\nA house-made piece of perfectly balanced tamago was my dessert.\n\nAnd a roll - topped with chopped hamachi. (This roll changes based on your preference and the chef's choice.  TELL them what you like and don't like).  The chef here ROCKS.\n\nMmmmmmmmn.\n\nOmakase heaven.\n\nMine, mine, mine, all mine.\nWish I had brought a split of Cava.\n\nNo kid!!!!\n\nBliss.",
    "date": "2011-06-20 20:39:41"
  },
  {
    "review_id": "xJzvnCM-LZQedE0jugrpmQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "MPEih4jFKkjvgJn6tuEZEQ",
    "stars": 5.0,
    "useful": 2,
    "funny": 0,
    "cool": 3,
    "text": "OMG - It's a veritable grocery store for wine, beer, spirits - even mixers and snacks.  High level of customer service and a the wine tasting man (on weekends - selected hours) offers advice and tastes.\n\nA great place to pick up some wine - or try a new one.",
    "date": "2011-07-14 14:04:12"
  },
  {
    "review_id": "QHdv9kgDgTb0zsYxL67USg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "BnprLJ4Lr33--YjTmgk9Zg",
    "stars": 5.0,
    "useful": 8,
    "funny": 0,
    "cool": 6,
    "text": "Still showin' the love for Doma - same great owners and some not-so-new faces on the staff (Yuli is an amazing server/hostess).\n\nWe enjoyed a plethora of uber-fresh sushi and sashimi delights including the ever-popular \"Naked Salmon\" and the not-to-be-missed Omakase maki.  We also shared a Bento Dinner with Salmon Teriyaki, Chicken Yakitori, a Yellowtail Scallion roll and more.\n\nKorean Taco app is fun (also ask about the truffled-tuna nachos - we did not try but they look terrific).\n\nThe triple spicy double tuna roll is a fave with the men in my life.\nPachinko roll (not ordered this time) is a hit with the kids.\n\nI truly miss coming here all the time and I make it a point to get a Doma-Fix whenever I am nearby.\n\nP.S. - My now 13 year old kid scarfed down all the leftovers the minute I walkd through the door.  She has been coming here since she was 4 or 5 and it's her favorite restaurant EVER.",
    "date": "2017-08-24 12:27:00"
  },
  {
    "review_id": "WHmDYH2-JmVf1zRLk0VUGQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "R17gwW6zn9ilslbdvKdgsg",
    "stars": 5.0,
    "useful": 4,
    "funny": 0,
    "cool": 2,
    "text": "OK, I don't eat pork and even still (menu is pork heavy) this places ROCKS my world.\n\nHands-down best Mojitos (get the classico - don't fart around with mamby-pamby-fruities) and Caipirinas anywhere.  You could drink yourself silly.\n\nThe ceviche is fresh and lovely - if just a hiar on the salty side.\nThe chicken soup came with fresh peas that the ladies shelled that morning.  My husband (back then fiance) had the Lechon - roasted piggy - which I could not eat - but he loved it.  The Vaca Fritta was spot-on old-school style.  EVERY BIT was worth the elevated calorie count.\n\nYes, it's a \"scene\" (what Starr joint isn't?) yes it's uber-expensive and YES IMHHHO it is worth it.\n\nGo for a birthday - or if you can expense it, or if a date will take you - but try it - at least once.  It is an EXPERIENCE and I loved every minute of it.",
    "date": "2008-07-17 19:55:38"
  },
  {
    "review_id": "DmzeJCwo4yZCLfSQ8-97IA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "kVTHnhgYUw-Pmr7wgDB4_g",
    "stars": 5.0,
    "useful": 1,
    "funny": 2,
    "cool": 1,
    "text": "For $15 you can eat like a king or queen with the lunch special.\nA friend and I each chose apps (Guacamole - which is great here - albeit topped with Cotija cheese that I can do without.).  They offered a salad with pomegranates again!  (Yay - but not too many in there.) The kale and romaine were adorned with a single deep-fried egg (wow) and bits of bacon.\n\nWe both got the shortrib huarache (masa-based flatbread) and it it delicious (and rich!).\n\nThe plantanos are not available for lunch but they made them for us anyway.  Perfection!\n\nMargaritas and Mojitos here are always freshly muddled and top of the line.\n\nFor $60 or so we ate so well!",
    "date": "2013-08-30 13:39:30"
  },
  {
    "review_id": "Wjo4Sk8Vy9vZLhnqkCSleA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "R17gwW6zn9ilslbdvKdgsg",
    "stars": 5.0,
    "useful": 1,
    "funny": 0,
    "cool": 1,
    "text": "I organized a Happy Hour for 7 women and we had a BLAST last night.\nOur servers Megan & Jasmine took excellent care of all of us - and even \"split off\" our bill into different permutations of food and cocktails.\n\nThe Happy Hour specials ($6 apps and certain drinks) are a great value.\n\nWe had several orders of Tuna & Marlin tacos, Dates wrapped in bacon (so good), Truffled Guac, Empanadas and more.\n\nI even got a side dish of the duck confit \"fried\" rice.  It came with a scary-looking poached egg on top - but man - once you broke that egg open and savored the rice, pine nuts, currants, duck confit and crunchy goodness - WOW.  It was a flavor blast on so many levels.  For $9 this \"side\" was more like a meal.\n\nDefinitely love the mojitos and alma coladas here.\n\nWhat a terrific restaurant on all fronts - food, decor and service.  All 5 star.\n\nDouglas - you are a MASTER of your craft.",
    "date": "2010-10-29 15:11:57"
  },
  {
    "review_id": "0oCUetlBLMMBx_mCq2imPw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "kVTHnhgYUw-Pmr7wgDB4_g",
    "stars": 5.0,
    "useful": 5,
    "funny": 3,
    "cool": 4,
    "text": "This place ROCKS my world.\nThe only complaint would be the noise level (we went on a Saturday Night) and the frenetic pace in which the courses were served - but heck - with all that yumminess going around - no complaints here.\n\nI started with a Distrito (read: basic) margarita - rocks, light salt rim - and wow - SO great.  I can judge the margarita when there is no fruit muddled in, no chi-chi twists, just pure Margarita goodness.\n\nMy dining companion and I both started with salads - the chopped salad - topped with crispy tortilla strips in a luscious buttermilk-chipotle dressing, and the GRENADA - you HAVE to try this in season - it is topped with a layer of jewel-like pomegranates and roasted pepitas.  Crunchy, crisp and fruity with a bite from the pequin.  YUM-I-NESS!!!\n\nThen we had the House-made chips, salsa and guacamole (10 - yikes!).  The chips and salsa were top notch and re-orderable - but with all the other great things to eat this is (*gasp* - can't believe I'm about to say this...)...\n\n...the first time that Guacamole was an afterthought for me at a Mexican restaurant.\n\nXochitl's guac was better - had a better flavor profile and was table-side prepared.  Not so at Distrito.\n\nAnyhow, we had a superb side order on Plantains & Crema (De-lump-scious).\n\nMy friend had the chicken tacos (not so great - sauce seemed to be an odd concontion of Hot Sauce, Sugar and Barbecue sauce.  Not a fave - but still edible.  I had the \"quesdailla\" - which looked more like fried pierogies, stuffed with w super-yummy pumpkin (calabaza) and cheese mix.  So decadent.\n\nWe were sooooo full by now - but could not resist the Churros - and were we glad we ordered them.  (Even better than Xochitl's)  9 mini churritos sprinkled with a vanilla bean sugar and served with a small (wish there was more...) scoop of home-made coffee ice cream  (WOW!!!!) and a tall shot glass full of warm Mexican chocolate and a top layer of dulche du leche.  ADDICTIVE!!!!    One could have easily downed the shot and licked the glass.\n\nOn weekends (we were in luck) there is a talented Mariachi singer.  He belted out Billy Joel's \"Piano Man\" in Spanish.  Service was attentive but I did feel rushed - especially when nearly everything came out at once - it was like \"SENSORY OVERLOAD\".  Our great looking male server helped!  It was also very, very loud in there.\n\nI would like to come back her on a Tuesday at 5 PM or another \"off time\" so I can hear myself think.\nI hovered between 4 & 5 stars and went with the five - because it really is a remarkable restaurant.  (Much better than Tinto.  I am jonsein' to finally try Amada.)\n\nThe bill for 2 including - only 1 alcoholic drink - tip & tax was exactly $80.00.",
    "date": "2008-11-09 21:31:57"
  },
  {
    "review_id": "tcF6rQnPKoVoUJ9xlBKe-A",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "YzluF3FNGjnW-tOrLZt8JA",
    "stars": 5.0,
    "useful": 3,
    "funny": 2,
    "cool": 2,
    "text": "What a treat!\nI dined alone (again) at the sushi bar and (again) enjoyed the limeade.\n\nMy server, Merci, was so sweet and accommodating.\nThe sushi chefs are each so talented - and of course chef Zama was there doin' his thing.\n\nThe \"black belt\" sashimi app was sublime and included 2 luscious pieces of salmon toro.  I also tried the lobster salad (outstanding) and avocado salsa (also very good).\nHome-made tamago - branded with the Zama logo - was a thing of beauty and exceptional taste.\n\nBest of all?  Ikura that was poppin' fresh.\n\nSimply amazing.",
    "date": "2014-04-12 15:24:17"
  },
  {
    "review_id": "WQDmJ69auXysNWApluXvkw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "BnprLJ4Lr33--YjTmgk9Zg",
    "stars": 5.0,
    "useful": 2,
    "funny": 0,
    "cool": 1,
    "text": "Went to Doma last night for a rare treat - a child-free dinner.\nHad the BEST time.  (Brought our own Prosecco.)\n\nTrio of tartares was terrific, as was my usual \"Naked Salmon\"  atop crunchy rice.  YUM!  My dining companion had a kick-ass chicken katsu.\nI also sprang for a $10 negi-toro handroll and am so glad I did.\n\nFAN-frikkin'-tastic.  And - I just went to morimoto a few days ago and yes, it is excellent - but for the money?  This place is a steal, a joy and a true gem.\n\nWe are planning a party here for my 6 year old this fall.  \n\nCan't wait!  Shumai and edamame all-around!",
    "date": "2011-04-16 18:43:35"
  },
  {
    "review_id": "dhN0b_WEMx_N_Vy2NqWSVQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "LQztzU5Hk_slwJpGLWb3cw",
    "stars": 5.0,
    "useful": 4,
    "funny": 2,
    "cool": 2,
    "text": "Tres bien! Magnifique! Et c'est la verite!\n\nI thoroughly enjoyed a sublime almond croissant.  Fresh, crisp, buttery, multi-layered, filled with almond paste and sprinkled with sliced almonds & powdered sugar.\n\nParfait!\n\nThe coffee drinks, chocolates, pastries and tartes here are all so delicieux!\n\nCan't wait to return!  Mon dieu, c'est le meilleur!",
    "date": "2010-03-02 23:54:29"
  },
  {
    "review_id": "SD93yg0KbXAENxQdOoVjng",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "88bPX7OEYX5-tCHmGb9JvA",
    "stars": 5.0,
    "useful": 7,
    "funny": 5,
    "cool": 6,
    "text": "They have gift certificates!!!!\n\nLovely service.\nI can't say enough great things about this place!\n\nWinner, winner, SALMON dinner!",
    "date": "2017-06-01 16:44:23"
  },
  {
    "review_id": "3DRgSg_1ask2rWMDq0uIpg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "88bPX7OEYX5-tCHmGb9JvA",
    "stars": 5.0,
    "useful": 6,
    "funny": 3,
    "cool": 5,
    "text": "My parents are regulars here and my husband and I love it here, too.\nThe food is truly \"as good as it gets\" with the exception of the canned green beans (side).  Just skip that and get onion rings, cucumber salad, mac & cheese or rice.\n\nThe seafood itself is divine - Shrimp & Scallops broiled in butter were simple but tender and delectable.  Lobster salad ($42 a lb) is terrific and the shrimp salad is fresh and flavorful.\n\nDine in (simple digs - you don't come here for atmosphere) or take out, you just can't beat the super fresh seafood here - fried, broiled or grilled.  Just so darned good.\n\nAnd terrific service - but again, we are regulars so they treat us great.",
    "date": "2019-03-02 23:43:53"
  },
  {
    "review_id": "QAGME66FPsO_kBcuK-TCuQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "XTFkMivGATF-enFwtD1XTQ",
    "stars": 5.0,
    "useful": 2,
    "funny": 1,
    "cool": 2,
    "text": "Had a fantastic experience at Dining Under the Stars (often more like \"Chaos out in the Heat\") at Bittersweet.  Normally, they do not serve dinner - but I sure wish they'd consider it.  A group of 5 ladies enjoyed burgers, fish & chips (a special) and the FABULOUS (calorie bomb) french toast BLT.  A side of Brussels Sprouts (again with bacon) made life complete.\n\nService was amazing - even on a crazy Wednesday night and the weather was great, too.\n\nCan't wait to try more items on this sweet & savory menu of comforting favorites.",
    "date": "2016-06-30 15:05:58"
  },
  {
    "review_id": "ZaPbM4-CPPKdERfHwY6_2Q",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "BnprLJ4Lr33--YjTmgk9Zg",
    "stars": 5.0,
    "useful": 3,
    "funny": 0,
    "cool": 1,
    "text": "Last night's visit was sooooooo fabulous.  We were smart and made a reservation for the 3 of us - we took our 5 year old DD who just LOVES (and ate 6 of) the jumbo shrimp shumai.\n\nService was great considering how frantically busy they were (they had to turn people away) on a Friday night.\n\nMy husband's sushi was great - especially the crunchy spicy tuna roll.\nI had the (ENORMOUS) Zen bento box which came with delectable tempura and 4 pieces of sushi, plus kalbi, 1 shumai (we got a little shumai'ed out) and a spicy tuna roll.  (Yum!)\n\nIf you are a big eater consider the $36 Zen box - comes with miso soup (GREAT and homemade), salad (tasty soy-based dressing) and dessert.\n\nAs a surprise - and mostly why I am giving them 5 stars is that they brought our daughter a HUGE platter ($14 on the menu) called the Doma Dessert Sampler.  (FOR FREE.)\n\nThe dessert sampler came with:\n\nVanilla ice cream topped with green-tea cream cheese and a fresh blueberry\n\nMochi-covered Strawberries (home-made mochi) with a small pot of fudge to dip them in (WOW).\n\n3 fried banana-tempura drizlled in (more) chocolate sauce and caramel sauce.\n\nAnd a MOLTEN chocolate lava cake.\n\nIt was a HUGE platter of dessert - and easily fed all 3 of us (who, by the way, were already stuffed from dinner).  Somehow we managed to eat it.  (Ha!)  What a treat.  And how nice of them to do this for us.\n\nMy little one already adores DOMA and now I am quite sure it has surpassed Roy's and Swanky Bubbles (2 of my little one' faves) as her favorite restaurant.\n\nMan, I wish my parents had taken me to places like Doma when I was 5.\n(Yes, she was the ONLY kid in the joint - this is not a kiddie place.)\n\nKid's got good taste.  Not a chicken nugget in sight.",
    "date": "2010-07-10 19:35:22"
  },
  {
    "review_id": "k_rzivwmbUQEEXu8EsFrXA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "EjwY66v3wVP8F9ZBcJnIVQ",
    "stars": 5.0,
    "useful": 10,
    "funny": 3,
    "cool": 8,
    "text": "5 stars for the Black Plate Holiday special - Smoked Prime Rib.  $10.99 and deeeeeeelicious.\nThe creamed corn is pretty amazing too.\n\nGet there for the holidays.\n\nP.S.  They cater.",
    "date": "2017-11-26 23:10:43"
  },
  {
    "review_id": "Isix7DEdUTfvr1b1oJCCMA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "m4Vxvy566FTJ-2GlTn3Obg",
    "stars": 5.0,
    "useful": 3,
    "funny": 0,
    "cool": 1,
    "text": "Used the online ordering for carry out and my order was complete, correct, ready and waiting when I went to pick it up.  Delicious for fast-food BBQ and so easy for a hungry crowd.\n\nStaff are so smiley and friendly.\n\nGreat!!!",
    "date": "2021-10-15 18:17:45"
  },
  {
    "review_id": "cW0AWIq6AjjySI4GFXXIRw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "MPEih4jFKkjvgJn6tuEZEQ",
    "stars": 5.0,
    "useful": 6,
    "funny": 2,
    "cool": 6,
    "text": "Like a supermarket for booze.\nLove it.  Except perhaps on New Year's eve or right before the superbowl.  Can you say \"uber-crowded\"?\n\nAlso a great source for free cardboard boxes.\n\nOn weekends there can be a police presence so do not overload your car with booze and drive to PA.  Be smart, people!",
    "date": "2018-04-05 19:34:18"
  },
  {
    "review_id": "dxEOXzjRVxfJOGE_iuzqAw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "YzluF3FNGjnW-tOrLZt8JA",
    "stars": 5.0,
    "useful": 10,
    "funny": 0,
    "cool": 5,
    "text": "Honestly - the food was exquisite my last time to Zama (in June 2017) with a colleague for a $100 (no alcohol, no dessert) lunch.  Sushi, salads, appetizers, all sorts of wonderful fish.\n\nDelightful.\n\nEvery bite was perfection.\n\nWish I could afford to dine here more often.",
    "date": "2017-08-16 13:06:58"
  },
  {
    "review_id": "nPNW1klihrJ0BOyKbz4Sow",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "GEuzwtdp2DX9c9HyhOT9KQ",
    "stars": 5.0,
    "useful": 4,
    "funny": 0,
    "cool": 3,
    "text": "I disagree with the 3 star people.  The landing is all about the view and the FABULOUS deck - and for this alone they could serve garbage.  But they don't.\n\nThey serve really nice food - a little yuppified and for a wedding here - the prices are way out of line.  (We contemplated having our reception here but it was just cost prohibitive - and the place is a bit smaller that we wanted for a big wedding.)\n\nThat said - I sent my parent's here for their 25th anniversary (albeit that was 17 years ago...) and they enjoyed it enormously.\n\nOver the years owners have changed - but it's still \"in the family\" and a great, great place.  An all-time fave for me - with lots of nostalgic memories.\n\nOh - and they have a nice wine list.  Including a few bubbly selections which I enjoy.",
    "date": "2008-11-13 17:02:15"
  },
  {
    "review_id": "ipw_qdzTocSUKgwrKlhaqw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "6pT7TIyrhpeo-LjTlIZBDA",
    "stars": 5.0,
    "useful": 1,
    "funny": 0,
    "cool": 0,
    "text": "Just a note that we still love Cafe Cret - although it is very expensive and a cup of soup is $4.75.  OUCH!!!!\n\nBUT we have to let you know about the fabulous Le Bus chocolate chip cookies.  They are the reason my daughter is giving Cafe Cret 5 stars.  If you get them heated up (ask the guy to do it) they are heaven on a plate.  For $1.08 (with tax) it' s a great winter warm up.\n\nTerrific service from the guys & gals who work here, especially Emily (who may have left by now).  Many are college and post-college aged students.",
    "date": "2011-01-16 19:45:53"
  },
  {
    "review_id": "AwUtqskeHcQjgnlvMezJzg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "3FqvW2DgDNdVy3kAbm8kwg",
    "stars": 5.0,
    "useful": 7,
    "funny": 2,
    "cool": 6,
    "text": "I am giving them 5 stars (when in reality they are more of a 4 star place) due to the PHENOMENAL service we received.  Angela - the (then) event planner helped us plan and cater a 70 person party.  They provided 2 (high school aged, but very competent) servers, all the pans, sterno and GREAT, GRAT food.\n\nWe had a fresh green salad, tomatoe pie (cut in squares on platters), Insalata Caprese, Sausage & Peppers, Pasta with mini meatballs, and a delicious Chicken Francese.\n\nThe food was marvelous and the amounts we ordered fed everyone with some (not not a ridiculous amount) of leftovers.  Perfect budgeting and execution.\n\nLovely!!!  I receommend them for catering for sure.  In our case (big order) they delivered and set up everything (for a fee).",
    "date": "2010-01-21 20:52:20"
  },
  {
    "review_id": "RH5iUEwiceWaqe8yQOpSyQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "MeJ4afqMv8_JjTHgjdrg_Q",
    "stars": 5.0,
    "useful": 4,
    "funny": 1,
    "cool": 3,
    "text": "Well, it's one year after our wedding already - can you believe it?\nWe had a special anniversary dinner at JAI last night for a party of 7.  The recreated our wedding menu and it was out of this world.\n\nTender filet mignon, rich smoked cheddar mac 'n cheese, tender, bright green beans and crunchy parmesan chicken in a light buerre blanc sauce.\n\nTo top it off we special ordered 12 chocolate dipped strawberries - that disappeared in a flash.   The pastry chef also sent out (gratis) 6 chocolate espresso truffles - hand made and yum-city!\n\nTeg the sommelier and GM is a doll and there were 2 weddings that night (it was a perfect 80 degree night).  One 36 party small wedding in the conference center and a huge (for JAI) 115 person wedding in the Wheelwright room.\n\nIt was fun to re-live our wedding day again (except that ours on 6/7/08 was in 96 degree heat!).  The service was great and we just can't recommend the JAI highyl enough.\n\nFor a wedding, a special dinner - or just to come and enjoy the food or lodging.\n\nTry the JAI - you won't be disappointed.",
    "date": "2009-06-07 13:52:46"
  },
  {
    "review_id": "3h-lAp-magS9j_CjSjzfgw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "eirHDiyhPn2YSo08G1tt6g",
    "stars": 5.0,
    "useful": 4,
    "funny": 0,
    "cool": 3,
    "text": "We had a 5 star experience from Bill (our attentive server) and the entire staff at Capital Grille.\n\nI was treated to a delicious birthday lunch here - and everything from the greeting by name when I arrived, to the f9ond farewell was top-notch.\n\nThe food was the star of the show - and our table was decorated with rose petals and confetti in honor of my birthday.  They also snapped a picture of me and my dining companions at dessert.\n\nMy meal consisted of truly perfect french onion soup (A cup was perfect for me - they also offer a crock), and the lobster salad.  I asked for extra tomatoes and they added a variety of heirloom cherry halves and beefsteak slices.  Delicious.  Topped with a shelled lobster claw.  Scrumptious.\n\nEvery bite was blissful.\nTruly.\n\nCan't believe it's a chain - but I have dined now at a few CGs and all are excellent.\n\nvery expensive - Lunch for 3 was over $150,  so plan accordingly.\n\nA special treat, indeed.",
    "date": "2014-03-19 18:07:47"
  },
  {
    "review_id": "1j_3BtbM2fub3h5MOYMuvA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "MeJ4afqMv8_JjTHgjdrg_Q",
    "stars": 5.0,
    "useful": 6,
    "funny": 0,
    "cool": 2,
    "text": "We were married here on 06/07/08 and everything went so swimmingly well.  From our initial site visiti in the Summer of 2007, to a FABULOUS tasting dinner in late 2007 to the actual \"big day\".\n\nThe tasting dinner, for starters, was such a great experience.  My fiance (now husband) and both of our sets of parents tasted 6 entrees and 6 apps, along with 4 sides.  We ound up selecting some GREAt choices which were well executed on the wedding night.\n\nOur wedding had 79 guests (8 of which were kids and 4 of which were three year olds).  We served buffet style - but could have opted for a sit down and had 4 hours of OPEN BAR.  (Whoo-hoo.)\n\nIt was 96 degrees on the day of our wedding, so it was really hot.  We wound up having the cocktail hour indoors, to save guests from the heat.\n\nThe food, service and accomodations were all top notch.  Wendy (event Manager) & Teg (General Manager) along with our day-of coordinator (you get one included with your wedding package) Wendy treated us very well and our every need was met.",
    "date": "2008-08-11 13:03:40"
  },
  {
    "review_id": "Fkk9ranjs0zUFodeZ4yQuA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "6_T2xzR74JqGCTPefAD8Tw",
    "stars": 5.0,
    "useful": 8,
    "funny": 4,
    "cool": 5,
    "text": "Toro tartar plus Tuna Pizza plus $75 chef sushi platter fed 2 of us with ease (and leftovers).  Fish of many varieties - and all were top quality and uber-fresh.\n\nWe still caved and split the chocolate pot de creme.\n\nTopped mine off with a glass of the Veuve and Mama was veddy veddy happy.\n\nOur server, Eric, was workin' it and everything was 5 star all the way!",
    "date": "2011-04-13 01:16:50"
  },
  {
    "review_id": "A4qDGLo--z5yMhbtIYLwrQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "eirHDiyhPn2YSo08G1tt6g",
    "stars": 5.0,
    "useful": 4,
    "funny": 2,
    "cool": 2,
    "text": "Honestly, the service and food here are always top-notch.  And, yes, it's a chain but it does not feel like one.  we had a private party for 12 (in the back small room) and it was lovely.\n\nLobster Salad (I love it here) never disappoints.\nWonderful!\n\nTastes even better on an expense account,  (Alas, I was paying.)",
    "date": "2015-08-18 16:17:25"
  },
  {
    "review_id": "ZBk_8-prCAytQ6iaPc0pVg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "xhWSGL8AfOaYLJj01-m-wQ",
    "stars": 5.0,
    "useful": 5,
    "funny": 0,
    "cool": 3,
    "text": "It is rare for a jaded ex-New Yorker like me to give a 5 star - especially out in the 'burbs, but Nectar really lived up to the hype last night. Aside from the gorgeous decor and scrumptious Pan-Asian cuisine, the exceptional and personalized service we received from Bruce & Laura (??) was truly top-notch.\n\nIn truth, this is probably a 4 star place, but it is a very, very strong 4 stars.\nTerrific for a date night.\n\nWonderful for making healthier choices.\n\nLOVE and can't wait to return.",
    "date": "2016-01-22 13:20:35"
  },
  {
    "review_id": "Gzu6TBtFEXvaPxYbkJfF0w",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "XZRpH6YkgikZDB_z_-z7rw",
    "stars": 5.0,
    "useful": 9,
    "funny": 1,
    "cool": 7,
    "text": "This place gets 5 store for the nostalgia factor - although in reality it's a 3 or 4 star operation.  What I remember most are those big - and I mean HUGE - ginormous-honkin'  ice cream cones.\n\nThe ice cream tastes so creamy and rich because it's made from milk produced right on the farm.\n\nI hope they can stay around for 50 more years.  AMerica is losing the family farms like these and it's a real shame.  \n\nSUPPORT YOUR LOCAL FARMS and FARM MARKETS!!!",
    "date": "2008-10-30 19:42:06"
  },
  {
    "review_id": "5EwW9QowwP6LCATNBV1fDw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "poviu-6n3iaRE4gdQz6OYw",
    "stars": 5.0,
    "useful": 9,
    "funny": 3,
    "cool": 8,
    "text": "I had not been to Oyster house in years and we were thrilled at the top-tier service and delicious food our work-group of 7 received.  Everything from booking our reservation (Only for large parties), to requesting separate checks for each of the 7 diners (so convenient) to attentive and friendly service from Joey.  Shout out to Joey - he was \"workin' it\" and was just amazing.\n\nThe ladies at the hostess desk were terrific too.\nAnd the \"shuckers\" at the raw bar were shucking at top speed.\n\nFood was swimmingly fresh - I had the pan-sauteed flounder with delectable lemon-butter green beans that were perfectly crisp yet tender. Our group enjoyed a plethora of raw-bar apps, soups (Chowdah) and lunch entrees and everything was out of this world.\n\nMy only wish?  That you could sub something for fries with the lobster roll. (I am a low-carber and can't have the roll or the fries.)  I would have LOVED to have some lobster.  One person ordered the lobster roll and it looked soooooo good.\n\nIt get's super, super crowded and noisy in here so be forewarned - but Oyster House is still doing a brisk and healthy business years later.\n\nWonderful!",
    "date": "2020-02-26 18:45:19"
  },
  {
    "review_id": "3jv94-pdp6JGeg9r80Bw_w",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "5oEyGDeqeXeMfFXZdevtFg",
    "stars": 5.0,
    "useful": 5,
    "funny": 0,
    "cool": 2,
    "text": "Okura catered the sushi bar at my husband's party at Hotel DuPont.\nNigiri were super fresh and included yellowtail, salmon, tuna and shrimp (all equally delicious).\n\nMaki cut to order included basics like Cali Roll and Salmon/Avo as well as Spider (Softshell Crab) and Shrimp Tempura rolls with fresh veggies.\n\nWasabi and Ginger were artfully displayed like flowers.\n\nI could have skipped dinner altogether (but it was also divine) and blissfully grazed for hours (6:30 - 9 PM) on Okura Sushi.\n\nThey cater!  Have them cater your next party.\n\nSpecial!",
    "date": "2017-03-12 14:04:49"
  },
  {
    "review_id": "-sNRt66HEaYrUd26fY1_vA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "QYzxoQ6VLsMe9nm2kjHUag",
    "stars": 5.0,
    "useful": 1,
    "funny": 0,
    "cool": 0,
    "text": "It's probably only really worth 4 stars but my brother is good friends with the owner - so I gotta give 'em 5.  They treat us like mini-celebrity's whenever we see shows there.\n\nFinally - a decent music venue inb D-town!\n\nGO PUCK!!\n\nP.S.  Bring money.",
    "date": "2009-03-14 18:58:58"
  },
  {
    "review_id": "7Rggny1rVG0Oibc59BYQzw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "ya99kXUiXgqEvjCjAqsHew",
    "stars": 5.0,
    "useful": 0,
    "funny": 0,
    "cool": 1,
    "text": "Can't say enough good things about the staff and owner of CMM.\nMy 10 year old kid and I are both VIP members and we have now brought 2 of y kids friends here who both loved it.\n\nVery please with the products and service.  Made an $80 Christmas Tree (ouch) - but we will have it for years.\n\nOur latest project was a 14 tile mirror that my kid custom made and hopes to take with her to college one day.\n\nVery therapeutic.",
    "date": "2015-02-19 02:27:03"
  },
  {
    "review_id": "lkNoFpUeWsct1a_OM7Gqqw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "i_FWONQD1ZBqrNE2b-M5Ug",
    "stars": 5.0,
    "useful": 5,
    "funny": 4,
    "cool": 4,
    "text": "Amazing!  A hair's breadth away from 5 stars - so I'mma gonna do it and give them all five - and especially Marina our kind, patient server who was so accommodating.\n\nFirstly, my dining companion and I walked in 45 minutes EARLY for our 8 PM res.  This is a hostesses nightmare and we were prepared to be told to \"sit at the bar\" but we got a table (in the bar area) right away.\n\nI had 2 of the tastiest Arnold Palmers you can imagine - made with the herb-infused house sun tea.\n\nEverything we ate from the fluffy warm brioche rolls with ramp butter to the delicate \"handkerchief\" pasta (mine with umami rich rabbit, my friends was vegetarian) to the luscious side of garden beets (at least 2 varieties of beet - possibly 3 it was hard to tell) and candied orange peel and a touch of creamy fresh ricotta. - All was wonderful - but the real showpiece was the special of SEASON ONLY squash blossoms (which I love!!!) delicately fried - stuffed with goat cheese and herbs.\n\nCalorie-city!  But so tasty - and we shared an order of 4 - so 2  seemed just about decadently perfect.\n\nWe also splurged and shared a Millefuille (more like quatrefuille - please tell me somebody gets my jokes...) of thinly sliced banana, toffee and chocolate served with a rich yet delicate quenelle (aka the Quenelle from hell) of dark chocolate sorbet. \n\nWow.\n\nBeets (pun intended) the heck outta Parc.\nSimilar price points but somehow we spent WAY less (no $60 seafood cocktail tonight, thank you very much).\n\nDinner for 2 with soft drinks and 1 dessert (no alcohol) was around $75 before tip.\n\nI can't wait to go back.\n\nGO TO TALULA'S. \nGo!\nGo!\nGo!\n\nAnd ask for Marina - what a sweetheart.\nTatiana was a doll, too.\n\nGreat service, great food, precious decor (a little too cutesy for me, but it's Starry-eyed splendor in the grass.).\n\nYou got me!",
    "date": "2011-05-18 01:28:58"
  },
  {
    "review_id": "mk3KhBsmkbUivZg7ci-qsg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "S6ACtNZ5wY0EjmK07iWUgg",
    "stars": 5.0,
    "useful": 10,
    "funny": 4,
    "cool": 9,
    "text": "5 star service from Jo Jo on a busy summer night - the place was hoppin'.  We needed to get in and out quickly and Jo Jo helped us do just that.\n\nPan-seared rainbow trout ($20) is always good for me and my husband enjoyed a southwestern chicken salad.\n\nNice place and very reliable.",
    "date": "2018-08-16 17:13:23"
  },
  {
    "review_id": "0qNXLi5zVIgKHdo1RA6EHw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "pnBPGy8iiBVkyVab7SCCsg",
    "stars": 5.0,
    "useful": 9,
    "funny": 4,
    "cool": 5,
    "text": "This Wawa, we affectionately refer to as the \"magic\" Wawa as it is about 1/2-way between my home in Media, and a friend's home \"out west\".\n\nIt's got gas, food/beverages, a rest room and plenty of parking.\nEverything we need to meet up 1/2-way and transfer our kids, sporting gear and other stuff from one friend's house to another.\n\nHooray for the \"magic\" Wawa!",
    "date": "2019-03-27 18:34:51"
  },
  {
    "review_id": "EzjB9zvA4sptutr0mhCKEQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "QUSctIF_D2yv_NJeokhXFw",
    "stars": 5.0,
    "useful": 13,
    "funny": 3,
    "cool": 8,
    "text": "Our party of 6 had a truly wonderful lunch during \"Taco Week\" at Condesa.  We all opted for the $22 three-course deal - choice of app, entrée and dessert.\n\nThe Aqua Fresca that day was a delightful guava, lemon and mint.  It reminded me of guava lemonade.  I had a splash of it over sparkling water to cut my carbs - and it was mighty tasty.\n\nThe fresh guac was truly flavorful with fresh cilantro and sliced mini-jalapenos.  Just the right amount of kick.\n\nFor an entrée I opted for the Platos of pork with onions and nopales - which I happen to love.  The pork itself was just perfectly seasoned and the right amount of fat and lean.  Juice.  Succulent.  Rich tasting.  And oh-so-not-Kosher.  Sorry, G-d.\n\n3 of the 6 people got lamb tacos (on bluecorn tortillas) and everyone was raving.\n\nFor dessert there were a variety of fresh Mexican pastries and a moist, warm (again, delightful) Olive Oil cake.    Too many carbs for me - but worth the splurge.\n\nThe food, décor and service here (even the mod-chic ladies room) were all stellar.  So great.\n\nPricey, yes - but the $22 three course is a great deal if you can get that.\n\nI can't wait to come back.",
    "date": "2020-01-24 19:19:39"
  },
  {
    "review_id": "IvzAre5D386WQHeUIbWR8A",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "rhdzgIxt3PikpHXm_QNCew",
    "stars": 5.0,
    "useful": 7,
    "funny": 2,
    "cool": 2,
    "text": "OK.  I'm a convert now.\nI come in 3-4 times per week (ouch - my wallet!) for green lemonaid - light on the apple, heavy on the greens.\n\nEvery now and then I get a petito beans & greens burrito which is way too much for breakfast and I am full until lunch or beyond.\n\nThe lady in the AM is so nice to me.\n\nI am much more into this place at breakfast when there is no line.\nWish you could get lunch items at breakfast (I'd get a chicken burrito and take it to the office and eat it at lunch!)\n\nLoving it here now for sure!\n\nP.S.  Please put a hook in the ladies room to hang your purse on.\nP.P.S.  Please consider posting a big, easy to read, professionally printed menu board up above to hlp the ordering process and lunch line speed.",
    "date": "2013-10-07 12:44:49"
  },
  {
    "review_id": "pDCVHkg5Bp--cQjE_l-oHQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "Hv-SHFEY6bG-CUBlaEjEmw",
    "stars": 5.0,
    "useful": 2,
    "funny": 3,
    "cool": 2,
    "text": "Now they get 5 stars!  They offer gift cards.\nBetween this and the $25 fruit baskets (I bought 4 of them at Thanksgiving time) and my everyday fruit & veggie needs, Gentile's can't be beat!\n\nMuch love!",
    "date": "2016-07-26 11:35:51"
  },
  {
    "review_id": "ysbaV929JLcWCETqTMqvrw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "9mvk_MwDpg2i6i8Odix3jw",
    "stars": 5.0,
    "useful": 1,
    "funny": 0,
    "cool": 1,
    "text": "Brand-spankin' new.  I hope they can keep it this clean and well maintained.\nEveryone is on their best behavior.  Fresh produce, pre-cut veggie trays and fruit bowls, gorgeous deli counter.\n\nI will be back - but again, I hope it can STAY this way.",
    "date": "2016-08-15 18:03:04"
  },
  {
    "review_id": "1exF40KcrlS-hOlIwxNpzA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "5Gdz1b4bffTJAWXENGtQPA",
    "stars": 5.0,
    "useful": 6,
    "funny": 3,
    "cool": 3,
    "text": "OMG!!!   Order the OMG -  it's so good!  A perfectly cooked REAL Italian Chicken Cutlet on a seeded Italian loaf (not a roll - a LOAF) with thinly sliced tomatoes, FRESH milky mozzarella (not that plasticky garbage) and pesto sauce (I get mine light on the pesto) which is fresh, bright green and uses a very goodtasting olive oil.\n\nNear perfection!  LOVELOVELOVE IT!\n\nCan't wait to try the pasta - and the salad with eggplant and mozz.",
    "date": "2012-11-13 01:24:28"
  },
  {
    "review_id": "eo1qjm9ruNoUKocGUhtu-Q",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "f8xbJqPZepSdmQjaHz25YA",
    "stars": 5.0,
    "useful": 4,
    "funny": 1,
    "cool": 2,
    "text": "Sometimes I find joy in the \"little things\"  - like the freshly baked anise biscotti from Termini Brothers.\n\nBliss!",
    "date": "2013-02-07 13:11:05"
  },
  {
    "review_id": "t1WDs3rPQGtY2k3wf6KMkQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "ZyNVYgJ-SB5TLva5HydmGA",
    "stars": 5.0,
    "useful": 9,
    "funny": 0,
    "cool": 9,
    "text": "We held a surprise 70th birthday luncheon at Chambers for 20 people and it was an amazing success. James (the manager - NOTE:  He left about a month later - fall of 2012) and I communicated for months beforehand and the actual day was picture perfect.\n\nDelicious food (We offered a soup/salad course and a choice of 4 entrees) and wonderful service by Lucas and the other servers. People raved about the perfectly cooked salmon and filet mignon as well as the delectable chicken/penne dish.\n\nChambers even allowed us to bring our own cake - and graciously sliced and served it for us.\n\nWe are so very pleased with our 5-star party at Chambers!\nI wish James was still around.",
    "date": "2012-09-30 13:55:23"
  },
  {
    "review_id": "dtIPZTcr3P3L2FbrBiS4IQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "9mvk_MwDpg2i6i8Odix3jw",
    "stars": 5.0,
    "useful": 4,
    "funny": 1,
    "cool": 5,
    "text": "No issues - I got in and out quickly and picked up just a few needed items.  Granted, it was a Wednesday at about 12:30 Pm so not a peak time.",
    "date": "2017-12-14 14:58:33"
  },
  {
    "review_id": "2XM49tGt3TuA_pS8_fWX2g",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "IWHdx0NhDKADkGOgXgOFKQ",
    "stars": 5.0,
    "useful": 1,
    "funny": 0,
    "cool": 1,
    "text": "OMG - so good - even worth the ridiculously long wait (and kinda pricey if you add provole, long hots AND broccoli rabe.\n\nBut about twice a year I just gotta get a sandwich from DiNics in RTM.\n\nYUM.",
    "date": "2011-10-15 23:19:24"
  },
  {
    "review_id": "Kf4QEn_xRw6IpyvBOnokmA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "VIYvcX9SScnqmoI0so1KZA",
    "stars": 5.0,
    "useful": 4,
    "funny": 1,
    "cool": 3,
    "text": "Let me preface this by saying that I am NOT a hoagie gal.\nI don't \"do\" cheese steaks and I like to eat healthy.\n\nBut I must insist that Primo is the best - I get the Chicken Suprimo - as a wrap (that bread is fresh and yummy - but waaaaaay to many carbs pour moi.).\n\nI also like Nonna's veggie - as a wrap - no oil, with fresh mozz instead of provolone.\n\nThis is the real deal!  Even for a non-hoagie eater.",
    "date": "2008-07-10 18:54:57"
  },
  {
    "review_id": "JSVTjwvNc4dma6-yEjXFgA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "Hv-SHFEY6bG-CUBlaEjEmw",
    "stars": 5.0,
    "useful": 3,
    "funny": 1,
    "cool": 2,
    "text": "Now they get 5 stars!  They offer gift cards.\nBetween this and the $20 fruit baskets (I bought 4 of them at Thanksgiving time) and my everyday fruit & veggie needs, Gentile's can't be beat!\n\nMuch love!",
    "date": "2014-03-26 13:22:31"
  },
  {
    "review_id": "1NUqBOMXGuh1Ifips42sSg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "pq7CAQGsxjaFcMLmhdbbvA",
    "stars": 5.0,
    "useful": 1,
    "funny": 0,
    "cool": 0,
    "text": "It's rare for me to grant ANY starbucks a 5 star rating - but this is for SERVICE, SERVICE, SERVICE.  Isiah and David? was on point and greeted my like an old friend.  The other customers were all so friendly - it felt like a neighborhood coffee shop and not like a chain-Starbucks at all!\n\nMy drink (a basic latte) was perfectly fine, but the chit-chat made my day.\nIt made me realize how comparatively unfriendly my \"regular\" Starbucks (in Media) is.  And I am at that location several times per week!\n\nWish this was my defaut bux.\n\nShout out to Isiah and team for the beauty tips!  Ya'll rock some serious balayage!",
    "date": "2016-03-17 13:10:28"
  },
  {
    "review_id": "zRPeScrjIKGAMUu_prMjvw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "ZyNVYgJ-SB5TLva5HydmGA",
    "stars": 5.0,
    "useful": 4,
    "funny": 1,
    "cool": 2,
    "text": "Lunch for 23 for my parent's 50th wedding anniversary (They just love this place - and especially Matt and Linda) was a terrific and memorable occasion.  We are so thankful to everyone here who cooked, prepped, served and cleaned up after us.\n\nEspecially delicious were the petit filet mignon and chicken zinfandel pasta entrees (which we have enjoyed before and are so happy to see they are still on the menu).\n\nChicken Sante Fe soup was tasty as well as crisp fresh beet and garden salads.\n\nThey even helped us cut and plate the 50th anniversary cakes.\n\nTHANK YOU SO MUCH!!!!",
    "date": "2016-08-15 15:10:33"
  },
  {
    "review_id": "MiDkCpmwPjx1JwyRKoIICw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "4UDm69SbXGjjlbVVy3GNcQ",
    "stars": 5.0,
    "useful": 12,
    "funny": 4,
    "cool": 6,
    "text": "Sally and Ronnie were our servers again and they KNOW what they are doing.\n\nWe had exemplary services and top tier food and beverage from the moment we walked in and enjoyed beverages at the bar (Frose all day! Plus pints of Guiness for the dudes) to the time we were seated in the main dining room. \n\nSeafood Wedge is delightfully simple and well executed.\nDo not miss the perfectly tender seared scallops.  WOW!\n\nMy friend was celebrating a special birthday (30 again??) so they brought out a dish of white chocolate house-made (and so thick and rich) ice cream with \"Happy Birthday\" written on the plate in chocolate. \nAn elegant touch and a surprise for the birthday boy.\n\nI highly recommend Blue Bell Inn for any special occasion, corporate dinner or fancy date night.",
    "date": "2018-08-24 00:32:17"
  },
  {
    "review_id": "IasHpcylkC-Shl0cJban-w",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "pq7CAQGsxjaFcMLmhdbbvA",
    "stars": 5.0,
    "useful": 4,
    "funny": 2,
    "cool": 2,
    "text": "I happen to love this location of Starbucks - the people who run it make the difference.\nThere are usually several people sitting at the barstools chatting with the barristas.  It's alot of fun and makes dropping $4.72 on an iced tea or coffee that much easier.",
    "date": "2016-08-23 11:22:57"
  },
  {
    "review_id": "pCbGlHpjy5jNkBfgE0pgyQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "t6cQfzYnoJDWkYT60MENoA",
    "stars": 5.0,
    "useful": 7,
    "funny": 2,
    "cool": 8,
    "text": "OMG - this is the real deal, Jewish (not Kosher - you can get meat and dairy here) style deli including lox, knish, blitzes, great latkes, and thinly sliced amazingly lean corned beef.\n\nSooooooo good.\n\nDon't miss that Matzoh ball soup - I got mine with noodles added.\nThe hit of dill in that broth is just like Bubbe's.\n\nService was great (COVID complaint), too.\n\nCan't wait to come here again.\n\nP.S.  I got 1/2 a lb of Nova Lox and 1/4 lb of sliced corned beef to go - the Lox was silky, fresh, thinly sliced and decadent (ACME from Brooklyn).  So. Darn Good.\n\nI am loving this place.",
    "date": "2020-08-02 20:56:03"
  },
  {
    "review_id": "baz__4lLQ-vqADV5o5_JoQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "zQ_niKFi-9Aq2g3KJvot1A",
    "stars": 5.0,
    "useful": 6,
    "funny": 3,
    "cool": 2,
    "text": "OMG - what have I been waiting for?\nThis place is amazing.\nThe 1/2 rack platter (2 sides and 2 slices of white bread) is $16 and huge.\nCan't wait to try the brisket and chicken.\n\nGo early - they do sell out.\n\nMy office-mates adore the burnt ends.  (They sell out quicker).\nTerrific!!!",
    "date": "2016-07-21 17:44:45"
  },
  {
    "review_id": "GyibydD34zkb_GiavgrcwA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "xx9I1GjxXurHDK26Q7LL4w",
    "stars": 5.0,
    "useful": 7,
    "funny": 0,
    "cool": 1,
    "text": "Fantastic!  I love and support REAL Butchers whenever possible as they are a dying breed and we NEED them.  Steaks?  (T-Bones for 9.99 per lb, Ribeyes for 13.99 perlb) Chicken?  Lamb?  Veal?  Sausages?  Even Dog Food (scraps??)!\n\nLove this place and can't wait to become more of a regular.",
    "date": "2017-06-02 22:25:22"
  },
  {
    "review_id": "kxeaI1XFFzrqNH1vG5Zt9A",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "oXw9R3-fdgAzv0K6d35lkA",
    "stars": 5.0,
    "useful": 15,
    "funny": 7,
    "cool": 10,
    "text": "Wow! Blown away by the quality, variety and freshness of my sashimi lunch special at Qu.  $14 plus tax and tip was money well spent, and served by the delightful Miss Yvonne. \n\nThis place is brand-new, so new that the liquor license isn't even here yet (Gotta love those PA \"blue laws\")!\n\nNevermind, this place is gonna catch on fast.  I only hope that they maintain this level of opening-month quality. Everyone is clearly on their best behavior.\n\nKeep it up, guys!\nI'll be back and I'll be watching.",
    "date": "2020-01-13 17:38:45"
  },
  {
    "review_id": "PjjZBWnMNz_S4Ke1DFo67w",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "uKK_8fcwaV5JuCv3Nj-OIw",
    "stars": 5.0,
    "useful": 2,
    "funny": 0,
    "cool": 2,
    "text": "Yum!  What a great idea.  Wish I had thought of it.\nJules has terrific gourmet-topped, thin crust pies.\nI love the pie with Artichoke hearts, arugula and chopped fresh tomatoes.\n\nThey offer gluten free alternatives and its a SUPERB place for families with small children.\n\nMy only complaint?  No \"white\" milk - only chocolate.",
    "date": "2008-08-18 13:44:32"
  },
  {
    "review_id": "iEtmKSHr-WPrq_F1DOMsKQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "AaTpjyw-EiODgi3tR4Xr-g",
    "stars": 5.0,
    "useful": 6,
    "funny": 0,
    "cool": 6,
    "text": "Had a 5 star experience tonight dining out with a gal-pal.\nWe started off with delectable cocktails - I had a classic mojito with a few pieces of fresh pineapple muddled in.  Delicious and refreshing.  She had a purple concoction garnished with an orchid.  It had Chambord and Vanilla Vodka and other things in it.  So good!\n\nWe shared nearly everything.  The Horiatiki Salad was terrific (Though $15 for a plate of mostly tomatoes in olive oil and lemon juice is a bit steep.)  The trio of dips and spanakopita (which seemed a bit borekish) were great.  Entrees of Moussaka and (again? ) Dorado (Because it's cheap - they offer Dorado aka Mahi-Mahi as a fish du jour often.) were tasty and filling.\n\nDessert and tasty La Colombe coffee rounded out a teriffic meal.\nKanella (Cypriot, not Greek)  is still my fave - but the service from Mark, a prime window-side table and a groovy mood (Thanks, Bacardi!) made this a 5 star Etsia night for me.",
    "date": "2012-05-12 01:51:43"
  },
  {
    "review_id": "ty3dzm_WOJ_PpdijRux0hg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "ehD-O_CRf7LYvoMIajh71w",
    "stars": 5.0,
    "useful": 3,
    "funny": 0,
    "cool": 4,
    "text": "We come in about once a month - this last time for wings & pizza for me and my 10 year old and her 10 year old friend.  The owner is terrific and treats us so nicely.  Kids love the cane-sugar-based sodas (Watermelon and Huckleberry).\n\nPizza is quite good here.\n\nA great value, too.\n\nThey also cater many meals for our elementary school and the teachers love the food.",
    "date": "2015-03-05 16:26:31"
  },
  {
    "review_id": "SKWV_Jubwfdy2QJeEoxnPQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "k0AAZuFNZbwgawbhCRe6AA",
    "stars": 5.0,
    "useful": 5,
    "funny": 2,
    "cool": 4,
    "text": "This brand-spankin' new Chick Fil-A (on a busy corner of Route 1 & Pennell Road (452) has a double drive-thru, a play room and GREAT customer service.\n\nSo far we love it for our 7 year old who can play and eat (And we usually get out of there for around $20 for the 3 of us).\n\nNot the healthiest choice - but the side salad (skip the cheese, croutons, sunflower seeds and dressing) is good - and we enjoy the occaisional fried chicken sammy with diet lemonade.\n\nThere is also a Chick Fil A inside the (nearly dead) Granite Run Mall.  This is not it.  This is the NEW Chick Fil near the CVS.  They also do fundraisers for schools and community groups.  (I'll definitely be looking into this!)\n\nStop by!",
    "date": "2012-07-18 13:20:12"
  },
  {
    "review_id": "3kMIXMtMeXhBCgaVIJAK9g",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "k0AAZuFNZbwgawbhCRe6AA",
    "stars": 5.0,
    "useful": 1,
    "funny": 1,
    "cool": 4,
    "text": "Chick-Fil-A Lima has sponsored 2 school fundraising events now for my child's elementary school.  They do a thing where on a certain day during certain hours (for us it was a Tuesday night from 5 - 7:30 PM) for everyone who mentions XYZ school they give the school 15% of the sales.\n\nWe packed the place with hundreds of families and it was a win-win for all involved.\n\nThe kids loved seeing some of the faculty and staff running the counter (and the principal bussing tables!) and the restaurant (and school) makes money.\n\nGreat job, Chick-Fil-A!",
    "date": "2015-12-11 18:43:09"
  },
  {
    "review_id": "WgypS-iazn-_y0aKtDaZtw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "n5Fdf9RzooS7obq0NecOWw",
    "stars": 5.0,
    "useful": 3,
    "funny": 2,
    "cool": 2,
    "text": "Thank god they are here!  Philadelphia is a holistic wasteland (or should I say \"waist-land - people here are FAT!) and we veggie types need places like this.\n\nI gotta have my grass - wheat or otherwise.\nI also get mixed green veggies (no carrot- they charge me more but I don't care - I want it GREEN!).\n\nI need them and they have a reliable fresh product.\n\nGotta have my juice!",
    "date": "2008-07-16 16:54:02"
  },
  {
    "review_id": "8qpT8tEE32JBdciW_PY4fw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "exUsUJKliGHq_pjdHyc_zA",
    "stars": 5.0,
    "useful": 3,
    "funny": 2,
    "cool": 3,
    "text": "Fantastic experience today - on a Monday at lunch.\nGot some hot (prepared) foods and a pack of Genji Sushi for a quick take-out lunch.\n\nPricey (over $20) but worth it.\nGot in & out fast and ate well instead of pre-processed junk from the office.",
    "date": "2014-06-23 16:56:38"
  },
  {
    "review_id": "P5O0wECQuG7aA0JkZ932QA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "ehD-O_CRf7LYvoMIajh71w",
    "stars": 5.0,
    "useful": 2,
    "funny": 0,
    "cool": 1,
    "text": "The owners of the Wayside Market (and their 10 (yes, ten) children and staff are amazing people.  Great food - and a few staples like milk and drinks - plus a deli counter - oh and they make pizzas and calzones. And wings!\n\nCatering - great.\nEat-in area - so cute.\n\nA very pleasant place and terrific customer service.\nFamily friendly, too.",
    "date": "2013-03-15 12:13:16"
  },
  {
    "review_id": "HON5PyYc9XfUoQu4Ndpo3w",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "n5Fdf9RzooS7obq0NecOWw",
    "stars": 5.0,
    "useful": 1,
    "funny": 0,
    "cool": 1,
    "text": "Yay!  Hooray!\nI got green juice today (paid extra for it though)!\n\nI got a medium (16 oz) juice of Kale, Celery, Cucumber, Lemon, Green Apple and a bit of ginger for like $7 or so.  Plus I got wheatgrass on the side (2.95).\n\nTen bucks for juice.  Oy vey!\nBut my body is so thanking me.",
    "date": "2011-12-28 20:54:44"
  },
  {
    "review_id": "UpCD2j8q8ezRdqogGOZciQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "Og1HekJMHKqsvtWaUp9V8g",
    "stars": 5.0,
    "useful": 9,
    "funny": 4,
    "cool": 7,
    "text": "I have known rebecca Michaels since she got her start as a pastry artist in NYC - and I knew her ex husband, too.\n\nHow wonderful that we both relocated to Philly just a few months apart.  Her Vermont Cheddar Apple Cake was served way back when at my party on the Upper East side - and now I can just walk over to RTM (Reading Terminal Market) for a blondie or a cupcake whenever I want.  (Diet permitting.)\n\nI wish Rebecca and Flying Monkey all the success in the world!\n\nKeep on baking, ladies (and gent.).\n\nOh - she used to make great chocolate truffles, too.  Don't know if they are offered these days.\n\nDon't miss the specialty cupcakes.  WOW!!!  She gives Buttercup and Magnolia (bakeshops in NYC) a run for their money.\n\nGo, Monkey, go!!!!",
    "date": "2008-07-17 18:54:42"
  },
  {
    "review_id": "1MBjO5sAkwsZDgnAsDux7g",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "E4OS_VH-ru2oER7W1Gk8rg",
    "stars": 5.0,
    "useful": 9,
    "funny": 2,
    "cool": 5,
    "text": "Tim and Bob at the bar gave my friend and I top-tier service during Thursday night happy hour - and happy, indeed, we were.\n\nThe $7 wedge salad was so good we ordered 3 of them between us.\nBurrata (also $7) was rich and served with what appeared to be a whole tomato.  Once cut open, the tomato had been cored and stuffed with a delicious pesto.  Interesting presentation.\n\nThe tuna tartar is still on the bar menu ($10) but has been re-vamped and is better than ever.\n\nDrinks are just $5 for the delicious sweet-tea-like Daly Pear and the always tasty William B. Pitt Mule (A Szuszhed-up Moscow Mule with Cinnamon and other spices) were terrific.  \n\nCan't wait to come back.\nThe decor and great, great music (pop, rock, classic and hits) make this place just about \"As good as it gets\".",
    "date": "2019-05-17 14:09:50"
  },
  {
    "review_id": "1Dzq5ToKxrShzlgKNUF1Dg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "ziZpCDdVy-896ZIbAjxLEQ",
    "stars": 5.0,
    "useful": 8,
    "funny": 2,
    "cool": 5,
    "text": "My sister in law (and her mom) get their T-giving turkeys here (and Easter and any time the need a turkey) here.  How they raise a 22 lb bird without growth hormones is beyond me - but that was a big and tasty bird!  (Not dry or tough or stringy at all).\n\nDelicious!",
    "date": "2012-11-23 12:45:11"
  },
  {
    "review_id": "eyYfcCmhkazxgtfVwdR5YQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "ramBBnf8_ZAZ16aUnSUMJg",
    "stars": 5.0,
    "useful": 8,
    "funny": 1,
    "cool": 4,
    "text": "My 11 year old dim sum loving daughter and I enjoyed an inexpensive and satisfying lunch at Tom's.  We were treated well and even though they do not yet have Moon Cake (nor egg tarts, nor Bubble tea - please consider serving Bubble Tea!), we ate to our hearts content.\n\nThe mammoth triple steamed bao ($1.95) is big enough to share and stuffed with mustard greens, eggs and shrimp paste.  (Next time we'll try the meat bun).\n\nFor dim sum we had the superb Shanghai Pork Soup Dumplings.  #Bliss.\nThe har gao (crystal shrimp dumplings) were tasty (kiddo's fave) but my favorite were the pan fried beef dumplings.  Wow.\n\nI am sold and can't wait to return.  Next time we shall try the scallion pancake and 2 kinds of Shu Mai.\n\nNever met a dumpling I didn't like - but these are terrific.\nChinatown (a cleaner, more yuppified version) has come to \"downtown\" Media!\n\nUpdate:  We went again on 8/15 and who did we see working there?  SABRINA!  We love her.  She introduced us to the fabulous sweet potato cake for dessert.  We also tried the Shanghai Shumai (very good), more har gao (LOVE THEM) and an order of the pork & chive dumplings.   One of the best bites?  The cold, marinated sliced pork.  Soooooo good.",
    "date": "2016-08-10 11:42:46"
  },
  {
    "review_id": "4fS-ZLgLZ-_4fn3epzZetg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "E4OS_VH-ru2oER7W1Gk8rg",
    "stars": 5.0,
    "useful": 8,
    "funny": 1,
    "cool": 6,
    "text": "Hosted a \"Ladies Night\" Happy hour with 6 of my friends.  Service from Allan was terrific and the drinks ($5 specialty cocktails and wines) and food (mostly we got small plates) was very good.\n\nA great choice for a fun night out.",
    "date": "2019-01-31 11:57:38"
  },
  {
    "review_id": "pn2G4V2URv9D2V0a0wKGjA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "ramBBnf8_ZAZ16aUnSUMJg",
    "stars": 5.0,
    "useful": 11,
    "funny": 3,
    "cool": 8,
    "text": "It's 2021 and boy, how the world has changed.\nMy kid is 16 - and a vegan\n\nBut We still enjoy Tom's Dim Sum (Delicious steamed broccoli, vegetable dumplings)\n\nI am not a vegan so I get Har Gao (Crystal Shrimp Dumplings) and dip them into the delicious sweet soy/vinegar sauce.  So satisfying.\n\nLove it here.",
    "date": "2021-05-26 20:04:21"
  },
  {
    "review_id": "Pst1v9ZJz_j-l0j3uaitmg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "ramBBnf8_ZAZ16aUnSUMJg",
    "stars": 5.0,
    "useful": 13,
    "funny": 1,
    "cool": 6,
    "text": "My 13 year old still adores the Shrimp (Har Gao) Dumplings, Soup Dumplings, Meat Bun (big and fluffy and $1.75) and Shanghai-style Shiu Mai at Tom's.\n\nAlso faves include the cold, marinated roast pork (Chinese Salumeria at its finest), and believe it or not excellent Chicken & Broccoli and Pork Fried Rice. If you LOVE garlic - try the thinly sliced roast roast with garlic (appetizer).  So tasty!\n\nWe just love it here - and lunch for 2 is never more than $30/$35.",
    "date": "2018-08-03 00:20:14"
  },
  {
    "review_id": "M7umtYoDMPNUwzv-cJmyUw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "h_rcMQtglIiAs-Oc5d8Ozw",
    "stars": 5.0,
    "useful": 0,
    "funny": 0,
    "cool": 0,
    "text": "Old City and Passero's have some of the BEST coffee drinks in Philly.\nI had a delicious Cafe au lait here for under $3.00.\n\nRemember - \"Friends don't let Friends drink Charbucks!\"",
    "date": "2013-06-06 21:58:22"
  },
  {
    "review_id": "AfTtD6Ly7i0ThqS2CwJAVA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "prZjGYZFtZ05e80cSEYyjg",
    "stars": 5.0,
    "useful": 5,
    "funny": 1,
    "cool": 5,
    "text": "Had an amazing experience - and impeccable service from Michael - at White Dog for an Early (5 PM) Friday night.\n\nThe seafood platter for two is expensive but amazing.  4 oysters, 4 perfect shrimp, Tuna Tartar ($16 on its own for a larger serving) (delicious) and delectable lump lumps of crabmeat.\n\nThe famous mushroom soup is a rich treat.\nTry the Cauliflower with parmesan, too.\nCrab rolls (like a lobster roll) were sweetened with honey (odd but great) ad served on a hot dog bun.  (Decidedly un-white-dog).  $18.\n\nA strawberry bellini ($10) was so good I could have downed 3 of them.\nThe cheese plate for dessert ($16 for 3 selections) was terrific, too.  Try the red leaf goat cheese.  Quince, Honey, Apples. Dried Cherries and MARCONA Almonds, baby!\n\nI am in my happy place.",
    "date": "2017-04-01 22:48:30"
  },
  {
    "review_id": "_Md7WMKzvMPr6g2dxVy4vw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "-KWel73upKHxstRCr9JGLw",
    "stars": 5.0,
    "useful": 2,
    "funny": 1,
    "cool": 2,
    "text": "I give Smoke's 5 stars for one reason.\n\nKenn Kweder.\n\nYes.  I love this man.\nReally.  But not in a sick, stalker, psycho kinda way.\n\nAnyhow I spent many a late night in the early nineties watching Kenn and drinking watered down gin & tonics and eating greasy chicken wings.  Back then you could even SMOKE inside Smokes.\n\nAh the good old days.\n\nJammed with Penn Kids - but the nostalgia factor runs high for me here.",
    "date": "2008-10-18 22:34:35"
  },
  {
    "review_id": "Hud_jDah_L05f7xiyWPrXw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "v1msvs2bf_LwGUnIcCgSEg",
    "stars": 5.0,
    "useful": 6,
    "funny": 0,
    "cool": 7,
    "text": "I am giving K of T a 5 stars - mostly for the following LARGE party event I am going to describe.  In reality this is a 4 star place, but the way our group of 31 people (20 of which were children ages 2-7) was treated deserves kudos.\n\nKumar and Mohammed helped me to plan and execute a large Indian dinner for my 5 yesar old's Pre-K class, their parents and siblings.\n\nOrinigally we planned on 12 -15 guests and each family would simply order what they wished and pay for their share.  Well plans changed..  and the guest list ballooned to 20, then 24, then 27 and finally 31.\n\nWe decide to go to a set menu - and people got to choose from 5 entrees including Chicken Tikka (plain for the kids or Masala), Lamb Korma, Shrimp Shag, Malai Kofta (for our vegetarian friends) or 3 kinds of Biryani.\n\nAppetizers were great and included a smooth Muligatawny (Lentil) soup, Crispy Samosas (yum!) and Chana Chat - chikpeas in a tamarind sauce.\n\nThe kids plowed their way through 18 Lassi in Mango, Strawberry and Pomegranite.\n\nWe had our tables arranged in a large \"U\" shape for lots of interaction.\nI only pity the other diners that night (a few tables on a Wednesday night) who witnessed the chaos.  Those kids had a BLAST.\n\nThe servers and kitchen worked hard - and in the end the dinner was enjoyed very much.  Plus we introduced a whole group of young children to many new foods - including the yummy breads (which the loved) naan, paratha and poori.\n\nIt's not on the menu by itself - but ask them to make you a poori - it's (fattening and) delicious.\n\nOh - and those who stayed for dessert (many left early for bedtime) enjoyed Mango and Pistachio kulfi.\n\nTHANK YOU to the staff of King of Tandoor.",
    "date": "2010-04-08 13:15:37"
  },
  {
    "review_id": "24nzJgp5Yzo71jv8zWT8yA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "2CDI713ATuxHfnB5b-sBdw",
    "stars": 5.0,
    "useful": 1,
    "funny": 0,
    "cool": 2,
    "text": "I am dithering between 4 & 5 stars - because we did have 2 dishes that were NOT 5 star - but the decor, service and most of the food was great.\n\nThe wood floors, wall paper and paint are just stunning - and OH, that gorgeous bar!\n\nWe arrived early and sat at the bar - so we were able to order off of the Happy Hour Menu, Dirt List and Dinner Menus.\n\nThe 2 female bartenders were great and the vast array of home-made biters boggles the mind.  Drinks do contain bitters - so I asked for mine light on the bitters and that was a good thing for me.\n\nThe highlights of the menu were the corn with aioli (so sweet and fresh), golden beet/avodaco terrine-like salad with cucumber dill sauce and rye bread (a Horizon's holdover and fave) and the in-season heirloom tomato (at least 3 varieties on the plate) and mushroom salad over a thick green-goddess puree.\n\nI am loving it here and can't wait to return.\n\nThere were at least 3 desserts we wanted to try (can't believe some of these are vegan).  Pot de Creme? But alas - we were just too full.\n\nSee you again, soon, Vedge!",
    "date": "2012-08-10 00:53:42"
  },
  {
    "review_id": "EPVQKW15bnDuXV2N63aKLA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "zp9OcdUq2CWtQuI9FFBOQQ",
    "stars": 5.0,
    "useful": 2,
    "funny": 0,
    "cool": 1,
    "text": "This place is getting better and better - faster checkouts, they take credit/debit/food stamps (and cash).\n\nBe a little cautious of the very cheap aisle (on the left) - it's \"Eat now or forever hold your peace\" but i saw a lady with a big bag of Donut peaches for $2.73 (89 cents a pound!).\n\nToday I scored some pluots, nectarines, cherries, baby bell peppers, BIG spotless white mushrooms and a bunch of leeks.\n\nI also ran into an old friends.  5 stars at RTM and IOVINE's today.",
    "date": "2011-08-19 14:27:21"
  },
  {
    "review_id": "ZBsAMT7_uKhOIFXdK-BbGg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "gkrDiCU_sRZKwuBlhEzv6A",
    "stars": 5.0,
    "useful": 3,
    "funny": 0,
    "cool": 2,
    "text": "I haven't been to Shiroi in a very long time - their other restaurant Doma is closer to home and is now our go-to place - but Shiroi never disappoints me.\n\nWe are even planning a big party here in April.\n\nLove the spicy tuna hand roll here, house-made tamago, ohitashi.\n\nSublime!  Fresh and yummy.",
    "date": "2011-11-30 00:32:58"
  },
  {
    "review_id": "KJRoDsKSGpHaWqmYFulMag",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "2XPyI5NvKVfimlQJjLE4OQ",
    "stars": 5.0,
    "useful": 12,
    "funny": 4,
    "cool": 8,
    "text": "Love coming here for all my Italian Market needs without schlepping to Souffilly.  Correpolese Tomato Pie on the weekends, good Parm, prepared foods, San Marzano Tomatoes, Eggs, Milk and Bread.\n\nLove it here.",
    "date": "2018-10-04 17:18:41"
  },
  {
    "review_id": "pit0NQzq_TcrlVgIjW4azg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "zp9OcdUq2CWtQuI9FFBOQQ",
    "stars": 5.0,
    "useful": 2,
    "funny": 0,
    "cool": 1,
    "text": "Stop here and at Ok Lee  (as aforementioned) to nab the freshest produce and a few bargains that must be consumed quickly.\n\nFresh berries and citurs are cheaper here than the grocery stores.\nA large variety of greens and apples as well.\n\nA great place for the home cook to buy whatever is needed.\nGotta love it!",
    "date": "2008-08-08 13:15:51"
  },
  {
    "review_id": "fgdvqwSKOkKlE1yjmd7NlQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "jauOvHru-4OrA1lJ0JLLSA",
    "stars": 5.0,
    "useful": 8,
    "funny": 1,
    "cool": 3,
    "text": "OMG. This is truly \"as good as it gets\" for a Qdoba.  They have a Bar! A BAR!!!!!! In a Qdoba.  I can't believe it!  And Kelly the bar tender is fantastic.  Love her.\n\nThe house margarita  (regularly 4.50) is just $2.50 during Happy Hour.  Plus free chips and salsa or queso???  OMG run here!!!  Before they come to their senses.\n\nI am so shocked, surprised and PLEASED.   Puts the shitty Springfield Qdoba to SHAME!   Wow.",
    "date": "2017-07-26 22:19:49"
  },
  {
    "review_id": "RTEQQGNQcQpIw_eiN2slSA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "gkrDiCU_sRZKwuBlhEzv6A",
    "stars": 5.0,
    "useful": 5,
    "funny": 0,
    "cool": 3,
    "text": "This is my favorite sushi spot in Philly.  And I have been to Morimoto (twice), Raw, Fuji Mountain, Mizu and many, many others.  Shiroi is not a \"show place\" but it serves very fresh product with a wide variety of fish.  The kitchen entrees are well prepared and there are some great values to be had.  The Tuna Lover's platter and Vegetarian Special (a bento box) never disappoint.  I enjoy eating here and have many times and intend to come back many more times.",
    "date": "2008-05-29 15:20:35"
  },
  {
    "review_id": "XC8STC4E2FXf9sDhIDET4w",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "ytynqOUb3hjKeJfRj5Tshw",
    "stars": 5.0,
    "useful": 8,
    "funny": 2,
    "cool": 3,
    "text": "You gotta love this place.  The unique selection, the Amish, VietNamese, Asian, Italian and American stands all crammed in together.  Sure it's a bit grimey and can get mobbed at lunchtime, but give me Iovine's Produce, Och's Chicken Breasts, Some Tom Kha Gai from Little Thai Market and a hot fresh macadamia nut cookie from 4th St and I am good to go.\n\nIt is a blessing to live nearby.",
    "date": "2008-08-24 16:25:13"
  },
  {
    "review_id": "4eVmjLm4SG1gZZNQ2Ah6MA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "2XPyI5NvKVfimlQJjLE4OQ",
    "stars": 5.0,
    "useful": 11,
    "funny": 2,
    "cool": 5,
    "text": "Such wonderful foods - freshly grated Parmegiano Reggiao, fried eggplant slices, deli meats and cheese, long hots, pastas.\n\nSo great.\n\nThey also stock Corropolese tomato pies!\n\nLove it so much.",
    "date": "2019-10-25 20:00:10"
  },
  {
    "review_id": "aQcISMr_z3zy3c2cvKTuRw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "gkrDiCU_sRZKwuBlhEzv6A",
    "stars": 5.0,
    "useful": 5,
    "funny": 0,
    "cool": 2,
    "text": "Shiroi - how I've missed you.\nThe sushi chef who knows me \"by face\".\nThe older waitress who brings me genmaicha.\n\nThe incredibly fresh sashimi.\n\nI miss it here so much!  I stop in whenever I can - which is about once a year now.",
    "date": "2012-12-19 18:52:50"
  },
  {
    "review_id": "THm4YUi7AJS3gWLyIiTMcg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "gkrDiCU_sRZKwuBlhEzv6A",
    "stars": 5.0,
    "useful": 12,
    "funny": 3,
    "cool": 7,
    "text": "Omg! Came back to Shiroi after nearly 7 years and they treated us like celebrities.  The tuna lovers plate ($42, includes 2 pieces of chu-toro), naked tuna on crispy rice, oshi-tashi with bonito and succulent salmon tartar were all sheer perfection.\n\nSwimmingly fresh.\n\nFabulous service, nothing \"shi-shi\" or hipster or fancy, just amazingly good sashimi, nigiri and maki.\n\nWe love you and sister-restaurant Doma, too.\n\nRun, don't walk, to Shiroi Hana today!",
    "date": "2019-12-19 01:51:10"
  },
  {
    "review_id": "_d1LVlJUiYteROVFQAPejg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "k3hVg9relQGqqzqz9e4NrA",
    "stars": 5.0,
    "useful": 8,
    "funny": 2,
    "cool": 8,
    "text": "Brand-new, super clean and well-run (double-lane drive thru) Taco Bell.\nThey ripped down the ancient Burger King and now this Taco Bell is hoppin'.\n\nI don't eat this food but my 16 year old likes it so about once per week (less if I had my way) I let her get it.\n\nClarice at the cashier window (They have 2 windows - you pay at the first and pick up food at the 2nd) was friendly and fast.",
    "date": "2021-03-15 21:56:34"
  }
]