[
  {
    "review_id": "E4cnkvkd9PlQHNra4_FO8Q",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "OEzYP44ER97a1hi4LgR6bA",
    "stars": 1.0,
    "useful": 5,
    "funny": 2,
    "cool": 0,
    "text": "Nope.\nAfter I wrote my last (negative) review of my once-loved Qdoba, we went again.\nI needed a catering size Pico and a catering size Guac and chips.\n\nEvery time I do this (and I have now done it 3 times) I get charged a different price.\nThis time the manager (who was running the register also) tried to charged me $8 for a catering size bag of chips (enormous) which is not what I wanted or needed.\n\nI forked over the $10, took my guac, pico and chips and left.\n\nNot happy.\n\nTwice in a row now.\n\nNot coming back.\nSo sad. My 12 year old loves it here and I used to like it, too, but no longer.",
    "date": "2017-07-03 12:21:31"
  },
  {
    "review_id": "wmJBnUv_fIp47ZifKv8sjg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "OEzYP44ER97a1hi4LgR6bA",
    "stars": 1.0,
    "useful": 5,
    "funny": 2,
    "cool": 1,
    "text": "Do not get the \"new\" Shrimp!  Ick!!!\n\nWe came in at a time when almost every item on the hot bar was running low.  I tried the Surf & Turf bowl for the first time the the shrimp were old and rubbery.  There was hardly any steak left so the lady scraped out the \"required\" amount of dried out beef cubes.  The black beans were also old but then they brought more and she plopped a scoop of \"new\" beans over the dried out old ones.  I thought about asking her to re-make the dish but did not.  I should have!  \n\nAwful!!!!  \nWaste of $8.40 plus tax.  Cold items (Salsa, etc. were fine).\n\nSo sad because I often really enjoy Qdoba - for those fast food times in my life.",
    "date": "2017-06-16 11:24:27"
  },
  {
    "review_id": "lIHNluuf9V9-4qJgD3UUOg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "UBj0aJ6FfMR4tdvRbQ3KSA",
    "stars": 1.0,
    "useful": 5,
    "funny": 2,
    "cool": 2,
    "text": "ZERO Stars for what we referred to as McDEATH when i was a grad student at Penn.  There have been shootings, stabbiong, roberroes and muggings here over the many years.\n\nYet somehow - McDeath remains open.\n\nLet's not even talk about the \"hood\" demographic servers and patrons alike.\n\nAnd of course the scads of loiterers and homeless, down & out West Philly types.\n\nAVOID.  AVOID.",
    "date": "2009-01-02 14:41:27"
  },
  {
    "review_id": "bP794IDxDu7DBugOtjKnHw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "xrUtLEFyxzfjflTC2nqLXQ",
    "stars": 1.0,
    "useful": 8,
    "funny": 2,
    "cool": 0,
    "text": "Epic fail.\nI should have known better after my kinda-sorta-bad experience the first time.\n\nI stopped by to pick up a toasted english muffin.\nI saw a sign for grits - $1.99.  So I ordered that too.\n\nThe lady scooped and scraped the grits from the bottom of the steam-pan and then shouted, \"Guys, we're gonna need more grits!\".\nBut she had enough for my order.\nWhen I ate it back at my office the grits were so salty I literally spit out the first bite and trashed it.\n\nMeanwhile, the english muffin was barely toasted and flabby.\n\nI called them - and they have agreed to refund my $1.99 when I stop in tomorrow - but that will be the last time I come here.\n\nSo disappointing.  Many of my colleagues come here every day and love it - but they are now 2 for 2 in the \"bad\" category with me.",
    "date": "2013-02-07 12:55:59"
  },
  {
    "review_id": "7AQgeAto2udx-pLJyn95RA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "KdQmzwomvjLiMzD4UnLzBA",
    "stars": 1.0,
    "useful": 2,
    "funny": 4,
    "cool": 0,
    "text": "You're kidding?\nBased on grungy digs alone my family (of 3) walked in and out.\n\nThis is clearly a take-out only place (a few card tables and zero atmosphere for dining in.)\n\nThe sushi case was empty.\nEmpty.\n\nThere is no way I would get sushi here.\nI am reticent to even try the Chinese food.\n\nMaybe it is, \"all that\".\nBut I was scared to even go there.",
    "date": "2012-05-23 14:57:46"
  },
  {
    "review_id": "cNHWir_WEHlS47uCDF2P3A",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "zbd07p4LWd6ty5mHA2F1cg",
    "stars": 1.0,
    "useful": 6,
    "funny": 1,
    "cool": 2,
    "text": "Dayum!  I wish I had read my old reviews.  I got the schwarma - again pre-cut meat (at lunch - 11:50 AM) and bone-dry and COLD.  So I had a salad with cold, dry meat on top and threw away most of the meat.  Just icky.\n\nI added some sauces and toppings but was told hummus is $.79 extra.  What???  And the have no baba ghannoush.\n\nThere are so many fast-casual Med spots (CaVa, Naya, Naf Naf) that I will not be returning to Zaffron.\n\nJust skip this place and eat elsewhere in the Liberty Place Food Court.\nThere is a reason their line is shorter than the others.\n\nNot happy.\nNot happy at all.",
    "date": "2020-03-02 18:45:01"
  },
  {
    "review_id": "ymlXpvmTKrBrbWf84XGVsQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "_CbuP1zG_SqkEhVlkSIM1A",
    "stars": 1.0,
    "useful": 0,
    "funny": 0,
    "cool": 0,
    "text": "Just awful.\nThe restrooms were filthy and nearly un-usable.\n\nFood was dreck.\n\nNot goin' back.",
    "date": "2013-04-06 21:03:43"
  },
  {
    "review_id": "u_qa_aujdmXJEl7OIvrmTw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "OGWTzjVTIy5Jf3ndPO1STw",
    "stars": 1.0,
    "useful": 6,
    "funny": 0,
    "cool": 1,
    "text": "I hate to give 1 star reviews unless a place truly sucks - and this place...\nOMG it's awful.  I walked in (I was meaning to go to another place nearby but they were closed) and it was so unbearably hot in there - no A/C in July and all the refrigerators and freezer units give off additional heat)  I had to walk right back out. (After taking a good look around.  Ugh.)\n\nNot goin' back either.",
    "date": "2017-07-10 15:32:58"
  },
  {
    "review_id": "HgjZGw-3nspfHNmPaRc6Lw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "4iu7fFErsz7LS298z4bk8g",
    "stars": 1.0,
    "useful": 11,
    "funny": 7,
    "cool": 1,
    "text": "Walked in and waited.\nAnd waited.\nAnd waited.\n\n12:30pm  on a Wednesday.  Busy dining room.\nNot a hostess in sight.\n\nGot a head nod from a busy waiter in the back but was unsure what it meant.\nWaited some more.\n\n\nWalked out.\n\nWTF???\n\nThis review is based on service.  I had no chance to be greeted, seated or \"eated\".\n\nSad.",
    "date": "2015-05-07 18:40:11"
  },
  {
    "review_id": "oNnfJjAuLlAQV5HCo6L5rA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "vlOI4udD95JUGlmA7a6iqA",
    "stars": 1.0,
    "useful": 6,
    "funny": 0,
    "cool": 1,
    "text": "So disappointed and a I fall for it time and time again.\nWell, this is the LAST time.\n\nI came here when Comcast Center first opened and it was more like a 3 star place.\nThis last time?  The tuna was NOT fresh, slices of fish were puny-small and thin, rice was dry and overly vinegary.\n\nJust Plain Bad.\n\nOh - and it was $11.95 (plus tax) for a 4 piece nigiri and 4 pieces of a (gross) salmon avocado roll.\n\nThat's that.\nI am through here.\n\nSook Hee's, here I come.",
    "date": "2013-01-30 18:04:39"
  },
  {
    "review_id": "RLlrY4pCM1NAXsA_1YFEfA",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "aOwuF1QcB_TO30WwAVR4Ng",
    "stars": 1.0,
    "useful": 6,
    "funny": 3,
    "cool": 1,
    "text": "I will try again - but - for now 1 star and here is why:\n\nI walked in at about 7:30/35 PM on a Tuesday night.\nI wanted dinner and a quiet place to eat and take an 8 PM conference call.\n\nWas told \"sit anywhere you want\" - so I did (looked at the salad bar on the way in and it looked just fine). An elderly couple was leaving and a few more older folks were finishing up their meals.\n\nServer was seated at another table chatting with friends and promptly came over.\nI tolder her about my 8 PM call - she said, \"Oh, we close at 8:00.\"\n\nSo I replied, \"Well, that won't work\" and walked out.\n\nWho closes a diner at 8 PM?\nDon't people in the burbs eat dinner?\nPlease consider staying open until 9 at keast.  I wonder what they do on Friday and Saturday nights??\n\nSo if you want to eat dinner here - come early.\nEven if I had ordered - what if I had not finished by 8?  Would she have kicked me out?\n\nSheesh.\n\nI have been told this diner is very good and even better than Tom Jones (up the road) but i was forced out and guess where I wound up goin'?  Tom Jones.\n\nI will be back and I hope I have better luck next time.",
    "date": "2014-05-14 12:43:10"
  },
  {
    "review_id": "gHFbpwxQc1iN66IAQhhyzw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "peeXG1Ra-DClPQv14jvKvg",
    "stars": 1.0,
    "useful": 1,
    "funny": 1,
    "cool": 0,
    "text": "So disappointed.  We bought a groupon (eversave?) that is only valid for dinner (dine-in only),  So we tried to use it the day after hurrican Irene - and Square on Square was packed so we left.\n\nFine.  No biggie.\n\nSo last night (a few months later) we go to Square on Square at 4:30 PM.  We had called earlier to ask if we'd need a reservation and the man said, \"no\".\n\nSo we show up and the place is open, but dead empty.  No staff to greet us, no nothin'.\n\nSo we call \"Hello!\"  \"Hellooooo!\".\n\nNothing. \n\nMy husband and I waited around a good 5 minutes and then left.\n\nSo disappointing.",
    "date": "2011-12-19 14:57:22"
  },
  {
    "review_id": "FxZi5KO2euTTthIp1TqmrQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "cKLrTvokOdcgoEoHOXkfYg",
    "stars": 1.0,
    "useful": 7,
    "funny": 0,
    "cool": 2,
    "text": "DELIVERY REVIEW ONLY - never ate in the restaurant.\nSuper-speedy delivery ($1.25 charge, $10 minimum) which is 5 star - but the quality, as I feared, is not superb.  Maybe I am just spoiled by Vic's and Doma.\n\nThat said I am so glad there is finally a non-pizza, non-Chinese place in the area.\nWe got a yellowtail scallion roll, yellowtail nigiri (not great), spicy crunchy salmon roll (also not so great - not terribly spicy),  TheCrazy Tuna roll was impressiv looking ($11.95)but the tuna on top was not that good either.\n\nI dunno.\n\nNot impressed, but it's not bad.\n\nNothing was spoiled - just not \"uber\" fresh.\nLady on the phone was nice, delivery guy was great.  (They said 40 minutes on a Friday night and showed up in 20.  Sweet!)\n\nUpdate:  It is the next day.  I got food poisoning from the sushi.\nYup.  I spent last night vomiting.  Not fun.\n\nNevery again.",
    "date": "2012-01-13 23:39:52"
  },
  {
    "review_id": "3emRFXnOTnTwItCQTXUjiw",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "jm_6bIhR_TuciFIk5rhR7g",
    "stars": 1.0,
    "useful": 5,
    "funny": 0,
    "cool": 0,
    "text": "I was treated so poorly here that I had to leave, which is a shame because I love a good diner and was looking forward to coming here.  I will give them another chance on a future date but I am not in a hurry.  Here's what happened:\n\nI arrived early to meet a friend at 6 PM but he was not there yet.  It was freezing cold so I went in and figured I'd relax for 15-20 minutes and have a coffee and review some paperwork.\n\n2 men were chatting up front in Italian when I arrived, and they seated the 2 elderly ladies in front of me.  Then they asked me\"How many\" and I said \"2\".  And the guy basically left.\nI asked if I could be seated and he said \"Not until your party is here\" and I said I wanted to get a coffee.\n\nHe said I could sit at the counter.\n\nThere were plenty of tables open.\n\nThe delivery of his words were what made it so rude.  It could have easily been handled better. I left and called my friend and we went elsewhere.",
    "date": "2016-01-22 12:58:55"
  },
  {
    "review_id": "CtwM1mYZYU7clMR2ul1DpQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "IEDW_nZUl1OEq9qucwViRQ",
    "stars": 1.0,
    "useful": 4,
    "funny": 1,
    "cool": 0,
    "text": "Nope.  I take it back.\nI was excited to have Chipotle as a quick lunch option.\n\nNot quick.\n\nThe line can wind around for miles - you must get here before 11:55 AM or you are stuck.\nThey then ran out of chicken and the line screeched to a halt.  Nasty attitude from the girls behind the line, too.  (Not the cashier lady - she was nice.)\n\nMy bowl of rice and veggies got cold during the wait so I literally had to walk out.\n\nI will not be back until my coworkers drag me here again.  I certainly will not come bnack on my own and not from 12 - 1 PM.  No frikkin' way.\n\nGet it together, Chipotle.",
    "date": "2016-12-05 18:00:52"
  },
  {
    "review_id": "9R3v8c9sg-xTf1M4KJRpsQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "sX3TCT-BHn8vboCYFqsHUA",
    "stars": 1.0,
    "useful": 7,
    "funny": 3,
    "cool": 1,
    "text": "Epic Fail and so incredibly scary.\nI literally walked in - was greeted by an Asian woman who was reading a newspaper and the cases had only canned and frozen product.\n\nMany cases are empty.\n\nThe place is clearly failing and there is a sign that says \"No Eating\".  So clearly, they don;t want you eating here.  take out only.\n\nDirty.\nAbandonned.\nIcky.\n\nJust. Plain. Bad.\n\nThankfully, no relation (at least not in decades) to the fabualour Lobster Claw in Doylestown.  That place rocks.\n\nThis place?  Rock-bottom.",
    "date": "2017-09-28 17:10:05"
  },
  {
    "review_id": "gMksT432p05TIQ4i9_Njbg",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "rDh6j39BYX4IL9RSZDGs2A",
    "stars": 1.0,
    "useful": 5,
    "funny": 5,
    "cool": 0,
    "text": "Fail.\nWhile the service from our young, tattooed and under-educated server was good.  Attentive and pleasant, the food is just awful.\n\nDO NOT order the Chicken Francese - a gloppy, gloopy over-sauced mess served over a bed of mushy overcooked pasta.\n\nSalad bar was just OK.\n\nBroiled Seafood platter (all frozen) was a bland JOKE and a waste of $20.\n\nNot goin' back.",
    "date": "2016-06-03 18:58:54"
  },
  {
    "review_id": "uuQaAhBBu149EMqvvxBwOQ",
    "user_id": "_BcWyKQL16ndpBdggh2kNA",
    "business_id": "wJcIX3OUTQ0DleS9JJyX9A",
    "stars": 1.0,
    "useful": 9,
    "funny": 7,
    "cool": 3,
    "text": "At the risk of the yelp-police removing my review, I feel I must say what I am about to write:\n\nWe were so looking forward to trying this place but as we walked in I could already smell rotting/dead fish, faintly,  in the vestibule.  When we opened the door I could not make it passed the hostess stand.  The smell was just. not. good.\n\nA sushi place should NOT have any sort of a fishy odor.\n\nWe walked out.\n\nMight try again but I am in no hurry.",
    "date": "2016-03-31 12:21:56"
  }
]