[
  {
    "review_id": "-k3UEkp24qjNkJ3vvrZ7QA",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "rKe7iEiqe8TVqvwZLdlhRA",
    "stars": 2.0,
    "useful": 6,
    "funny": 4,
    "cool": 3,
    "text": "The was a reason why this BK was practically empty when I stopped in for a quick breakfast the other day.  \n\nThe Biscuit for my sandwich was hard and too small to enclose its contents.  It appeared to be a tube biscuit that had been made earlier and left in the open air to dry out, and then microwaved just before sale.  It rehardened quickly and was a crumbly mess to eat.  Just not very good, despite the fact that the rest of the ingredients seemed fresh.  \n\nGiven the competition across the street, it is difficult to see how this place survives. Maybe their burgers are better, but I won't be back to find out.",
    "date": "2015-06-11 14:15:33"
  },
  {
    "review_id": "qLpNeDX4thahT5FmXoPyZA",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "0JPi9cyV9i3_kDPj049_qQ",
    "stars": 2.0,
    "useful": 4,
    "funny": 2,
    "cool": 0,
    "text": "It pains me to remember the recently completed dinner at Taco Suave.  Such high expectations after reading the other reviews.  Such auspicious beginnings. Such a sudden and disappointing finale.\n\nWe walked in to this tiny strip mall corner restaurant. About a dozen tables with white table clothes.  I was thinking that in my experience, the hole in the wall Mexican joints were always the best.  At least, that had been true in Arizona, New Mexico, Colorado and even SoCal. \n\n We sat and ordered the Agua de Pina (Pineapple Water), which was a first and a pleasant drink of diluted pineapple juice whipped to a froth.  Really good! I was getting more excited as I imagined we had just discovered the Fountain of Youth drink right here in Warrington.  Then the homemade Chips and Fresh Salsa came out. Heavy crunchy mild oily sensation with a mild Mexi flavor, and a Tomato, Cilantro Salsa with a sweetness equal to the chili's heat.  Loved it. \n\nEncouraged and feeling adventurous by the fun of the apps and drink, I went for the Pollo Dorado (Golden Fried Chicken), the most expensive item on the menu.  Visions of plump chicken breast with a wonderful fruity sauce danced in my head. My friends had a Burrito de Carne Asada, and a Taco con Queso.  \n\nWhat was placed before me was instead three over cooked deep fried drumsticks with an oil soaked brown coating that tasted primarily of salt.  My physical reaction to eating this was matched by the instantly deflated sense of gluttony so rudely assaulted and kicked to the curb.  I kept eating hoping for a secondary burst of flavor to save this.  It did not come. I passed around the chicken and the reaction was universal. Bad. \n\nThe Burrito de Carne Asada was large and full of bits of beef and cheese, but way too mild, and a bit too fatty.  It was left one third eaten.  The Taco con Queso presented well, but was practically tasteless.  We liberally added hot salsa to throw them life preservers, but we could not save them.  The dinner was a victim of drowning. \n\nWe will not be back.  I wish I had a different review to write about Taco Suave, but true to the Yelpers Creed, I cannot hide from the bitter taste of a disappointing meal.  \n\nOur server, Mirna, was great!",
    "date": "2013-03-24 02:45:09"
  },
  {
    "review_id": "QD-q8viK1mlUFvooB0PqKw",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "O6hY9yenifuRXrpc4TfgsQ",
    "stars": 2.0,
    "useful": 11,
    "funny": 4,
    "cool": 3,
    "text": "The Blue Duck is a nice place to stop for brunch or lunch if you find yourself in the vicinity.  It has a reputation for offering \"Center City\" atmosphere, with \"Northeast Philly\" earthiness.  I guess that means you don't always have to run downtown to find a cool place to eat, or conversely, that Northeast Philly now has its own duck fat fries outlet.  Can I hear a, \"Hallelujah!\"?\n\nWe stopped in for a late lunch after an appointment with Homeland Security on Drummond Road nearby.  That is never a sparkling experience, and we all wanted something to wash away the bureaucratic dust that comes with dealing with the Feds. We ordered three of their signature burgers, and the Salt & Pepper Fries for the table.  Water all around. We waited about 20 minutes for our meals to arrive, all the while smelling the grilling beef in the open kitchen.  This was a very hot day, and the HVAC was struggling to maintain the right comfort level.  Even with the front door closed, the humidity in the house was noticeable.  \n\nThe House Grind Burger, Pork Roll Burger and Beast of Northeast Burger arrived in the arms of our erstwhile server.  All looked great with Brioche-style rolls, and the individual toppings.  My Beast was a mix of Wild Boar and Beef, Smoked Gouda, Sweet Tomato Jam, Bacon and Crisp Sriracha Shoestring Onions.  Beautiful to behold.  First bite should have been awesome, but aside from the interesting flavor of the fixings, the \"Medium\" finish requested was in fact, \"Well Done.\"  With the juice gone, I could not taste the difference in the meats, and found the burger less than hoped. The same was true for the House Grind, although for some reason the Pork Roll Burger came out \"Medium Rare,\"  and amply juiced.  The S & P Fries were good; hot, but not crisp. \n\nIt is always awkward to low rank a popular restaurant, but it was what it was.  Someone needs to pay more attention at the grill, as it is likely to have happened before.  \n\nGood luck with your new Center City enterprise.",
    "date": "2016-07-17 18:27:49"
  },
  {
    "review_id": "oAoeqTIcHZ1W1oc-phb5Rw",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "fGeJIvuGAQE5sbVIbwQYXg",
    "stars": 2.0,
    "useful": 2,
    "funny": 2,
    "cool": 1,
    "text": "I am about to give up on Frozen Yogurt joints. \n\nOver the last year or more, I have not found a single one that offers a quality product that tastes as good as the equivalent ice cream.  While it is nice to save on calories (if that is really the case), tasteless extrusions just don't satisfy my need for something cold, creamy and sweet.  \n\nThis Redberry, while small and clean, offers nothing better than the others.  The Traditional Vanilla and Peanut Butter choices were indistinguishable from each other.  Only the add ons had any taste. \n\nWhat's the point?",
    "date": "2014-07-01 15:34:28"
  },
  {
    "review_id": "Tlav_gWX9OsbZvKep7u5AQ",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "yQhu3LbnB2gQgrquHZ_S6Q",
    "stars": 2.0,
    "useful": 3,
    "funny": 1,
    "cool": 1,
    "text": "For a place that specializes in one thing - salad - there is a disconnect between their mission and final product. \n\n I have eaten here a few times over the years, and while nothing I have ordered/eaten has been bad, my impression was that the bowls were thrown together by rote with excessive inattention to detail.  Often the ingredients are just dropped into the salad bowl and left unmixed or given a perfunctory stir.  Separate piles of cheese, nuts, dried fruits, etc., left where they fall.  Sometimes, one of the elements is forgotten without awareness of the shortcoming.  \n\nWhen the pleasure of this experience comes in over $10 for lunch, it is difficult to think that value has been attained.  Asking for the dressing on the side to take charge of the finish is helpful, but when it becomes necessary to insure that I am dealing with a salad and not piles of vegetables as yet unrelated to each other, I feel like I am doing their jobs. \n\nWith so many other restaurants offering healthy creative fresh salads as part of a broader menu, there seems little reason to go to a place whose sole reason for existence is doing something that is ultimately inferior to the competition.  There is something inherently contradictory in a mass produced \"custom made\" salad.  \n\nThat contradiction is manifest by what comes across the counter at Saladworks.",
    "date": "2014-01-23 15:11:11"
  },
  {
    "review_id": "5t4tq_ahRd1MiOQQHvo8Tw",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "T4Vtm5WHmH28rFjmstowPw",
    "stars": 2.0,
    "useful": 33,
    "funny": 19,
    "cool": 22,
    "text": "BREAKFAST TAKE OUT REVIEW\n\nWe had an office meeting in Norristown, PA, this morning. Our office manager took our requests for breakfast and ordered everything from nearby Pauline's Deli. There were eight of us.  I asked for a sausage, egg and cheese sandwich on toasted English muffin. \n\nWhen I arrived I sat at the conference table with an aluminum foil wrapped package before me. It was still warm. Upon opening, I quickly realized that I had a pork roll, egg and cheese on English, not what I had requested. This may not have been Pauline's doing, as I looked around and noticed my associate had a very similar sandwich, but with sausage. It was too late to make the exchange, as he was already happily half way through MY SANDWICH. For the sake of team building, I said nothing.\n\nI am not a pork roll guy. Don't care for the taste, nor the texture. Still, I suffered through it, and drowned my disappointment in the hot coffee made in our office. \n\nBetter labeling might solve this kind of mix up, and a closer examination by the consumer would certainly be a benefit. I realize that it may not be fair to say Pauline messed this up, but I really didn't care for the sandwich. Hopefully, I'll get another chance at the next breakfast session, and be able to judge what I actually wanted. \n\nYELP Suggestion - There should be a box to check for take out reviews. It isn't close to equivalent to evaluate a dining in experience with a take away bite. I quickly stop reading take out reviews as being irrelevant to the quality and enjoyability of the exact same meal eaten in these two divergent circumstances.",
    "date": "2018-04-28 15:56:12"
  },
  {
    "review_id": "sNBZ77_ZhQGC3AwzxM2S2g",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "y0pfoNQOyrb98aEIdH6cnA",
    "stars": 2.0,
    "useful": 6,
    "funny": 3,
    "cool": 2,
    "text": "As McDonald's go, this one on West Trenton Avenue in Morrisville, Pa., is in the format of a modern smaller footprint, with a drive through that wraps tightly around the building, forcing pedestrians to cross this lane of traffic. With all the young people who frequent these kid magnets, you would think they could find a safer design.  Alas, not. \n\nI stopped in the other morning when traffic heading over the Delaware was so bad I decided to find a rest stop to wait for the clogged artery that is the Calhoun Street Bridge to pass its blockage.  Mickey's was right there, so I went in.  The place was clean and a little busy. Still, my order was taken promptly.  I had to wait a while for it to be filled as the staff seemed to lack any real organization for the counter.  The six people I saw all had their backs turned to the customers, and when any one of them was free and looked around to see us there, they carried out the next step in the process.  Three different people worked on my order.  I finally realized that what I was observing was the result of the heavy drive thru business which kept everyone's attention, and left those of us inside as forgotten players in their fast food game.  Efficient, perhaps, but not given to warm face to face. \n\nMy Sausage, Egg and Cheese Biscuit was smallish, and thrown together in such a way the top of the biscuit adhered to the cheese to one side of the sandwich, leaving the rest exposed.  It was wrapped and bagged that way, and made the eating a bit awkward. I guess if this product had gone to a drive away customer, by the time it was opened, they would be too far away to do anything but grumble.  Another casualty to the dominance of drive thru culture. \n\nFor me, I was just disappointed with the lack of care in the work product, and knew that I wasn't coming back for another round of being ignored.  \n\nOh. The coffee was good.",
    "date": "2015-05-27 18:00:05"
  },
  {
    "review_id": "OBmV4iMkaNBohGT01dltiA",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "tiVQ9_qoatNn--ITbMWRpA",
    "stars": 2.0,
    "useful": 3,
    "funny": 1,
    "cool": 3,
    "text": "Not sure the last time RJ's boiled and baked the bagels in the bins, but as I am eating one less than 30 minutes after purchase @ 1:00 pm on a Sunday, it is already approaching staleness. Too flat upon observation; a tough slice with a sharp serrated knife; tough crust with no crispness; and too dense at its heart.  \nVery ordinary. \nBagel Train is far superior to my taste.",
    "date": "2013-07-07 17:57:00"
  },
  {
    "review_id": "96aEWNXifYzFV_LwzkG3Xg",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "DsWMaVazRG8qX2rVywGedw",
    "stars": 2.0,
    "useful": 25,
    "funny": 11,
    "cool": 15,
    "text": "Great Shanghai Chinese Restaurant in the Morrisville Plaza Shopping Center is another primarily take out shop that has been around for many years providing Chinese/American dishes to the neighborhood at affordable prices.  Although there are two tables in the house, the lack of heat in winter makes it obvious they don't expect (want) people to consume their products there.  So, when I ordered sesame chicken and hot/sour soup and indicated I would eat while the food was at its peak heat, they asked me twice if they understood me correctly.\n\nThey did, and pulled out a plastic orange tray to deliver the take away containers to me, along with cheap utensils.  They were kind enough to remove the staples used to close the styro lid, so that I could gain prompt access.  \n\nMy lunch was pretty much okay.  \n\nThe hot & sour soup was made without MSG, and had a good taste with ample tofu and veggies, and the right amount of vinegar.  The sesame chicken was not over breaded, and the meat could be tasted, and was not lost in the goop.  The quantity was plenty for a midday meal.  The fried rice had been made earlier, had the tint of the bouillon it had been cooked in, and had a fairly fresh texture of being prepared earlier in the day, not yesterday.  \n\nOverall, it was what was expected from this type of kitchen, and perhaps, slightly above average based on the soup and rice.  \n\nThe price/quality ratio was just about right, but having to wear a coat while eating is inhospitable, and knocks it down from average to just below.",
    "date": "2017-02-19 14:11:33"
  },
  {
    "review_id": "c0Dx03QmIih0dFhTYp-kFQ",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "p2SakAsYqdAvLqPpAhkekw",
    "stars": 2.0,
    "useful": 16,
    "funny": 9,
    "cool": 10,
    "text": "This Dunkin Donuts on Bustleton Avenue in the far Northeast Philadelphia, is about average for this species of fried round dough outlets. Small footprint, but with a corner lounge with worn out leatherette sofa and easy chair, and slate accent wall. \n\nNice touches, but it comes down to the quality of their bread and butter - their coffee and sweet dough. In this they cannot complete with the new wave of cafes, bakeries and donut specialty houses that are working harder for my dollar. In the last two weeks I have tasted far better java, and munched on way more luxurious cakes and dough fry around town and the burbs, than sampled last night. Maybe a little more money, but the difference in quality is patent. Too, they don't sweep the floor around you while sitting down to enjoy their wares. No one likes dust and dirt flying around their food. No one wants to feel swept out. \n\nDD. Too much of a no longer great thing. Becoming stale; much like day old donuts.",
    "date": "2017-01-29 15:23:16"
  },
  {
    "review_id": "8rlhl0CwD2GJ7C0yB2U_Sw",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "zk7tV01E9N_VenizNqX6yA",
    "stars": 2.0,
    "useful": 38,
    "funny": 26,
    "cool": 29,
    "text": "Crystal Diner (formerly Edgewater Queen) in Edgewater Park, NJ, is a small footprint roadside attraction on southbound Route 130. It looks recently renovated with stone and stainless fascade, and has a cozy if crowded ambiance. I sat down at the end of the counter and was immediately welcomed by a few of the staff hustling their platters and coffee pots. \n\nThe menu was a tour de force of traditional diner cuisine with several pages just for breakfast. I went with something small (I thought) before a more elaborate and expensive meal. The breakfast sandwich (sausage, egg & cheese on kaiser) seemed about right. I asked my server if they used quality rolls as opposed to the poor varieties found in some kitchens. She assured me theirs were good. \n\nThey weren't.\n\nWhat arrived minutes later was a large plate, half of which was loaded with home fried potatoes, and a transected sandwich with long toothpicks holding the two halves together. I didn't mind that they used links rather than patties, even when they began to roll out of the sandwich. No biggie. However, the kaiser was a cheap imitation of an actual bakery product. It was crushed, lifeless and tasteless. What was worse were the home fries. They lacked flavor and were dry beyond redemption. Not even salt, pepper and hot sauce could salvage them. It was obvious that the kitchen didn't have a clue and that management was likely part of the conspiracy. \n\nWhen was the last time anyone sampled their offerings to provide quality control? Not often enough. \n\nIt was a full house, so I expect I am whistling in the wind, but it is one and done for me.",
    "date": "2020-01-11 15:14:56"
  },
  {
    "review_id": "tkvYLbeEoO3MsLyc0xcY8w",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "bhh_aTVZ58cmvJqg8IaD5Q",
    "stars": 2.0,
    "useful": 32,
    "funny": 17,
    "cool": 23,
    "text": "Robert Morris, a signer of the Declaration of Independence, The Articles of Confederation and the Constitution, left his name to this old river burg, and even had his home, Summerseat, nearby. It was his plan to have the capital of the new United States established right here in Morrisville, PA. He was off target by about 25 miles, as the ultimate vote landed our first national city in Philadelphia. Still, Morris was nothing, if not ambitious for his adopted home town (He was born in England, and arrived here as a teenager). \n\nHow would he feel about having a tavern named after him?  He would probably have enjoyed the notoriety of being associated with a dive bar with smoking privileges, but lacking a kitchen for a meal, and even taps for the beer they serve. Bottles and cans only, folks. Yet, he probably would have supped and indulged his muses elsewhere, as the joint has seen better days, and is now far from its prime.  The crowd is friendly, if loud and in its cups. The suds are priced right, and the barkeeps a smiling, tolerate group. \n\nMy aluminum Bud Light (Philly Philly) edition, was $3. Hard to beat that coinage for a long cold one. \n\nStill, I couldn't escape the sensation that old Robert M., for all his wealth and colonial political power, would have only visited this establishment when he didn't want to be seen by anyone who would recognize him. It is easy to understand why.",
    "date": "2018-07-02 15:25:07"
  },
  {
    "review_id": "WndcjrZHSabjXobkJX-wIw",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "98fsEVTy5Ses0Pb03AhzFA",
    "stars": 2.0,
    "useful": 6,
    "funny": 2,
    "cool": 1,
    "text": "This Giant on West Trenton Avenue in Morrisville is the same size as its sisters in Lower Makefield and Langhorne (Newtown), and has more or less the same inventory, but it does feel more dark and dingy than those other stores.  When I shop there, the lack of adequate lighting makes it a bit oppressive to spend much time.  The absence of the smaller, modern, carts available elsewhere, makes it necessary to use the larger, older and rustier pushers that often have gimpy wheels.  \n\nWhile it wouldn't take much to upgrade this commercial space into a more pleasant facility, the company seems to have decided to leave it as it is.  Perhaps, their lease is coming to an end, or the revenue from this location does not justify the expenditure.  Regardless, aside from the convenience of stopping in here occasionally, I would avoid it and frequent the newer and easier to navigate markets just to the north for the same prices.",
    "date": "2015-12-04 16:59:19"
  },
  {
    "review_id": "um1SD4GvmmZcqS5YOBGU5A",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "utReYPKNKwb15UytLOr-Xw",
    "stars": 2.0,
    "useful": 1,
    "funny": 0,
    "cool": 0,
    "text": "Read Whitney A. from Holland review (12/2/12), which mirrors my own. \nThe staff is very friendly and fast, the price is reasonable, and the coffee decent. All good things. But, the bagels are not close to being the right texture nor taste. They could be so much better with a little tinkering.  It's not that they are bad, it's just that they miss the target of being really satisfying. \nWith so many bagelphiles adrift at the loss of Bagel Junction, Newtown Bagel could become our Shangri-la, and garner our undying devotion and business with a few adjustments.",
    "date": "2013-01-13 18:43:08"
  },
  {
    "review_id": "qPsY0DM_p-qzCdnSpER5Cg",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "C_EtrXTygRX5RTUOKtO6Dg",
    "stars": 2.0,
    "useful": 7,
    "funny": 8,
    "cool": 1,
    "text": "What Happened to the Copa brand?\n\nBack in the Day, when Copabanana was only down on South Street, I spent my Friday nights after Tai Chi classes at the Painted Bride hanging out with the motley crew at Copa, downing rip roaring 'ritas, and munching fabulous Burgers laden with Pepper Jack Cheese and sliced Jalapenos, with a basket of Spanish Flies fulfilling a post workout greasy comfort food attack, and exchanging stories of daring do.  So very Yin/Yang. I either sat at the bar, in the dining room, or upstairs in the cramped attic before it became a cooler than you microbar. \n\nCut to the recent past, and I finally had a couple of opportunities to hit this Copa on Spruce Street, just off Penn's Campus.  Looked great from the outside - loads of colors - and even suggested some happening things within. One stop at the bar for drinks and eats, and another at a small corner table, left me scratching my kep and wondering whether it was my faulty memory, or the joint's loss of verve, that left me feeling that I was in the wrong Copa.  \n\nYes.  The drinks were still stiff (one was enough for me), but the grub had fallen off a cliff.  My beloved burger memory suffered a rude awakening when I bit into what looked to be the same TexMex heat burger of ancient lore.  What had been a juicy joy had evolved into the proverbial hockey puck.  Hard from over-grilling, well done from inattention, and spiced by over-aged now gray peppers from absent quality control and pride.\n\n Not once, but on both occasions, I departed a saddened and wistful patron, yearning for the old days when a Copaburger meant joy on a bun.",
    "date": "2014-08-16 18:07:58"
  },
  {
    "review_id": "mytkknQAIr6nQYSiVqeTjw",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "hnf3X-auqHuxd56YemuSqQ",
    "stars": 2.0,
    "useful": 17,
    "funny": 4,
    "cool": 11,
    "text": "TWO SLICE SPECIAL REVIEW ONLY\n\nThe price at $4.99 for two large slices of pizza and a soft drink was excellent.  The size of the slices was also more than expected. The service was friendly.  The room was small, with only two tables for those who want to eat their pizza just out of the oven when it is at its prime. So, this is basically a take out joint. \n\nWe wanted a quick bite to tide us over until dinner. A slice apiece and sharing the drink was our intention. \n\nI requested that the reheat be \"well done,\" in order to bring the ingredients back to life after sitting on display. \n\nWhat we received were slices that were not hot in the center where the cheese was thickest. That was likely due to the excessive amount of cheese piled onto the pie, out of proportion to the tomato sauce which seemed sparingly used. The result was pizza that could not be picked up by the crust because it was too heavy on the topside.  The taste was weak because of the cheese/sauce imbalance, and perhaps the quality of the cheese and sauce themselves.  The crust would have been improved with a little salt added to the dough.  \n\nNot an impressive effort by Pizza Land.",
    "date": "2017-08-15 14:25:48"
  },
  {
    "review_id": "iS48_QIAHWOQlWxosiYJlQ",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "kQRB8RNwd7cEMcURTS-I7A",
    "stars": 2.0,
    "useful": 49,
    "funny": 33,
    "cool": 39,
    "text": "F. W. Woolworth built a retail empire at the end of the 19th into the mid twentieth centuries, out of the \"Five & Dime\" store concept. In its heyday it had over 5,000 stores on 4 continents. One of those iconic enterprises was build on Haddon Avenue in downtown Collingswood, NJ. Today, the high tintype ceiling, wood plank floored space is where Sabrina's Cafe holds court. Walking in from the rear parking lot the room feels cavernous and a real blast from the past. \n\nIt sounded that way, too. Without acoustic softening from all the cheap clothing Woolworths used to sell, the crash and clang of scraping chairs, dozens of conversations, kitchen noise and background music, made for very discordant uncomfortable ambience. If they hung tapestries rather than blackboards, and placed sound panels strategically along the ceiling, Sabrina's would be a much more pleasant restaurant to visit and hang out. As it is, regardless of food quality it is not welcoming enough to be worth a return.\n\nWhat about my breakfast last week? Well, it left a lot to be desired. My server was pleasant and efficient, but never brought the milk requested with their good coffee. She probably couldn't hear me. Their signature Challah thick cut french toast looked great, but the egg/sugar/cinnamon mix had not penetrated into the body of the slices, making it dry and tough chewing. There was sweetness baked into the bread, but even melted butter and poured syrup did not significantly reduce its lack of moisture within. I took half home thinking I might be able to salvage it in my kitchen, but by the next morning it had lost all freshness and couldn't be revived. RIP. \n\nI wonder what good old Frank Winfield Woolworth would do about this situation? It was he and his brother Charles who added the lunch counters to their successful stores and made them a new part of American culture. They would no doubt figure out how to perfect the experience and make more money doing it right.",
    "date": "2020-02-16 17:01:11"
  },
  {
    "review_id": "Y1cZ7vp5psTsF_3uMmYkxg",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "AHqYW_taqAvhBkYBElkcTQ",
    "stars": 2.0,
    "useful": 53,
    "funny": 28,
    "cool": 32,
    "text": "Although I'm sure they had something else in mind in naming this Chinese fast food establishment at the corner of Castor Avenue and Unruh Street in Northeast Philly, that \" Boom\" can signify the other side of explosive pleasurable cuisine, and be something quite the contrary. Unfortunately, that was where our experience cratered. \n\nWe stopped in for late lunch around 3 when part of the menu shifted from lunch to dinner prices. As all ordering is done online even when sitting in the restaurant, it made for some confusion in both ordering and paying. To make matters worse, there were two menus - a paper menu on the tables and a very different online ordering menu, that were not well coordinated. \n\nSo, while we wanted and thought we ordered beef soup with dumplings; what we got was just poorly crafted dumplings with thick skin and low flavor. Disappointing. Beyond that, the Vietnamese style spring rolls @$3.95 for twins, was mostly cabbage within. Double whammy!  Finally, the beef sandwich was basically a soft scallion pancake rolled up with \"meat\" inside and a squirt of hoisin sauce for sweetener. While the best of the bunch, it left alot to be desired. \n\nNo doubt this Boom Buns is primarily a takeout joint, and customers are far away when they open the bag and see what they got (BOOM!) For those of us eating in house, the sound of deflated expectations created a rumbling crash in our stomachs (BOOM)! \n\nMaybe the Xao Long Bao is the way to go here, but we'll never know, because a return visit is just not in the cards. There is too much competition in this growing Asian neighborhood for anyone to give Boom Buns a second try. \n\nDOUBLE BOOM!!",
    "date": "2021-06-10 17:27:47"
  },
  {
    "review_id": "803TWmwDnF3DKdgAeJHUWA",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "vPcfJ3rm3NpdqVDod2WxLA",
    "stars": 2.0,
    "useful": 3,
    "funny": 2,
    "cool": 2,
    "text": "Of the limited Chinese options in the Newtown area, this place is by far the worst. \nStrictly take out unless you want to sit at one of the two odd sized tables covered with newspapers. \nSeveral Guangzhou brothers operate this relocated tiny shop.  The kitchen is in full view, and it is not always pleasant to watch how the food prep is done. \nAs someone else suggested, this is a place to go only when all the alternatives are blown away by a storm.",
    "date": "2013-04-28 13:43:50"
  },
  {
    "review_id": "P84AwmX97xeS7JjrMzD0AQ",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "bL2bIVv0CFyBp-_XijGzlA",
    "stars": 2.0,
    "useful": 11,
    "funny": 3,
    "cool": 4,
    "text": "Standard Dunkin outlet, perhaps in need of some TLC to spruce it up. My evening stop for a jolt of joe and sweet round dough found  their front doors in need of hydraulic repair to keep them from crashing back behind me, and in need of a sweeping. \n\nService was fine. The coffee decent. The donuts forgettable. \n\nJust back from Southern California where independent donut shops abound. I wonder why that niche market hasn't taken off here? That competition would be great and raise the donut bar to new creative sugary heights.",
    "date": "2016-10-14 12:23:22"
  },
  {
    "review_id": "yyknsaMEK4q1NakVQ4llug",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "cQinLnaT-McXMUKRxq5_UA",
    "stars": 2.0,
    "useful": 4,
    "funny": 3,
    "cool": 3,
    "text": "Stopped in to kill both time and hunger while waiting for an order to be ready at a nearby shop. \n\nFrom the outside, it seemed to be a nice looking facility for dinner. As I drove around I noticed an older edifice behind the main building which looked like a simple pizza parlor with a soft ice cream window. I ordered a slice of their Margarita Pizza and Regular to get a sampling of both their standard and specialty pies.  The two plus a 12 oz. drink was under $6. Much less than I was used to paying farther north.  \n\nUnfortunately, the slices were overly oily and I had to let the olive juice run off onto the nice ceramic plate.  The tip of each slice folded when lifted, requiring my index finger to lift it up to get it into my mouth.  Thus, it failed my first test of a good slice - the ability to stand firm without wilting.  Next, the taste.  Aside from being very hot, the sauce and cheese were nondescript.  The bottom crust was not crisp despite the reheating, and the texture was not quite right.  The second prong of the pizza slice test was also a fail.  To compound the problem, I was not provided with utensils to use to hold and cut the slices; something required by the behavior of the soft wedges. \n\nThis area of Fairless Hills has a multitude of Tomato Pie stores.  I am surprised that Arosso's did not come close to competing with the best of them.",
    "date": "2013-10-04 22:43:53"
  },
  {
    "review_id": "bUTBNwn77VuzUmFNxdkqNw",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "FgI9soziskhOkUJdNwvqOg",
    "stars": 2.0,
    "useful": 0,
    "funny": 0,
    "cool": 1,
    "text": "As the old saying goes, \" Anything worth doing is worth overdoing.\"\nThis perfectly sums up Redberry in Village of Newtown Shopping Center.  There are many franchises out there, and all are about the same, with only slight differences in flavors, textures, and toppings.  Here, the flavors seem tamped down.  The Country Vanilla was weak, and the Pumpkin more like nutmeg and Cinnamon, than real pumpkin.  The toppings are all sugary and add too many calories to be healthy.  \nThe environment is very bright and bare bones.  No comfortable place to sit other than plastic chairs and small tables. Take out is certainly the message here. \nIt would be interesting to compare the calories here with the real ice cream places nearby.  For my taste buds, and someone who loves yogurt, Redberry is an underwhelming experience, although my young son likes it .\nAt approximately $5. per serving with toppings, it is not a cheap treat.",
    "date": "2013-01-09 17:31:41"
  },
  {
    "review_id": "hT4wMHLTZuXo9CqeiJ_FUw",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "3aPS2SIOdGNdn4-7t_cnNA",
    "stars": 2.0,
    "useful": 0,
    "funny": 0,
    "cool": 0,
    "text": "McCaffery Supermarkets recently opened another store at the site of the former Genuardis Supermarket.\nThey have upgraded it considerably, and it is a very pleasant environment for food shopping.\nHowever, the prices have gone up and they are not really competitive with the Acme in the same shopping area, nor the new Giant that replaced Clemens last year.\nI went through it a few months ago, and realized that all the things I normally purchase were more expensive there than the other two venues. \nI don't go there any longer, as any of the specialty items they carry that are not in the others markets, can be found in abundance at Whole Foods with more variety and an even nicer experience.",
    "date": "2013-01-13 02:13:19"
  },
  {
    "review_id": "bivWJCqeA9eg-UGMAQmAng",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "cLVUyO8ziIjFlRA-rFrJVA",
    "stars": 2.0,
    "useful": 8,
    "funny": 4,
    "cool": 2,
    "text": "Another boring supermarket. They are mostly indistinguishable from each other.  Only the signs out front let you know where you are. \n\nLack of real competition makes Acme a dull boy.  Same holds true for Giant and McCaffery's. They would all be empty warehouses if Trader Joe's, Whole Foods or Wegman's came to town. \n \nDon't we deserve better?",
    "date": "2013-10-21 13:27:46"
  },
  {
    "review_id": "dBqlQxlyl4MzYoi8jxhT3g",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "NOeEa5aJpUF38qxi2Bj5Gg",
    "stars": 2.0,
    "useful": 1,
    "funny": 0,
    "cool": 0,
    "text": "Lovely to look at, but impossible to love. \n\nThe setting alongside Lake Afton is as pretty as a postcard, but the 3 car parking lot is ridiculously inadequate. It makes a difficult traffic location that much worse, forcing people to focus on parking rather than driving.  Double and illegal parking happen every day, creating a dangerous condition. Amazing that the Yardley government permitted Star$$$ to do this.  \n\nThe coffee is the same as everywhere else, which to me is poor to average for the basics, but decent if you fall prey to the insidious upsell pressure to go latte or capp in order to be able to imbibe the burnt tasting brew. \n\nThe facility is pleasant once inside, with windows facing Main Street or the lake. It is also a front row seat to the near miss accidents that routinely happen there.",
    "date": "2013-10-15 12:51:00"
  },
  {
    "review_id": "ryX49j_938D84j1iIM3tSA",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "cqJwH4GoPxYKW7wVjBbC9g",
    "stars": 2.0,
    "useful": 8,
    "funny": 5,
    "cool": 4,
    "text": "Super Wok?\n\nThis one table takeout joint is the opposite of \"Super.\"  The floor is crammed with inventoried cases of soda and packaging, suggesting it has not been cleaned in forever.  \n\nI went with the quick Lunch Special @ under $6. The price would be right if only the taste followed suit. Everything came out in plastic or Styrofoam containers.  The Wonton Soup was salty (MSG), the wontons themselves, thick and tasteless.  The General Tso's Chicken had a dark tawny gloopy sauce that was neither spicy, nor subtly sweet; but in some no man's land in between that satisfied neither end of the spectrum expected for that dish.  The Fried Rice was the best part of the meal.  It was not cooked in dyed bullion, but had lots of chunky pork and veggies, and little flavor.  Almost decent. \n\nThe advertising declares that it is, \"Szechuan, Hunan, Cantonese & Thai Style.\"  Actually, what they meant to say was that it is none of those.  Not a big mistake.  It is a mish mosh of indistinct tastes and textures, none of which begin to be authentic.  It is not possible to get anything Thai on the Lunch Special, Special Platters, House Specialties nor Combination Platters menus.  There is a \"Thai Style\" list, but after watching and listening to the kitchen action, I would not recommend going there. \n\nSuper Wok? Super Not!.",
    "date": "2014-06-24 19:03:29"
  },
  {
    "review_id": "b6yAtjJZEd2u9oKNt4mwYQ",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "lPB_ZBXjLmV7qaPL9t0DTA",
    "stars": 2.0,
    "useful": 8,
    "funny": 5,
    "cool": 5,
    "text": "What happened?!\n\nPat's was always the place to go for a decent breakfast at budget prices.  Something is amiss.  \nToday's breakfast was still inexpensive, but the quality of the meal was really unacceptable.  \n\nI ordered one of the breakfast specials on the back of the breakfast menu. Two slices of French Toast, Bacon and Coffee @ $5.20.  This is what was served by the pleasantly attentive server:\n\n~ Yellow dyed bread with barely any egg absorbed into it, grilled and tasteless, but for the Smucker's packaged syrup that had to used completely as it continually disappeared into the thick slices.  No sugar added to induce caramelization. No vanilla added for flavor.  \n\n~ The two bread slices stuck together on the plate edge to edge, as it must have grilled, with no effort by the kitchen to separate them for better cooking or more attractive display on the plate. \n\n~ Bacon deep fried rather than placed on the grill, so that it was tough to chew and tasted of the oil it cooked in.  \n\n~ Decent coffee. \n\nMaybe it was a mistake to order a breakfast special because management sees it as a loss leader and puts almost no effort into preparing it correctly, or it wants to discourage people ordering it a second time. Regardless, it was a major disappointment, and showed a true dismissiveness toward the patrons. \n\nBut for the fact that I have gone to Pat's over many years, I would not choose to return.  If I find myself there again, I will order a la carte and see what I get.",
    "date": "2016-03-22 14:45:56"
  },
  {
    "review_id": "BAWJOUzKN9IMMSZCRxYeTA",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "JqE-8ze3ynslCeBxpnzusw",
    "stars": 2.0,
    "useful": 32,
    "funny": 19,
    "cool": 19,
    "text": "That's quite a lot of braggadocio for a tiny Chinese takeout shop on the bad side of Brunswick Avenue in Trenton, NJ. Actually, there is no good side in that part of town. Of course, it is just advertising; meaning that none of that name is true. \n\nThis chop shop is state of the art dumpy and depressing. The woman at the order station is friendly enough, but the kitchen help spends a lot of time staring out at the customers. Just a little weird. Whether eating in or taking away, the food is served in the same closed take out containers. Plastic and styro all the way. Chinese tea? Bring yours from home. \n\nIt's not that the grub is bad, it is about average for a joint that doesn't much care about you, and assumes you know nothing about Chinese/American food. The wonton soup, pork egg foo young and fried rice were recognizable by sight and taste. Yellow dye chicken stock, thick skinned dumplings, day old yellow chunky rice - just the way they taught them in mail order cooking school.  \n\nEdible, but forgettable.",
    "date": "2018-02-24 15:58:27"
  },
  {
    "review_id": "_YsSVOvHC9640uxIGnMuig",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "8R_URQJrMN1VrlLFpArSAg",
    "stars": 2.0,
    "useful": 44,
    "funny": 28,
    "cool": 36,
    "text": "Wild Ginger III in the Logan Square Shopping Center, New Hope, has a great name and suggests a deep excursion into the jungles of Southeast Asia. The layout of the restaurant reinforced that sensibility with huge tropical fish tanks and beautiful blue, green and indigo neon lit walls and ceiling. \n\nIt is an auspicious beginning for a new guest, although the fishy smell permeating the room from both the tanks and sushi bar do detract from the gestalt somewhat. Unfortunately, that is not where the disappointment ends. \n\nI was there for the Thai and Chinese offerings of its fusion menu. Tom Kar (lemongrass/coconut milk soup), Pad Kee Mao and Szechuan Beef were my choices. I planned to eat the first two in house and take the third home for later consumption by the family working until later that evening. I like spicy dishes unadulterated forward the western pallette, so I asked for the hottest rendition available. I wasn't kidding, but the kitchen didn't believe me. \n\nThe soup had plenty of fresh veggies and sweet coconut juice, but lacked the kick of lemongrass. It wasn't in the pot!  Rather than red chili infused broad drunken noodles in a super heated brown sauce, what I got was actually sweet to my tongue, without a hint of the desired fire. I had to send it back to be reworked. It returned, the same noodles, but with some chili sauce or ground Szechuan red peppers or paste mixed in. It wasn't integrated, but I spun it for a moment and it was acceptable. Shame, because the noodles, veggies and chicken were all tender and done well. \n\nAt home we dug into the Szechuan Beef over rice. Again, it looked great and properly wokked, but without a sign of red chili pepper. It was hot as requested, but the burn came from chili powder or paste thrown into the sauce that attached itself to the meat far more that the broccoli, onions and green peppers. Not bad, but clearly prepared by a kitchen lacking the right ingredients to actually produce a Szechuan dish correctly. \n\nDisappointing.\n\nWild Ginger is a misnomer. \"Mild Ginger,\" is closer to the truth. Another case of Asian confusion, not fusion.",
    "date": "2019-12-17 18:04:20"
  },
  {
    "review_id": "gxdT2a-F8dqbJnbBE8XlFA",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "WRTfAjDstMkP8-2HAEi2Fw",
    "stars": 2.0,
    "useful": 8,
    "funny": 4,
    "cool": 1,
    "text": "Tutti Frutti is a frozen yogurt shop in the Oxford Valley Plaza; the same commercial center that holds Bone Fish Grill.  The set up is a bit strange.  Upon walking in, there were a couple of tables and a shelf on the wall with paper cups for the yogurt.  However, the actual handles for dispensing the cool sweetness were in the perpendicular wall and not visible from the entrance.  Beyond that lies the toppings bar and cashier.  The back of the store cannot see the front, nor the machines without cameras.  Def not designed for functionality, nor safety.\n\nThe Yogurt?  There were five or six double machines capable of independent pouring or a mix of the two.  I opted for the French Vanilla, Peanut Butter and Cookies & Cream, with room for some blackberries, mini-Reece's, and wet pecans.  \n\nUnfortunately, none of them had much taste.  The vanilla was completely invisible on the tongue.  The peanut butter was recognizable, but weak.  The cookies & cream offered a glimpse of chocolate cookie, but the cream was absent without leave.  Not sure how the store manages to mess up the recipes, or maybe that is what is expected.  Not nearly as good as just eating regular yogurt.  \n\nThere are many excellent ice cream alternatives in this area (Dairy Delight, Jo-Jo's, even Friendly's, to name a few), that it makes little sense to seek out Tutti Frutti for dessert decadence.   \n\n\"So Fresh\"  \"So Light\"  \"So Tasty\" ?\n\nNot So Much.",
    "date": "2016-05-15 13:03:33"
  },
  {
    "review_id": "vtrvxF6fNJabeWX6-hvhTA",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "19XYV3shpQ3yYDtYFsnxGg",
    "stars": 2.0,
    "useful": 67,
    "funny": 42,
    "cool": 50,
    "text": "TWO SLICE LUNCH REVIEW\n\nDespite receiving the \"well done\" reheat as requested, I was less than satisfied with the quality of the pizza served up at Nina's on Bridgetown Pike, Feasterville-Trevose, PA. \n\nMost significantly, the balance of cheese to red sauce was way off. There was a ton of low grade mozzarella releasing oil and dripping on the plate, and the mass of fromage on top made the undercarriage too weak to hold the weight, causing sag from the get go. Too, the sauce, such as it was, was overwhelmed by the copious cheese, so that the only available flavor on the tongue was of salt. Not pleasant. \n\nService was fine and efficient. The dining room was partially open for sit down dining, with chairs on top of tables elsewhere in the room. \n\nI didn't sample anything else on the menu, but Nina's is a No-No if looking for decent tomato pie, at least of the reheated variety.",
    "date": "2021-04-27 16:49:42"
  },
  {
    "review_id": "N3YAqMNm_hvYKAdgPNyy5w",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "TODSpqAYU59Y_sfcL98rLA",
    "stars": 2.0,
    "useful": 16,
    "funny": 9,
    "cool": 3,
    "text": "Aptly named Jersey diner on Rt. 206, Mt. Holly, NJ. \n\nThe place appears clean and well maintained.  All the marble shines from polishing. The staff in black shirts and red ties look like a well oiled machine.  I sat at the counter for a late breakfast.  The service was friendly, but a little bit off.\n\nI ordered a short stack of French Toast, with a side of Sausage and Coffee.  The Bunnomatic brew was good, and my request for milk rather than Mini-Moo was well met.  The egged bread was a thicker, egg based loaf with the consistency of Chollah, but not actually that species. It grilled up well with lots of caramelized edges and a huge capacity to soak of the Smucker's Syrup.  Wish they had a Maple Syrup alternative, but guess not. Glad it was only two slices, as they were big and filling. \n\nThe breakfast sausage was four links that seem to have been cooked in the deep fryer rather than on the grill or in a pan.  They were uber oily and had a strange taste, perhaps from whatever had been deep fried prior to my order.  I tried, but could only eat half with max effort. Not good. \n\nI received my bill before I was finished from an escaping server who wished me a good day, but never offered a second mug of coffee.  I had to ask one of the other women behind the counter for more, and she sweetly obliged.  This small slight of courtesy set my attitude toward the place.  Plenty of potential, but lack of execution; especially in human interactive skills and short cuts taken to save time/money, but disrespect the paying public. \n\nThis is one Pandora's Box I will not be opening again.",
    "date": "2016-07-14 13:51:48"
  },
  {
    "review_id": "55v28FAkx8vE_4HIC-42tw",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "9j7gjiKOxXOunq74JdCy3Q",
    "stars": 2.0,
    "useful": 19,
    "funny": 8,
    "cool": 9,
    "text": "Number 1 Chinese Restaurant on Parkside Avenue, Ewing, NJ., is classified at the apex of an imaginary list of Chinese houses.  Only if you hold that list upside down will it come close to the top. \n\nThis is strictly a takeout and delivery joint with good reason. If you walk in as I did to order and pick up your own food, you will discovery that it is unkempt with a layer of grime throughout. Not a pleasant place to wait.  The menu and prices are about what you would expect for a low budget kitchen.  The lunch specials are all under seven bucks for a pile of stale fried rice and choice of soup or egg roll in addition to the main offering.  \n\nI found my orange chicken to be small pieces of clucker, thickly breaded and wok fried so that it was not always possible to discern the actual chicken within its cocoon. As indicated, the fried rice was at least a day old, underheated, clumpy and dyed with whatever bouillon they cooked it with. The sauce was thick and gloopy, but the flavor was not so bad.  The overall experience just left much to be desired. \n\nThe only saving grace was the egg roll, which was actually better than expected, with pork strips within in addition to cabbage and spouts. \n\nNot the place I would return to unless it was the only game in town.",
    "date": "2017-10-12 16:21:11"
  },
  {
    "review_id": "pGGhWH0D7I1BhpZaAck19Q",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "qtsIqEauKkbW6PvXz6aMaQ",
    "stars": 2.0,
    "useful": 21,
    "funny": 13,
    "cool": 14,
    "text": "If \"A-Okay\" is interpreted as mediocre, Siam Cuisine Thai Restaurant III, fits the definition. Although, \"Meh,\" is also appropriate in some regards. Simply, I expected more from this outpost of Southeast Asian dishes, especially after dining in the past at its sister restaurants in the area, and the fabulous Thai meal eaten a few months ago in Metuchen, NJ. \n\nHere, although the atmosphere was comfortable, the service and quality of the food left much to be desired. \n\nWe ordered three soups; Coconut, Lemongrass and Vegetable.  While the flavor of the coconut soup was accurate, it and the other bowls were populated mostly by broccoli florets, carrot slices and nearly tasteless mushrooms. The lemongrass was mildly spicy hot despite our request that all our dishes be heavy on the chili and other condiments.  Sadly, the veggie offering was just a weak diluted consume with the same contents.  Disappointing.\n\nThe entrees were also a mixed bag.  The drunken noodles were plentiful, but not hot enough.  The stuffed chicken breast plate was decent, but would have been much superior with a more spicy stuffing. My salmon dish was a nice fillet, but slightly past its prime.  Again, that broccoli and carrot thing.  Service was slow, and perhaps the bottleneck in the kitchen explained the lack of any attempt to accommodate our requests for spicier food.  However, given that our dinner for four came to nearly $100 with a beer and a couple of non-alcoholic drinks, they could have either made a stronger effort, or let us know in advance that they were unable to satisfy our requests. \n\nRegardless, given the other Thai houses in and around Bucks County, there is no reason to visit Siam Cuisine again anytime soon.\n\n2.5 Stars",
    "date": "2017-04-21 13:55:08"
  },
  {
    "review_id": "Ca8IVwwVi7Gep8r2MNNmRg",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "ozCkVIIAhNldop4MMnLYtQ",
    "stars": 2.0,
    "useful": 53,
    "funny": 28,
    "cool": 37,
    "text": "WHOLE PIE PIZZA REVIEW -\n\nStopped at Giuseppe's for late lunch after a beautiful walk around at Morris Arboretum. It was about half way home. Perhaps with eyes bigger than stomach, we went with a large pie, half pepperoni, thinking a fresh baked pizza would be more satisfying than reheated slices and we could take the rest home. \n\nIt didn't quite work out as planned. \n\nUpon delivery to our table by the friendly server, we noticed a small pool of oil sitting mid pie. We blotted up as much as we could, but it remained shiny with the excretions from the pepperoni and low grade mozza covering the crust. \n\nThe request for a \"well done\" finish to make the undercarriage as firm as possible wasn't honored, so each slice drooped down when lifted and continued to drip oil. The cheese layer was too thick to be supported, and there wasn't any balance with the sauce, which was a bit salty for our buds. \n\nJust not a very strong effort. Made us rue our decision and wish we had gone with a couple of slices, or better yet, not stopped in at all.",
    "date": "2020-08-26 14:42:34"
  },
  {
    "review_id": "oIyCo6gYPJb8yKpv5wgm9w",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "5X0M4waoFm4kH612ezVvtA",
    "stars": 2.0,
    "useful": 8,
    "funny": 2,
    "cool": 2,
    "text": "The space was modern, yet comfortable. Black tables, wood-like floors.  A nice diner-esque counter. HD TV on the wall.  Menu full of creative alternatives in the pancake, French toast, waffle and omelet genres.  \n\nPerhaps I made a mistake in ordering a simple Short Stack of French Toast.  It seemed as soon as I gave the friendly server my order she was coming back with it already mixed, dipped, grilled and plated.  Olympic turn around time. \n\nBut, something went wrong.  The four wedges were not fully cooked.  The toast was mushy and not hot in its core. There was no crispy caramelization.  It had been rushed for no apparent reason other than inattention.  Time constraints did not permit returning it to the grill for a few extra minutes, so I ate what I could and took my leave. \n\nWith so many good reviews, mine is surely an outlier.  I will try again in a few weeks and see what I get.  But for now, I have certainly had much better French Toast at many places in the area.",
    "date": "2014-08-21 03:17:18"
  },
  {
    "review_id": "IBc39iD6GgHG8AUFlJhTkQ",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "VMWq7Dr6wC5xPkL3rEuQSw",
    "stars": 2.0,
    "useful": 19,
    "funny": 13,
    "cool": 14,
    "text": "This is an older version of Friendly's on West Trenton Avenue, Morrisville, Pa.  The dining area is long and narrow, with about twenty tables and booths. It is an attractive space in a 1960's kind of way; feeling like a joint your parents would have enjoyed in their teens. \n\nAdrianna was a fine server;  friendly, prompt, attractive.  Her red hair worked for her. She took my order of a patty melt, and like a skilled salesperson, inquired if I wanted fries, or the ninety-nine cent upgrade to onion rings.  What the hey?! I splurged.  She also thought that I might qualify for the free sundae, and delicately broached the topic with diplomatic flair.  In fact, I did.\n\nEverything tasted good on the way down.  The melt had the appropriate finish and a goodly amount of grease.  The rings were uber-crisp.  The black raspberry scoop with KitKat crumbles looked strange, but tasted fine.  In fact, when I walked out I was considering a three/four star review.  That was until I went to bed a few hours later.  By that time, my stomach was in distress, and I feared a sleepless regurgitative night.  \n\nIt was a close call, but a handful of Tums quieted the restive beast, and I finally slept somewhere around 2 am.  \n\nI'm all for low budget burgers, but I suspect the raw beef may have spent too much time above health department temperature requirements before being slapped on the grill.  Besides, this meal came to almost $12, with grat.  At those prices, I don't want to deal with unpleasant consequences.",
    "date": "2017-03-08 15:38:37"
  },
  {
    "review_id": "4nkqrjB3XzD5I3jmYKlynQ",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "QVqLR6SJZP9DyeYVR9esUg",
    "stars": 2.0,
    "useful": 48,
    "funny": 27,
    "cool": 35,
    "text": "Unfortunately, the first observation from my dealing with Pho & More in Montgomery Commons is that while it may be a Vietnamese house, it certainly is not a Thai kitchen. As I ordered from both ends of the menu, I found myself happy with the Roast Pork Banh Mi sandwich, but damned dissatisfied with the Lemongrass Coconut Soup (Tom Kha) and the Drunken Noodles (Pad Kee Mao). \n\nWhy? Because although both those dishes have lemongrass spice as the key ingredient, there was absolutely no lemongrass to be found in either the soup, nor the wide flat rice noodles. The soup tasted of watered down coconut milk, with ample chicken and mushrooms, but without the strong bite that lemongrass provides. Very poor effort. \n\nAnd the Drunken Noodles were not hot and chewy at all, but really just Chinese Vegetable Chow Fun with a few leaves of Thai basil mixed in. I ordered it \"very spicy,\" and the cashier dude repeated that request to me upon pickup. Yet, despite the reasonable quantity of noodles and veggies, it totally lacked the heat punch desired. Boring, semi-sweet fat noods without redeeming fire signature. Major disappointment. \n\nIf I had to guess, I would venture that there was not a Thai person in the kitchen, nor even a real authentic recipe for Bangkok cuisine in the house. If they don't have lemongrass in stock, they just aren't Thai, and shouldn't misrepresent their abilities. Yet, the Banh Mi was decent and I grant that someone may have trained in Ho Chi Minh City or Hanoi to perfect their pho stock. \n\nHad I known the truth about this joint, I would have happily stayed in Vietnam, and travelled to Thailand another day. As it is, with dishonesty at their core, I will never return to find out what they are really good at. \n\nFooled me once, shame on you!\nFool me twice; never happen!",
    "date": "2021-03-22 17:06:53"
  },
  {
    "review_id": "nzgKMtAB1-OW4Liz3X-kWg",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "mfTE6x39X0vjNhy8mBwp0A",
    "stars": 2.0,
    "useful": 0,
    "funny": 4,
    "cool": 0,
    "text": "Aside from being the only DD I know that has converted floor space into a fire pit leather sofa lounge, there is nothing out of the ordinary in this shop.  The coffee is hot. The donuts sweet. The service so-so.  The lounge full of Russian 20 somethings. \nIf any of these appeal to you, this is the place for you.\nMe?  Not so much.",
    "date": "2014-03-16 23:32:32"
  },
  {
    "review_id": "2aLvWf9n6q7zi38meUHDMg",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "y7IbpgftK97lerMOrgHFoA",
    "stars": 2.0,
    "useful": 20,
    "funny": 10,
    "cool": 6,
    "text": "The merger with Continental Airlines may have been good for United, but it has not been a blessing for its passengers. Where Continental offered excellent people up front and in the aisles, quality entertainment options with the self-programming movie and music system, and decent food on international flights, the \"new and improved\" version is anything but.  Gone are the useful menus; replaced by, \"Chicken or fish,\" without further information.  Gone are the stopby's to see how you are doing.  Now, the flights are sterile.  \n\nIt is obvious that problems with management are spilling into customer services. Even the introductory videos with Jeff Whomever seem bland and not designed to offer even a sincere gratitude for flying with them.  In fact, in the video on the plane to Beijing, he seemed gaunt and suffering a health problem.  Hope he hasn't been spending too much time inflight, because often after one of these 14 hour jobs, I feel just like he looks.",
    "date": "2013-12-03 22:30:47"
  },
  {
    "review_id": "RovTNkVLtDGrY7LgRl1xew",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "Lswb5BgtMTWCsSw_blU4oA",
    "stars": 2.0,
    "useful": 4,
    "funny": 0,
    "cool": 1,
    "text": "The best thing about this Starbucks on Main Street, Doylestown, is the front elevation from the street. It occupies a historic building that dominates a key intersection in the Borough.  Very attractive. \n\nSadly, that is where the positives end.  Inside, the layout is dreary. Dark on the brightest days, it feels like a morose ghost inhabits it, making for a sense of weariness. The coffee at all Star$$$ is universally bad, and it is no different here. It forces you to upgrade to an expensive alternative to regular coffee, a perverse upsell that seems to work everywhere. The pleasantness of the staff is helpful, but cannot overcome the down energy that is ever present. \n\nMany better choices in town, perhaps why the shop was not overly busy while life on the streets around it was jumping.",
    "date": "2013-08-26 14:11:47"
  },
  {
    "review_id": "_KOgja6MHWMnOKTEYKEZ8Q",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "LRztU8G1sH5riQReeX9-wg",
    "stars": 2.0,
    "useful": 9,
    "funny": 5,
    "cool": 8,
    "text": "My first visit to any Home Goods occurred yesterday when returning a gift.  After securing the store credit I walked around the space to see if I could find something of equal value while there to avoid the need for a return visit. \n\nI couldn't, and walking around this downscale sibling of TJ Maxx was actually rather depressing.  Lots of junque. No real value. \n\nBig brother has more useful things.  Luckily the store credit extends to all members of this retail family.",
    "date": "2016-01-03 00:54:44"
  },
  {
    "review_id": "Roz1jxItTosWl8XIpONvxw",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "royu72qt2ZUW02wDumk1Mg",
    "stars": 2.0,
    "useful": 12,
    "funny": 7,
    "cool": 8,
    "text": "Slice & Soft Drink Review\n\nWalked in to Yordana II tonight for a light bite and went with a slice of regular pizza that was sitting under glass. The place was empty but for me at 7:15. It had about a half dozen booths along the inside wall.  It was a clean house, with three guys in the kitchen. Everyone was polite. \n\nI asked that the reheat be \"well done,\" to bring the wedge fully back to life. The young cashier took my $4 and handed me some change for the tip jar on the counter. I went to pour my drink and retreated to a booth to await my victuals. \n\nIt arrived a few minutes later in the hands of the chef. It was a smallish slice, but I wasn't starving. My standard for good pizza wants the point to stand firm when picked up by the crust. It demonstrates a well baked and strong chassis upon which the rest of the vehicle is built. This one collapsed on elevation. The weight of the cheese and the trapped moisture in the underbaked bottom made for a soggy base. \n\nI folded it over longitudinally to hold it together, and a rivulet of oil rolled off onto the paper plate. Cheap cheese. When I could finally take the first bite, the triangle was hot enough to melt the surface and warm the undercarriage, but had not reached full reheat, let alone the heavier burn I requested. Also, the top was almost entirely cheese with a thin tasteless layer of sauce. Bad proportions. \n\nThis was not a good pizza for me. Everyone has a different preference for their pie, but when requests are not honored, the problem goes deeper than lack of real experience with a classic American comfort food. It is about listening and translating that request into the desired product. This just wasn't done. \n\nEverything else on the menu may be great, but the pizza reheat was not.",
    "date": "2016-12-24 13:51:37"
  },
  {
    "review_id": "rgueydpptDKHkgnyAYfjyw",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "2eYv0SVE_ydSRERt0fP6EA",
    "stars": 2.0,
    "useful": 5,
    "funny": 1,
    "cool": 3,
    "text": "Strictly a low budget primarily take out joint that dishes out the standard Chinese/American fare at low prices.  Nothing original here, except they do provide hot tea in a large heated pot for those who ask for it.  Many places are so stripped down that only cold drinks are offered with lunch specials, and the iconic Chinese tea is forgotten.  \n\nThe room was chilly for eating in as I did, making it obvious they did not encourage people hanging around to eat on their one or two tables.  Health issues were also present, as I observed the chef breading chicken pieces with his bare hands before dropping them into the wok.  Hate to think where those digits may have been.  \n\nThe taste of my Sesame Chicken with Fried Rice was okay, although the rice had been made earlier with a yellow dye chicken broth.  I didn't expect it to be made to order.  Same was true for the Wonton Soup.  Thick skins and unidentifiable meatish food within.  Bad texture. Worse taste.  I left most of that plastic container behind.  \n\nHow much better it would be if these places provided real plates and flatware, rather than plastic containers and utensils, for those few who chose to eat there.  Being served as if ordering take out just seems dismissive of those customers.  It doesn't change the taste of anything, but sure makes for a \"we don't care about you,\" attitude.",
    "date": "2016-03-23 18:03:12"
  },
  {
    "review_id": "MkDNOBE-kPPvtYTH4VSFOw",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "9xJMeK0cQa4mB60b3_tUyw",
    "stars": 2.0,
    "useful": 3,
    "funny": 1,
    "cool": 0,
    "text": "This review is for the lunch experience at Hong Kong Gourmet. \n\nThe 5 Star reviews caught my attention, so even though it was a longer drive to Richboro to get to the location in Crossroads Plaza, I thought it was worth the time.  Walking in, I viewed a nice dining room with the ubiquitous leatherette booths and industrial carpet, and it was bright and airy.  The house was empty at 1:45, not unusual for a late lunch. There were two women working the floor.  They seemed tired, but dutiful.  I was pointed to a booth near the front and handed a menu.  \n\nAfter perusing the multi-page document and seeing a fairly broad selection of dinner dishes that were appealing, I finally reached the \"Lunch Special\" page in the back.  Although there were 24 items listed with a price range between $5.50 and $8.95, most listings were of the, \"chicken/pork/beef with veggies/nuts/garlic/lobster sauce and fried rice,\" variety.  Uninspired.  All the better dishes were in other parts of the menu at much higher price points (read; dinner prices).  This approach certainly made me feel that lunch was not important to this business, unless I was willing to eat dinner earlier in the day.  \n\nOkay.  I was there. I was put off.  I would play it out.  I ordered the General Tso's Chicken, which had a little red pepper icon next to it.  It came with Hot and Sour Soup, and Pork Fried Rice.  The soup was not bad. Plenty of tofu, sprouts, and slivers of pork. Not too much vinegar.  The Fried Rice was a pleasant surprise.  It was fresh with chunks of pork and a nice supply of veggies. However, the Chicken came in thinly breaded cubes and rectangles, was dry tasting, and the sauce was neither sweet nor spicy.  There was only a hint of flavor in the thin glurb. Pieces of Green Pepper were thrown on top of the chicken, and while it was fresh, it was monochromatic.  I get that they did not want to invest heavily in my lunch, but why not a little red and yellow bell peppers, too?  \n\nMy read from the experience, which included non-smiling service and the delivery of my check while I was still eating, was that Hong Kong Gourmet does not want to do lunch, and is only open at those hours to catch the unwary. I deduced that the soup and rice were good because they were prepared in advance of dinner, not for the lunch crowd.  Their evening victuals may well be better, but after this exposure of disinterest, why would anyone want to give them another visit?  \n\nI certainly won't.",
    "date": "2014-03-07 14:20:15"
  },
  {
    "review_id": "v-llO79Uefbw011cBZZbhg",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "pCBYHV6YFKGNTkjLHBGf4A",
    "stars": 2.0,
    "useful": 5,
    "funny": 4,
    "cool": 4,
    "text": "I now know the downside of having a pizza parlor make pies for display purposes.  If you are unfortunate enough to come in for a late pizza slice lunch, you end up eating old pizza from the display, rather than anything remotely fresh.  \n\nI learned this lesson the hard way a few days ago, when I stopped in after 2:30 for a small repast to tide me over until dinner.  My Tomato Pie was sauce without cheese (In my world it is sauce over cheese). It was okay, but basically too acidic from sitting around for many hours.  Too, the plain slice while large, had an overworked crust that proved tough and chewy rather than crisp as a cracker.  Time had not been kind to it.\n\nI liked the gentleman who prepared my slices in the oven and brought them to the table, and it was not his responsibility to make a new pie for me.  Still, there outta be a rule that says display pizzas are dumped after being out in the open for more than 2 or 3 hours, so they are not reheated beyond human tolerances.",
    "date": "2015-08-19 20:58:25"
  },
  {
    "review_id": "9cCvY5ujybUA8EolzYbHPA",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "EwfTbC1G-_v9zB-faA5x0g",
    "stars": 2.0,
    "useful": 12,
    "funny": 4,
    "cool": 7,
    "text": "Moish & Itzy's and its predecessors have been serving me breakfast and an occasional dinner for almost 20 years.  However, I frequent there less over time for a variety of reasons.  When I found myself there last week for a breakfast meeting, I had a few moments to look around, read the menu closely, and get in touch with what I have liked about M & I.  \n\nThe physical plant looks worn.  Walls dinged; molding dented and chipped; dirty carpets; same old floor plan. The menu is still huge, but unchanging.  The prices fail to reflect the economic realities of our times, nor the effort of other restaurants to offer  less expensive options.  Finally, I compared my memory of decent food with current fare.  That was basically the same from what I could tell.  Big BUT - when I ordered Matzoh Brie (Fried Matzoh) I was told they had no Matzoh!  Okay, but how is that possible in a Jewish style deli? I will skip the fun analogies.  \n\nI ordered the French Toast instead.  It was fine, but uninteresting.  That sort of sums up my current sense of this place.  It looks and feels basically the same, but after so much time in business, perhaps it should do something differently to keep people engaged in the environment.  I felt tired after leaving M & I, despite all the coffee. \n\nMoish and Itzy felt tired, too.",
    "date": "2013-07-22 13:57:00"
  },
  {
    "review_id": "D-6UKKKj8pFnMnbnq6nnvw",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "mKJ_WV7TvrjyDjmb_hUVsA",
    "stars": 2.0,
    "useful": 61,
    "funny": 32,
    "cool": 42,
    "text": "El Limon, the Mexican Cocina that has expanded locally to 16 shops, has always been a favorite of mine for comida Mexicana in the region. I have visited four or five locations over the years and always found them to be authentic, creative and down to earth in the atmosphere department - utilitarian without painted carved chair ostentation. They are good eats at good prices. \n\nMy recent visit to their new Bensalem store has me reconsidering my past impressions. Maybe they are growing too fast, or their supply lines are stretched too thin by coming into Bucks County from Montgomery, or COVID logistics have overwhelmed them, but the charming delicious gestalt of past exposure was not present in this place. \n\nI ordered a Torta Milanese (thin breaded fried beef sandwich) and Horchata rice drink. I've had both before at their other locales. Overlooking for the moment that the servers forgot to set up my table with flatware, napkins or glass of water even after delivering my meal, the sammy itself was a shadow of its previous self. Less meat, less chipotle mayo, less avocado, and a kaiser roll from the discount day old shelf at the back of their bakery. It was soft, tasteless and dry. There was no way they used such inferior bread on any other visits; in fact in the past their rolls had stolen the show they were so good. \n\nNot this time. It was a complete sad sack. \n\nClearly, quality control has taken a hit at El Limon Bensalem. They need to step up their training in customer service, and seriously reevaluate their bread purveyor.\n \nAt least the Horchata was quite good.",
    "date": "2021-08-02 23:58:51"
  },
  {
    "review_id": "MfUeTWahOtWESs7u2bQ2LA",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "yEtLLcHPJtlW2vslDEQ72A",
    "stars": 2.0,
    "useful": 1,
    "funny": 5,
    "cool": 1,
    "text": "Don't know what everyone else has been smoking, but this former corner diner cum Nino's Pizzarama doesn't make very good pies. \n\nThe place sits at the intersection of Chambers and Genesee Streets, a locale that is not designed to make you feel secure.  Through the large dirty windows pass the tempest tossed ravages of Trenton.  The dive is tiny with 5 tables, and floors, walls and windows that have not been washed in who knows how long.  I came in for a couple of slices, and was told by the counterman that the uncut pizza in front of him had just come out of the oven.  \n\nNo reason to doubt him.\n\nHe tried to fit both slices on a single white paper plate, and when the point of one folded over and began to drip onto his counter, I asked for a second plate to hold both triangles.  He handed me the plate and I slid it under the drooping offender.  I sat down at a booth, sprinkled on the hot pepper flakes, and picked up the first slice.  It had not folded, and the undercarriage was actually thin and quite firm.  It held its point well until I snapped it off with one bite.  \n\nIt was indeed hot.  The immediate taste was that of pizza - if a little salty from the cheese, and slick from the oil moistening the surface.  After putting it back on the plate, the oil began to run off the slice and onto the plate and ultimately the table when I picked it up again.  Too much poor quality cheese, and not enough of any quality sauce.  I could not taste it over the shouting of the fromage.  \n\nThe second slice, cooler, was no better.  The original damage required a two handed pickup.  The fold where I bent it to be able to pick it up began to run a rivulet of oil, and dripped from the outer rim.  the oily saltiness was the dominant message.  \n\nJust not very good.  The young lads next to me said their cheesesteak was good, so maybe that is the way to go.\n\nStraight pizza slices, certainly wasn't.",
    "date": "2015-04-06 19:05:47"
  },
  {
    "review_id": "iCUTjfv5C65WD9syz6g_hw",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "Rzx2E5XgTeGU7FEbUZ-bGg",
    "stars": 2.0,
    "useful": 49,
    "funny": 40,
    "cool": 42,
    "text": "If you really like finding your way out of a maze, IKEA is your kind of fun store. One way in. One way out. Little signs with arrows point you in the right direction. A few unmarked shortcuts if your keen enough to find them. \n\nIt's not that their products aren't good; they are. It's not that their Swedish meatballs aren't excellent; they are. It's all about their concept of how people think and learn. To IKEA, customers are to be lead around through the entire warehouse regardless of what they need, and forced to pass through every department on two floors until finally reaching check out cashiers at the end of a long and boring stroll. Once you've begun, forget about going back to the beginning. The human undertow will just drag you down. Need a restroom? Good luck with that. \n\nIt helps if you are a zombie or dyed in the wool shopper when dealing with IKEA. If you don't particularly like the \"Costco\" warehouse experience, this place will wear you down. I mean, how many DIY furniture projects do you have in one lifetime? How often do you need to build shelves for your office? Not nearly enough to make this entertaining. \n\nYeah. We did buy a few glass water containers for around the house, and the prices were good. But, how much better it would have been to be directed to the location where they were shown, and be able to go right to them, than be required to go on safari to find them. \n\nWhat a perverse trade-off.",
    "date": "2019-07-23 16:40:45"
  },
  {
    "review_id": "OzRx3w14Oyk6pvFPSbkOwg",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "sNP0PovNW1RQnfDQogOuVQ",
    "stars": 2.0,
    "useful": 4,
    "funny": 0,
    "cool": 0,
    "text": "Reading through the more recent reviews of the Continental Tavern I had the impression that while most people liked the atmospherics, they were less enthused with the cuisine. While the two of us only had their \"Best of Bucks\" burgers, fries and soft drinks, we departed thinking we have had better elsewhere.",
    "date": "2013-01-07 03:12:28"
  },
  {
    "review_id": "5pX3TE_wHtuZ7yM5dPMlAw",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "DQDQYVOchhbmIEQ0uOHdRw",
    "stars": 2.0,
    "useful": 26,
    "funny": 11,
    "cool": 17,
    "text": "This is the Shake Shack inside King of Prussia Mall, in the second floor food area. \n\nI admit to being the last person on Earth to eat at Shake Shack, despite it's siren song of awesome burgers, fries and signature shakes. Now that I have finally had the pleasure of dining at this outlet in the fantabulous KoP Mall I can honestly say that I am happy to have the experience in my life, but really don't understand the halabaloo. \n\nAside from long lines and slick advertising, I found the burgers to be rather pedestrian (not that there is anything wrong with walking). A single puck sandwich seems to be 5 ounces of overcooked beef in a pretty good bun, lettuce, tomato and secret sauce. At most, a four biter. Just about every tavern in the Universe does a better one. My backyard grill puts theirs to shame. Most roadside joints have nothing to fear from this outfit. \n\nTrue, the shakes are a kick in the pants, so maybe the burgers just accessorize the superior drink and are not designed to be the star of the show. If that is the intention, they have succeeded. The salted caramel shake far outshined it's burger cousin. \n\nBut, do I want to pay $6 for a small shake on a regular basis? No. I can do better at DQ on both counts, for far less money. \n\nFor me, Shake Shack is an exercise in hypnotic marketing, akin to the Emperor's New Clothes fairytale. \n\nCaveat Emptor!",
    "date": "2018-01-24 15:47:36"
  },
  {
    "review_id": "4slGLOZ0QAkvyPzvj1oKsg",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "jStucNbOM6ahijTwhfe74w",
    "stars": 2.0,
    "useful": 0,
    "funny": 2,
    "cool": 0,
    "text": "Okay.\nDon't judge me harshly.\nIt was late.  I was really hungry.  This Wendy's is close to my office.  I needed to get something quick to eat at my desk. \nThere it was.  Brash. Loud. Unrepentant. Singing its siren song. (\"Come to me in your weakness and famishment...I will sustain you, at least for today...\")\nI drove onto the drive thru line. Someone pulled in right behind me.  I could not get out if I wanted. I was trapped...or was I willingly caught?!  The big menu board was in front of me.  Seductively swaying in the cold rain, I was mesmerized.  I ordered, I paid. I picked it up at the next window. \nI hoped no one I knew saw me.\nBack at the office, I took a bite of Dave's Single Special Combo with Cheese.  Better roll than I remembered.  Was that burger a tad more tasty?  A bit too salty.  Fries  lacking spine to hold straight, and bending like a willow branch in the wind. Also too much sodium chloride.  \nIn a world in which Burger Culture has evolved several generations from Wendy's to Five Guys and Cheeburger Cheeburger, how can the poor little lass compete.  \nIn truth, she probably can't, except in those moments of weakness when no other lover is around, and she offers her tiny hand with a vanilla frosty.",
    "date": "2013-02-08 20:18:43"
  },
  {
    "review_id": "uJqMmC7qKIfR4zgrukUtVA",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "-ygugwY5-_bYrOwN_jo9Ag",
    "stars": 2.0,
    "useful": 16,
    "funny": 8,
    "cool": 11,
    "text": "TWO SLICE LUNCH REVIEW\n\nStopped in to Special Pizza City on Olden Avenue Extension in Ewing, NJ, today for a quick lunch on a beautiful day. Plenty of parking, but a surprisingly small footprint inside with tables crowded together requiring side sliding to reach those against the wall. \n\nI asked for a regular slice and one Brooklyn square, well done. Order taken with a smile. Seven dollars and change. Looked good on the paper plates. Bigger than average. \n\nThe undercarriage of the plain slice was thick and held the topside firmly. First bite was a heavy crunch through a thick crust and formidable layer of cheese. Nice, but neither the crust, cheese, nor red sauce layer had much flavor. The balance of cheese and sauce was out of whack, with way too much yellow and too little red. Then, half way through the wedge, the molten cheese separated from the base and slid in a gooey mass on to the plate.\n\nEnd of that mess. \n\nThe Brooklyn square was better, but not enough to save the overall experience​. It did not fall apart and had a somewhat better flavor profile, with fresher mozza and basil added on top.  Still, the taste was weaker than available in better Italian tomato pie parlors. \n\nTrenton has some great pizza shops. This is not one of them.",
    "date": "2017-04-04 15:03:45"
  },
  {
    "review_id": "MsiV7rTOXDDkh0U7DvztMw",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "b1mID_jaz46GCGO1RFZkGw",
    "stars": 2.0,
    "useful": 1,
    "funny": 0,
    "cool": 0,
    "text": "Dominick's Pizzeria is in the Anchor Crossing Center at the intersection of Rt. 413 and Windy Bush Road in Wrightstown, so don't be confused by the Newtown address shown in many places. \n\nThe entire center was eerily empty on a late Sunday in August. Only Dom's and Happy Panda were open for business. We stopped in for a light bite on the way to Doylestown's County Theater.  I couple of slices of regular pizza and an ice tea were inexpensive at under $5.50.  Friendly counterman. Clean shop. \n\nThe pizza came out of the reheat oven quickly and the cheese had nicely remelted. After sprinkling on crushed chili pepper flakes and allowing some excess oil to drip onto the paper plate the first slice was lifted, folder lengthwise, and brought to mouth. The slice held its form well, with firm crust reinforced by the vertical fold. First test passed.  The tip was hot and the bitten off tip was pleasantly crunchy.  Second test passed. After that, however, the grade began to slip.  The taste test was a weak result, as the sauce was bland and the cheese undistinguished.  It was pizza, but not a strong contender for top rank. \n\nThe second slice compounded the issue by failing to hold form after folding, and sagging in the middle before the tip could be bitten. But, for the chili flakes, the slice would have really left too much to be desired. With the added heat, it was adequate and filling, if uninspired. \n\nCompared to the other alternatives in Newtown, just a few miles down the road, Dominick's pizza falls below Marcos and Newtown Pizza, and at approximately the same level as Dolce Carini Pizzeria. \n\nI will return to sample other parts of the menu, but I am in no rush to do so.",
    "date": "2013-08-26 03:27:27"
  },
  {
    "review_id": "pjrsfwPi_jxYDMxr5r7a2A",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "WBBLE9LmkaBeGPvpubOeWQ",
    "stars": 2.0,
    "useful": 44,
    "funny": 25,
    "cool": 35,
    "text": "Maybe I should have known better when I walked into Pasta On Time, and it was empty of customers. Or maybe, the awful acoustics of the walls and ceiling and loud TVs should have been a tip off that this may not have been the greatest place for a sit down meal. Regardless, I miss those cues, and ordered a full meal of chicken francais, pasta, salad and twist rolls for consumption on the premises.\n\nIt wasn't all bad, but neither was it possible to really enjoy it, given what was served. The salad was okay with balsamic vinaigrette, and it can be forgiven that they used iceberg rather than romaine. The FDA had advised throwing all romaine out until they determined that only lettuce from Central California was the source of dangerous leafies. And, the twisted rolls were also pretty good, although two small pieces seemed a little light in the generosity department. \n\nNo, the problem really began and ended with the chicken dish. While the three fillets were sautéed well, the sauce was from another planet. Rather than real lemon and white wine mixed with butter in proper proportion to make a delicious sauce, this combination seemed to use reconstituted lemon juice, no wine, and perhaps salted butter. The result was a awful tasting colloidal yellow soup with a strong bitter lemon flavor that sat on my tongue until I got home to brush my teeth free of it. Rather than savor the taste of my favorite Italian dish, I had to remove as much sauce as possible from the chicken, and avoid the spaghetti beneath all together. \n\nMaybe a sandwich would have been the way to go, but some of the reviews say otherwise. What was clear, was that the kitchen didn't know how to make this meal, and followed a recipe that lacked any finesse, along with the absence of wine, lemon fruit and sweet butter. \n\nIt was a complete whiff. \n\n\"Pasta On Time,\" or, Pasta No Time?",
    "date": "2018-11-27 17:10:15"
  },
  {
    "review_id": "OpiXs4liWSNW5dlAjAjIow",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "Cwispyyye-WIGql9RmBfvQ",
    "stars": 2.0,
    "useful": 30,
    "funny": 16,
    "cool": 21,
    "text": "This BK sits out on Nottingham Way next to China Express, part of the new commercial zone being developed at the old fairgrounds site. It is designed for drive around service, with a dangerous nod to in house dining. To walk in requires crossing the drive through lanes where most drivers aren't paying attention to pedestrians. \n\nThe drive up ordering system needs help because it is difficult for driver and ordertaker to understand each other. I could not hear what the young guy was saying to me, but it was apparent he didn't hear me well either. I repeated myself three or four times and hoped for the best. I was pleasantly surprised that I received what I asked for. \n\nI ate at my desk. The breakfast croissant sandwich was small, but decent. The coffee just mediocre. Prices were very close to what is available at the many delis, cafes and morning taverns in the area, so unless time is at a premium, I prefer the other alternatives for higher quality and comfort. \n\nSearching for a word to capture the experience, \"uninspired,\" seems about right.",
    "date": "2018-02-03 02:17:33"
  },
  {
    "review_id": "vf76WUJcCEfdxDqJf9m_kQ",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "zOJTw_xxGYl-z-saJJ964g",
    "stars": 2.0,
    "useful": 12,
    "funny": 4,
    "cool": 3,
    "text": "This Mario & Franks in Fieldsboro, NJ, is much smaller than number 4 in Trenton, but is nicely finished with a small, but comfy dining room.  Service is fine and prices on lunch specials are downright inexpensive.  \n\nSo, when I saw a Chicken Parm Sandwich with Fries and Drink for $6.99, I was tempted.  Unfortunately, the excitement turned to disappointment once I dug in to the huge plate that was served.  Biggest hot sandwich I had seen in a long while.  At least a foot long, cut in half, and a pile of taters that took up the other half of the large square platter. \n\nTo my tongue, the chicken fillets had been frozen and deep fried, rather than pan sautéed, which is the right and tasty way to cook it.  Maybe cheaper to use frozen chicken and fry alongside the potatoes in a vat of common oil, but it sure kills the expectation that comes with ordering any parm dish.  Really did not taste good. \n\nThis was a shortcut to Never Never Land.",
    "date": "2016-10-29 18:37:51"
  },
  {
    "review_id": "_CKIDxVJBDmQyoAMULbFcA",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "eBQd3DwWtW9UE-g_WNC3zg",
    "stars": 2.0,
    "useful": 12,
    "funny": 3,
    "cool": 3,
    "text": "Not sure how Chickie's & Pete's is considered a café, as it seems much more like a dark and dingy sports bar with a huge collection of tap levers hanging from walls and exposed beams.  There seems to be plenty of suds to choose from, and the menu is adequate, especially if you like shellfish as your main course.  \n\nProblem here is that there are no side dishes with your meal.  Everything is a la carte, and the expense climbs rapidly.  If you want a beer with that, your tab will gouge you at least $15 for a sandwich lunch.  \n\nMy Chicken Parm Sandwich was pretty good; deep fried and crispy outside, still soft and tasty inside.  The Tomato Sauce was mildly salty, but still a good blend.  Would have been even better if they figured out a way to give a small amount of Crab Fries with the platter, rather than charging another $7 for a full basket of taters.  The House Salad @ $10., was a large plate full of Romaine and some other veggies, and a reasonably good vinaigrette, but underwhelming at the price. \n\nIf you're into tired looking sports bars with ample brew (not necessarily craft-quality), and a menu that forces you to be very selective about the cost of your nosh, C & P is for you.  Otherwise, there are much better sports houses around with better food, drinks, atmosphere and prices.",
    "date": "2015-12-04 21:27:26"
  },
  {
    "review_id": "qUjIGyHxJs61cWRTcSkSBQ",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "ws8ltnaTw9MJuF6fZehOVQ",
    "stars": 2.0,
    "useful": 6,
    "funny": 2,
    "cool": 3,
    "text": "I should have been alerted to the possibility of issues when we walked in near 7 pm on a Sunday evening, and only a few tables were occupied and, none were Chinese.  Yet, I was with my Chengdu friend, and we wanted some authentic Szechuanese hot chow.  How could a place that calls itself, \"Traditional Szechuan,\" and has pandas in their signs, not be prepared to satisfy a true native soul?  \n\nIt wasn't.  \n\nEven while the owner sat with us and chatted away about home, the staff delivered our dishes in no particular order and spread them out across our table.  I guess he trusted the kitchen to do everything right, but in retrospect I would have preferred him sweating over the stove assuring that everything presented would make us happy.  \n\nThe Dumplings in Chili Oil were large, but tasteless.  The Cold Sliced Beef in Hot Sauce, a delicacy at home, was over salted and gristly, rather than approaching the numbing spiciness desired.  The Fish Fillet with Dry Pepper was the best dish on the table, and the only one that we did not finish and agreed to take home.  The 3 Mushrooms Rice Cake Style was basically a mushroom consume poured over rice cakes prepared to sizzle.  It was decent, but nothing I would want a second time.  Water Spinach with Garlic was fine, but a bit too stemmy when the leaves are the tender delights. \n\nGiven the excellent Szechuan kitchens in the neighborhood (Emai, Four River, Spice-E), and those a little farther afield (Han Dynasty and Chili Szechuan), it is difficult to see how this place will survive.  As we were the last customers in the joint when we left at 8:30, its fate may already be sealed.",
    "date": "2015-05-12 20:47:03"
  },
  {
    "review_id": "4u_FUZZitsAsdfIRAiq1qg",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "tND-bS0sECbWI8GVMFT_MA",
    "stars": 2.0,
    "useful": 19,
    "funny": 12,
    "cool": 12,
    "text": "This was going to be a one star review until management slightly redeemed itself at the end. \n\nThe story begins when I walked into this Modern Vac & Sew Center on Grant Avenue in Northeast Philly, in need of a power cord and foot petal for a Amazon purchased Singer machine that was delivered by the seller without those parts inside the box.  He didn't have them, and left me to my own devices to find where I could.  Good luck to me!\n\nThe folks here looked at the machine and said they would order the parts. They took a $20 deposit.  No sweat. A month later, no call from them, so I rang them up to inquire, and was told the parts had not arrived.  Seemed excessive, but what do I know from sewing machines?  In the meantime, I decided to make a second attempt to find what was needed, and realized there was a local sew and vac in town.  The good people there also checked the machine and thought they could help with securing what was needed.  I told them about the situation, and agreed to only see if they were available, without ordering until I had finished dealing with these guys.  Reasonable strategy.\n\nTwo weeks later, still no word, so, I went down to Grant Ave. again.  I asked for status, and the employee there could not tell me anything.  He looked around the shop, but found no parts, nor order for them.  I asked for my deposit back, but he declined to do so before talking to the boss about whether the parts had been special ordered and paid for in advance.  He promised he would call me in two days.  I wasn't happy about leaving without the money, but I calmed down and realized this dude was doing the best he could in these circumstances. \n\nWhile I waited, I decided to buy the parts the hometown shop had located at a fair price. Intuition told me this place would not come through for me.  \n\nTrue to his word, the man at this store called to let me know I could have my deposit back.  He saved a star, and proved himself to be an honorable fella.  Can't say the same for ownership, who never saw the need to contact me about the status of the ordered parts, even after I called to ask about them. Not great customer service. \n\nCan't read his mind, but he can read this review.",
    "date": "2017-03-31 14:34:43"
  },
  {
    "review_id": "1tgG5QcXT4XFD8N0kWMS1w",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "nqQNnIAAfRa1dla5N3UiuA",
    "stars": 2.0,
    "useful": 3,
    "funny": 1,
    "cool": 1,
    "text": "Strictly take out with $10. minimum for credit card purchase.  \n\nThe menu is extensive, both Chinese and Sushi, and the prices reflect the absence of tables and service expenses.  The front of the menu has a nice statement about healthy eating being their goal, and that the food is all natural, low calorie and how it is the, \"only specialty take out serving authentic Chinese & Japanese in this area.\" \n\nMaybe, but what they do not claim is that it is tasty or high quality cuisine.  Sadly, speaking only of the Chinese side of the menu, it is not.  The ingredients may have integrity, but the resultant dishes are ordinary and lacking in most redeeming qualities other than being filling. The food isn't bad, it just isn't very good.  \n\nI wouldn't attempt to compare it with the food produced in New York or Philly, but even by the rather pedestrian suburban standard, Lotus Garden hardly measures up to its peers.  \n\nIt may offer gluten free dishes, but by the same token, it also offers tasteless ones. \n\nBest to keep looking for a more satisfying fast Asian meal.",
    "date": "2013-06-12 19:49:06"
  },
  {
    "review_id": "DTsAvDLmRFWikYk7GC0tJg",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "zJoT9gFvGtZAhbdcIF4Xmw",
    "stars": 2.0,
    "useful": 1,
    "funny": 0,
    "cool": 0,
    "text": "I have visited four BWWs around the country;  Chino Hills, CA., Flagstaff, AZ., Northeast Philly, and this one.  Not that this is a representative sample, but in my mind, this one is on the bottom of my list.  The distance between locations is matched by the yawning gap between this experience and the others.  \n\nThe shop in Flag is large, clean, and a fun place to sit at the bar late into the night while drinking a broad selection of beer and well presented wings and burgers after a run to the Canyon.  Chino Hills has a different sensibility with a more Latin and Asian clientele, but just as much entertainment value and food quality.  Northeast Philly has none of the above, but a more tie off/working stiff/biker vibe, where you can still grab a stool and hang with the boys.  But, the former Don Pablos feels helter skelter.  Perhaps, the ghost of the former tenant haunts the room.  Still, the loudness of the music overlapping the glaring TV's , and a large step down in service and cuisine quality, make this a disjointed, cacophonous experiment.  Hard to converse, nor enjoy the subtle differentiation between the BBQ sauces. The burgers never come out Medium.  Well Done is the seeming only option. \n\nWhile I wouldn't mind the \"pay for the label\" approach to BWW when the atmospherics are working well, when they don't, the price seems unwarranted and absurd.  As someone who has enjoyed the experience elsewhere, as well as a happy former stockholder, I suggest management get a grip on the quality control issues here, and bring the operation into line.  \n\nOtherwise, change the name to protect the franchise.  How about, \"Bungalow Wild Winks?\"",
    "date": "2014-02-18 04:49:41"
  },
  {
    "review_id": "DJ_d9N8aBSTf0F7kKWIwAw",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "rOZ-_gjeLsjkdkyh1D8y_g",
    "stars": 2.0,
    "useful": 12,
    "funny": 4,
    "cool": 6,
    "text": "No doubt the Trenton Pork Roll Festival could have been something special given the concept and all the vendors and bands that showed up. However, the word is that 2,000 people invited themselves for a 300 person party, and the logistics were just not capable of handling the scene.  Too, a massive thunderstorm in mid afternoon blew out the electricity, shutting down the bands, and dousing everyone and their pork roll sandwiches. The canopies were not able to control the deluge.  \n\nI was there for a few minutes in early evening after the last of the heavy downpour, but not post the straggling showers that seemed to hang over Trenton Social all day.  After standing in line and getting soaked, I decided discretion was the better part of valor, and beat a retreat to find a dry place for dinner.  \n\nPlease try again next year, fellas.  You are on to something here.",
    "date": "2014-05-25 17:36:36"
  },
  {
    "review_id": "qC16PN7ZDc9HbOossOFx2A",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "BmJ8McyzOqzIucnJTOAGPg",
    "stars": 2.0,
    "useful": 16,
    "funny": 16,
    "cool": 12,
    "text": "Two Slice & Coke Review\n\nI was hunting for a missed dinner nosh to spare me those overnight hunger pangs, and Fat Tony's appeared on my Yelp radar. Not many reviews, but you know what they say about 'any port in a storm'. \n\nFat T's sits in a small commercial strip right next to an excellent new member of the Morrisville restaurant community. Big window permitted full view of the house with only two deuces on the floor. Clearly a take out operation. But, I like my pizza well done and right out of the oven, so I sat down to await my first bite of Tonypie. \n\nIt wasn't what I hoped. \n\nAlthough well done was requested, what I got were two slices without firm chassis that refused to lift off the paper plate when I elevated their crusty end. Saggy and limp. I had to pick up the laggard points and throw them over the thick end, making them more pizza roll, than pizza pie. \n\nThe sauce had promise, but if my slices can't salute when called to attention, they can't serve in my tomato pie army.",
    "date": "2016-12-11 13:58:45"
  },
  {
    "review_id": "fu2UKOnEq2zbF0CLmSRzGg",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "LnN94-sJc8U6shh_i0oclw",
    "stars": 2.0,
    "useful": 15,
    "funny": 0,
    "cool": 3,
    "text": "Aside from the historic appeal of old railroad cars, New Hope & Ivyland Railroad has nothing going for it. It is a very short run at a very slow speed for a very high price.  I hesitate to label it a tourist rip off for the unaware, but it comes close.  \n\nThere are much better alternatives if your want a railroad experience.  If the train ride itself is your reason for going to New Hope, save the time and money and take the Light Rail from Trenton to Camden, or stops in between.  That is an actual passenger commute that rolls along the Delaware River for a while, and stations in some pleasant Jersey towns, like Burlington.  Last stop is the Camden Aquarium. If old railroads are your thing, make the day trip to Scranton, the old railroad capital of the USA. Plenty of museums and operational locomotives pulling plush Pullmans and a working roundhouse. \n\nThe NH & I experience will likely leave you feeling disenchanted.",
    "date": "2014-06-23 23:56:43"
  },
  {
    "review_id": "ScAkt5Yd_nqh8HDBBV5mdQ",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "p-3RWKdkAs41FuZJKb_KLA",
    "stars": 2.0,
    "useful": 13,
    "funny": 10,
    "cool": 5,
    "text": "I needed to return my Dish Network \"box,\" and the instructions received with a shipping container said that a UPS Store could handle the job, and that Dish would cover the cost.  So, I boxed it up with the remote, taped it closed, and drove over to the local UPS Store in the Summit Square Shopping Center in Langhorne, Pa.  \n\nI walked in around 5:30 pm.  The time sign said it was open until 6:30 pm.  I was the only one there, and I did not see an employee until I was near the counter in the rear of the shop.  At that point a woman came out from the back area to see what I wanted.  She saw the box and the telltale return shipping label.  \n\n\"You want me to take that?\"\n\n\"Yes, please. Can you handle this return to Dish?\" \n\n\"We can.\" \n\n\"Great. Thank you.\"\n\nI placed the box on the counter, and she grabbed it, slid it over the weighing scale, and pushed it to the side.  \n\n Not another word was exchanged between us.  No \"thank you for your business, nor \"have a good evening.\"  She seemed mildly put off that she had to do something without direct compensation from me.  I guess this project didn't deserve any courtesy.  \n\nI shouldn't complain unless the box doesn't arrive at its destination.  But, for all she knew, I planned to return tomorrow with a truck load of business for her. \n\nNot!",
    "date": "2016-07-12 14:54:06"
  },
  {
    "review_id": "Eapxbopchq3B2AdJcnySWQ",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "5f7-8ijCfpxwDg_q0Jfinw",
    "stars": 2.0,
    "useful": 15,
    "funny": 6,
    "cool": 8,
    "text": "Johnny Apples sits at the bottom of Buck Road, just above the stream that runs through this valley into Neshaminy Creek.  It is a surprisingly large house, with bar and dining room running the front of the building, and a nice patio in the rear. It is casual and comfortable.  The beer list is relatively simple, and the menu offers traditional American fare.  We came in for dinner on Tuesday night when there were few people dining, and only two or three at the bar.  It was cool, and it felt great to get out of the suddenly oppressive heat enveloping southeastern Pennsylvania. \n\nWe ordered a cross section from their offerings.  Avocado burger with fries, blackened shrimp with mashed potatoes, and \"The best meatloaf you've ever tasted,\" with taters and string beans. While all looked good upon arrival, none really lived up to our hopeful expectations. The burger was a previously frozen puck that was cooked beyond the medium requested, and lacked taste and texture.  The cheese and avocado registered, but the beef was not juicy, nor flavorful.  Their fries were the type with extra starch applied to make them crispy. They were not to our liking.  The six medium sized shrimp were grilled well and had good taste, but were not \"blackened\" with enough spice, nor exposed to mesquite coals to bring up the special blackened flavor.  They were well prepared without that, but  for $19 we looked forward to more. Finally, the \"best\" meatloaf, wasn't.  It was overly dense and baked far too long.  It was dry and burnt in part, making the pockmarked surface look like a rock sample from Mars.  The sauce was overly salty.  The potatoes and beans were fine. \n\nCould be that we came at Johnny Apples the wrong way.  Perhaps, the apps alone with beer was the way to go.  Nice things have been said about their wings.  Regardless, we experienced a less than compelling meal that would deny a  good reason to return.",
    "date": "2017-06-15 19:51:23"
  },
  {
    "review_id": "u9WrstZrUAhipF-ojleMMA",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "QYks6LHomkyctLwD5Lfmeg",
    "stars": 2.0,
    "useful": 49,
    "funny": 27,
    "cool": 36,
    "text": "I really like the imagery Blue Ocean creates in my mind. Cool tropical island daylight. Fresh air. Clean water. Right off the boat fish for filleting into optimal sushi. Who wouldn't want sashimi or exotic rolls made from the best sealife available? Poetic license can be effective in selling a restaurant to consumers, but actual execution is what matters most. \n\nThis location is making a third attempt at Asian kitchen success. Yummy Sushi was here for several years before moving to the College of New Jersey neighborhood. Fame Dish arrived next, claiming to be an Asian fusion house, when in fact it was primarily Chinese with a wave to Thai, Japanese and Viet cuisine. It was gone in a year, because it was more confusion than actual fusion. Now Blue Ocean has taken over with the promise of sushi done right, plus a menu covering a lot of dishes from The Land of the Rising Sun. \n\nFirst, it seems that management is Chinese, and that the sushi chef speaks Mandarin. So, sushi culture is not spoken as a first language. Still, the preparation and execution can excel with well trained hands and high quality ingredients. Second, it seems they are following the course of most such houses by duplicating the menu prescribed by graduates of Sushi University - limited high quality fish and lots of rolls with clever names; generic soy sauces, and gloopy ginger salad dressing. No creativity is possible with poor basic ingredients. \n\nI ordered a spicy Salmon Roll and chicken katsu, to sample two aspects of the menu. The chicken came as a dinner with choice of soup or salad. Two deep fried spring rolls were brought to the table as a complement. Nice touch. The salad was all iceberg with a few carrot shavings. The dressing was that poor quality ginger mash. The lettuce hadn't been fully sliced, so a lot of it was still one piece and difficult to collect with only a pair of chopsticks. The 8 piece roll was okay, but not the freshest. Finally, the katsu was two thin cutlets, breaded and deep fried with a good dipping sauce. Sadly, it was cooked just beyond the point where it was juicy throughout. Liked the crunch, but not enough to want to eat all of it. At $17 it was a pretty big miss. The spring rolls were solid. \n\nI hope Blue Ocean understands the issues and really wants theirs to be a first class sushi house. They can certainly make it so if they don't accept shortcuts and focus on quality across the board. \n\nWishing them insight and excellence.",
    "date": "2018-11-05 16:03:53"
  },
  {
    "review_id": "3FZOVJq085_hOrdS5ZS8CA",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "X9S2ofsW-VnVvF4vEcjkBQ",
    "stars": 2.0,
    "useful": 18,
    "funny": 6,
    "cool": 9,
    "text": "LUNCH MENU ONLY REVIEW\n\nPeking House on Makefield Road, Yardley (actually, Lower Makefield), Pa., sits in an older strip center that also houses RJ's Bagels and a couple of nail salons.  So, if you want to have some Chinese takeout while having a pedicure this is your special place.  \n\nOtherwise, the grub here is pretty standard fare for Chinese/American joints.  It relies on take away business, with only one table and service for eat ins in the same takeout containers.  They were able to boil water for hot tea, which so many these days just refuse to offer.  It was appreciated.\n\nMy lunch special was pork egg foo young, with fried rice and wonton soup.  The soup was the weakest link.  The dumplings were thick skinned and were filled with some meat thing that had little taste.  The broth was likewise, flavorless.  The pancakes were decent, with plenty of veggies and thin strips of pork.  The brown sauce was a bit too cool and had congealed in the plastic container. No Thanks!  The rice was made at some point in the past with a yellow dye  bouillon, but was too hard and past its prime.  \n\nThere may be some better things on their menu for dinner, but as this isn't in my neighborhood, I am unlikely to find out.",
    "date": "2017-04-07 15:21:02"
  },
  {
    "review_id": "XJfII7WzxLMaAZqvOmRduQ",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "I79keuDOkqf1CFjYDMRMNg",
    "stars": 2.0,
    "useful": 35,
    "funny": 14,
    "cool": 23,
    "text": "Aldo's Pizzarama on Bustleton Avenue in far Northeast Philadelphia has been at the same location for a couple of generations, and has the reputation for making the best pie in this part of the city. Perhaps, it has changed hands since those opinions were expressed, but it was not our experience when we stopped in for dinner over the weekend. \n\nThe guys behind the counter, although not busy, seemed unwilling to crack a smile or offer any service beyond taking our order and shouting out when the pizza or steak sandwich was ready, for us to pick up and deliver to ourselves. No silverware, no napkins, no courtesy offered. \n\nMy son liked the steak, but said it was not worth the drive to have it. The pizza looked great with crisped sausage slices and well done crust. The problem was the overuse of cheese out of proportion to the sauce. It was such a heavy layer that the undercarriage could not support the topside. Lifted from the outer edge left the center of the slice on the aluminum pan with its contents sliding off. The work involved in folding the slices allowed us to taste how salty the cheese and red sauce were. Just not a good pizza, despite the decent crust. \n\nWon't be back.",
    "date": "2018-08-21 15:32:11"
  },
  {
    "review_id": "9d4JNHyaZF7y6OZ3XuZwPg",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "rA4a1Caw9pv-4ZHU1nCXiA",
    "stars": 2.0,
    "useful": 52,
    "funny": 27,
    "cool": 41,
    "text": "The key to understanding the Bagel & Bread House on Horsham Road is hidden in plain sight. The shop is quite small, and all you see are wire bins of bagels and a self serve coffee shelf, but not actual \"bread\" shown for sale. Nary a loaf in sight. \n\nWhy is that? \n\nBest I can ascertain, at this business they are one and the same. A bagel is bread is true, but by that generalization, so are crackers and pita. Simplistic, but telling. While all bagels are bread, not all bread are bagels. Perhaps, by such gross definition, you don't focus on the doughy fact that you can make bread look like a bagel, but it may not actually be one. To my taste, this is what occurred here. These round wheels are perfect facsimiles of bagels, and look great. Still, by taste and texture they are not bagels. They are bagel-like bread creations that have neither the consistency, nor taste/texture of the real thing. It's not that they are bad, but more a surprising disappointment that upon first bite, reminds of sliced sourdough or rye, more than a properly boiled and baked traditional delicacy. \n\nSo, the best I can conclude is that at this establishment bagel and bread refer to the same thing. Problem is, there are no real crisp skinned, flavorful insides, light or dense, boiled and baked goodies here. Only bread in the form of bagels. \n\nSome like them, but not worth the trip if real bagels are your preferred destination.",
    "date": "2021-06-27 15:25:36"
  },
  {
    "review_id": "lqWyFe3f5cJoEGmKrOE54Q",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "Jo2zJoA818OmbiE-6HfghA",
    "stars": 2.0,
    "useful": 56,
    "funny": 30,
    "cool": 34,
    "text": "Maybe it was because I was there on a Wednesday evening, and the dining rooms were not crowded, mirroring the condition of the large buffet displays which were likewise limited in choice to few main courses, sides, breads and desserts, but there really wasn't much to enjoy about the dinner options that I had just paid in advance to consume, sight unseen. While $20 might have been reasonable for repeat visits to the buffet tables, that value proposition was shot to shit if the first rule of buffet dining was not accepted by the diner. \n\nBe prepared to chow down in extremis, or the whole thing is a waste. Healthy dining this is not. \n\nA half gone tray of meatloaf with choice of light/dark gravy, large pile of fried chicken as the only protein; a few macaroni/cheese elbows, Penni broccoli, mashed, stuffing and was that yams(?) as the heavy carb offerings, along with some nondescript bread; followed by copious amounts of jello, pudding, cookies, cheesecake squares and one last slice of dried out raspberry pie - all amounting to a heavy lugubrious carb centric plate. I neither wanted more after laboring through the first, nor would it have been wise for me to have attempted another helping. \n\nBeside that, that raspberry pie lacked any berries, but was a purple sweet colloid held in dry tasteless crust, and thus, without redemption. \n\nI just can't consume like that, nor was I really tempted to do so. But, I learned that my hunger is nothing compared to what the Golden Corral crowd is capable of.  Perhaps that explains why almost everyone there wore elastic waist sweatpants. They knew what they were there for, while I learned the hard way that it doesn't pay for people without that corpus and habitude to so indulge. We should know that the experience will be largely wasted on us. \n\nPass the Pepto, please!",
    "date": "2021-12-16 23:52:21"
  },
  {
    "review_id": "bDzRoGa3Cren7Mib7bDI2g",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "9pr6rI87hZTCIAnFGNnvzQ",
    "stars": 2.0,
    "useful": 40,
    "funny": 23,
    "cool": 26,
    "text": "Decent chicken salad sandwich, but the place is really dirty. Sat at a small table downstairs in their basement shop. The cracks in the red paint were black with grime and lack of strong cleanser for too long. Same for the floor and back shelves and undercounted storage space. \n\nNeed to do better and care more, even if never inspected by L & I.",
    "date": "2019-11-20 04:07:32"
  },
  {
    "review_id": "TiPn5FSHgbZTSZk_u7-xjg",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "b3JrqlryZf2Y24i63oGvFQ",
    "stars": 2.0,
    "useful": 35,
    "funny": 20,
    "cool": 31,
    "text": "I was looking for a place where I could have both a foot massage and get some body work for my aching back. H A Foot Spa on Bridgetown Pike, Feasterville, advertised that combination for a 90 minute session at a reasonable price. Website photos showed a room with large recliners used for leaning back with feet in a bucket of herbed hot water, so it seemed they knew what to do. \n\nWell, not exactly. \n\nMy private room was well appointed, and the masseuse pleasant, but she wasn't very skilled in Chinese massage. I asked for a strong technique, but she couldn't do it. Little pushing, digging nor probing with hands, elbows nor forearms. Little stretching of my limbs. On the other hand she did use hot rocks on my shoulders and lumbar, and hot towels after oiling my back and legs. It wasn't bad, but more strength as requested would have been better. \n\nThe bigger problem was that I must have misunderstood what they meant by combo foot and body work. Many past experiences provided 30 minutes off the table and in a recliner with foot bath and heavy hands on feet. Disappointed that never happened. In place of a real foot spa exercise, I remained on the table and was given a weak massage for about 20 minutes. A real foot massage is strong, digging and often a little painful. This was far from that. This felt more like going through the motions. \n\nI will return to my regular foot spa down on Bustleton Avenue next time. They only offer chair massage as part of the hour, but they are expert in what they do.",
    "date": "2018-12-25 17:07:37"
  },
  {
    "review_id": "trvzSmCv7s_WOeJliWqdYg",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "BwGu7t-klhKiAN7T83iJBQ",
    "stars": 2.0,
    "useful": 9,
    "funny": 2,
    "cool": 4,
    "text": "East China Restaurant in the Giant Shopping Center in Morrisville, Pa., may have been in operation for a long time...and, it shows.  \n\nFirst impression upon entry is of a large buffet table (empty at night), torn carpet, dim lighting, and a desperate need of a makeover.  The temperature is lower than comfortable as demonstrated by the hostess/owner wearing her coat as she seats and serves.  This may be primarily a take out joint, but the large dining area belays that, and a few of the other reviews reflect dining in experiences.  \n\nMy light bite dinner of Wonton Soup (I ordered Hot & Sour Soup, but what the hey...?!), and Fried Dumplings was average.  Chicken Broth with standard yellow dye, thick wonton skins and a meat filling that was lacking taste.  Same for the Dumplings, with the exception of the dipping sauce which I doctored with chili sauce requested for flavor.  \n\nEast China feels and looks rundown and in need of a bright facelift.  The owners seem content to do the minimum required to keep the doors open without real concern for customer satisfaction nor comfort.  \n\nThere are better Chinese/American houses nearby more deserving of your appetite.",
    "date": "2016-03-10 16:25:17"
  },
  {
    "review_id": "5X1jcJNv_bXJwwEaANcszw",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "8shFr1Aa9FA-XddxzAhV1Q",
    "stars": 2.0,
    "useful": 5,
    "funny": 5,
    "cool": 4,
    "text": "This is strictly a two slice and a Coke review.\n\nMaybe it is just the luck of the draw that I walked into Aquilone's Cucina in the H Mart strip center only a few days after having one of the best Tomato Pies in my life over in Jersey.  Or, maybe it was because that unique experience fostered my desire to duplicate it in a new place.  Regardless, I was hungry and decided to eat something before going shopping in H Mart on an empty stomach. \n\nAquilone's is a fairly large joint with room enough for close to 100 people.  The colors are predominantly yellow and brown, and on a rainy day seemed to mirror the overcast darkness all around.  I ordered a slice of regular pizza and one with Italian Sweet Sausage and asked them to be reheated long enough to be well done.  \n\nWhen they arrived on a large plate (so much nicer than being handed pizza on paper plates), they looked good and heat was rising off of them.  I wasn't provided with utensils, and when I attempted to pick up the first slice, it immediately drooped over from the weight of the cheese and the fact that the center of the crust was not really very hot.  Too, oil dripped off suggesting that the crust was in fact somewhat soggy.  \n\nThe taste was fairly good, but it was obvious these pies had been on display for a while, and had lost their life force. The same was true for the Sausage slice.  Quality meat, yet the cheese and sauce needed more refreshing than a turn in the oven could provide. \n\nPerhaps, I should know better than to go for a late two slice lunch when the available pies have been around too long.  But, I did not want to ask for a new pie to be made, and there are shops that routinely put together new pizzas for the by the slice crowd every few hours so their wares don't lose their verve.  \n\nNice folks. Good service.  But, these slices were past their prime.",
    "date": "2015-10-04 14:12:57"
  },
  {
    "review_id": "XJo-N1YreM1anxGX59DZ3A",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "_5vE7CRfcUPHLIDixqtrMg",
    "stars": 2.0,
    "useful": 3,
    "funny": 2,
    "cool": 2,
    "text": "All malls are dinosaurs waiting for extinction. \n\nNeshaminy is no different.  Aside from the entertainment value of the AMC theaters, there is little to recommend it.  After ruining Main Streets around the world with large parking fields and lots of meaningless choices, they are now suffering the same fate. \n\nPeople are \"Malled Out!\" \n\nWe want something more integrated into our communities; part of our social fabric, not something standing alone and uninvolved.  The next generation will be synthetic villages.  Smaller shopping markets clustered together and surrounded by neighborhoods, schools, parks, hospitals,  employment opportunities, and good roads leading to the rebirthed urban centers.  It is called by many names, New Urbanism, Post-Modern Cities, Back to the Future, etc. But, it is definitely coming. \n\nThere are examples of this next utopian model around the world, and if you find one be sure to investigate.  \n\nI, for one, am excited for the chance to return to a future full of the elements that made earlier societies function efficiently, while adapting the best that technology and science have to offer.",
    "date": "2013-11-10 16:41:26"
  },
  {
    "review_id": "sPIDLCcNuBaXBNN5v1W_Jg",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "0PxMeIT6Tj1MH2jip5spMw",
    "stars": 2.0,
    "useful": 0,
    "funny": 0,
    "cool": 0,
    "text": "When it comes to coffee there are three main ingredients: 1. the coffee, 2. the water, and 3. the maker.\nAt Dunkin Donuts the constant is the coffee.  The makers are all trained in the same methods and everything comes packaged for ease of use.  That makes the quality of the water the primary variable. \nFor some reason, the coffee at this DD tastes different (in a bad way). It is harsh and leaves a bitter aftertaste.  It must be the water, because the nearest other DD in Lower Makefield near the Hampton Inn does not have this problem, but they are serviced by a different water company.\nElementary, my dear Watson...",
    "date": "2013-01-21 14:50:46"
  },
  {
    "review_id": "VjnIrA_PDjbFKZKJ9-ynCw",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "dTanJ1xm9-B-iqEWJodpZQ",
    "stars": 2.0,
    "useful": 8,
    "funny": 2,
    "cool": 3,
    "text": "Worst pizza so far in my exploration of the tomato pie universe in the Trenton/Hamilton area.  \n\nAlthough visions of The Godfather played in my head, this is a very different branch of the Corleone family.  This is a tiny shop, with only 4 deuce tables within.  Take out or delivery is the business model here. That would be fine if the product made eating slightly \"delivery aged\" pie worthwhile.  I ate two plain slices right off a pie out of the oven, but my participation did not match my anticipation of the meal. \n\nThe slices came out on overlapping white paper plates.  I shook dried pepper onto them, made the fold in the crust to aid in pick up, and lifted.  The point immediately sagged as the underlying crust foundation was not firm enough to hold it.  As it flopped back to the plate, an inordinate amount of oil began to flow off the surface and onto the plate and table.  Not a good sign.  The visual was of a lot of cheese with little tomato sauce showing.  My first bites confirmed that this was more like a double cheese pie without much sauce.  The cheese was mildly salty.  The lack of gravy suggested that there would be no subtle basil flavor, which I prefer.  Such was the case.  \n\nAfter struggling with the chewiness of the excessive cheese, the lack of a balancing rich sauce with proper herbs, and a veritable drizzle of oil from both front and rear of the slices, I already knew this was not going to be my pizza place.  If the straight ahead plain slices could not pass muster, I wasn't going to try anything more complex.  \n\nOne nice positive - the zepps (fried dough dusted with powdered sugar) were amazingly good!  A bag of three came free with any purchase.",
    "date": "2014-08-21 22:34:59"
  },
  {
    "review_id": "7pg0mFe76ZSN4KGhB4qtZg",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "zLa1ItT12xW4gDmlHE0sIA",
    "stars": 2.0,
    "useful": 1,
    "funny": 0,
    "cool": 0,
    "text": "For some reason, I was sitting in this DD trying to check in on my mobile phone, and was told I was too far away!  I guess that depends on what dimension of reality you are measuring from. Or maybe, this is in one of those GPS warps, where the directions get lost due to cosmic interference. \n\nOtherwise, nothing special going on here. The coffee is only Okay (bad water?), but I have noticed a deterioration of DD coffee quality at many shops over the past few years. They really need to standardize the water variable, because without good water, the coffee beans can do little. \n\nMy son's basketball team was celebrating the end of their season here last night. The boys seemed happy with the Baskin Robbins, but I saw a dish of strawberry ice cream that was so red, I wondered what red dye farm it had visited before being consumed. \n\nLoved the company, but will live without their goods in the future.",
    "date": "2013-03-20 02:05:12"
  },
  {
    "review_id": "IElB9kWGWVkwBoCS9XDlaA",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "zcTJyMpHa3m9VXwTOAjmTg",
    "stars": 2.0,
    "useful": 16,
    "funny": 11,
    "cool": 14,
    "text": "After exploring the canyons of The Home Depot, we walked out into the cold dark gray sky. We were a little hungry after all the hiking and saw this Burger King on the edge of this shopping zone on Bromley Road. \n\nThe store was nearly empty @ 3:00, and there was no wait to order. Whopper meal and a double cheeseburger from the value menu. Easy. Right? Except, our order taker thought we wanted a second meal when we only wanted the sandwich along with the Whopper meal. Small miscommunication that was fixed with managerial assistance after the register froze. \n\nThe burgers were typical of BK cuisine. Adequate fast food. The Freestyle sodie dispenser was still fun. So many choices at my fingertips. Absent were any condiments on this side of the counter. No ketchup pump. No salt or pepper. No plastic utensils. I'm sure they had their reasons. \n\nThis experience wouldn't have been particularly notable if I hadn't been to another BK two weeks before in Pa (Oxford Valley), where we were literally treated like fast-food royalty, in a shop that even has a fireplace lounge, and a real personal touch.\n\nSpoiled us for future BK visits.",
    "date": "2017-01-18 13:02:09"
  },
  {
    "review_id": "J6LtR80ISupQez7g8GCixg",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "zJwhgTOLg6RbczAbKe9ovg",
    "stars": 2.0,
    "useful": 2,
    "funny": 1,
    "cool": 1,
    "text": "This is a review of Plain Pizza Slices served at lunch.\n\nWhile the reheat did a good job firming/crisping the crust so that the point held up and provided a firm bite, the remainder of the experience was somewhat of a letdown.  The sauce was on the salty side, while I prefer a sweeter, more basil flavor tone.  The cheese was ample, but without much taste to contribute to overall dining pleasure.  \n\nTwo slices and a soft drink came in under $7.00, but the same can be had a several other places for at least a buck less. \n\nReviews say that their cheesesteak is the way to go at Venezia, but when the standard tomato pie is so ordinary and uninspired, I would not elect to return to give something else a try.  There are too many better choices in the vicinity. \n\nVenezia does not make the cut for a quality pizza slice.",
    "date": "2014-06-29 17:52:25"
  },
  {
    "review_id": "GTPa25UVRzMcs5ivvB7qdQ",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "Hfv00bSvms_YLkJyQ5aC1w",
    "stars": 2.0,
    "useful": 46,
    "funny": 22,
    "cool": 29,
    "text": "Located on what has become a dead end on Mill Creek Road just before reaching the old Delaware Canal, the inn that shares its name with the road feels like it knows that it is now at the end of the trail, and is depressed about it. While prices are downright cheap for food and drink, the house has a dark and dusty aura. It does have its attractions, with pool table and large rectangular bar with a few primarily domestic beer on tap. Too, it is a smokers tavern, and a haven for those who enjoy socializing with ques and tobacco. For me, a non-smoker, the atmosphere was challenging. \n\nThe menu is limited, with cheesesteaks, burgers and a few Italian specialties (meatballs galore). Seeing that, I went with their California Burger and fries to get a sample of what they should do well. Well, my hopes exceeded reality. Looking good on the plate with fresh, soft large bun, the puck itself was 8 ounces of previously frozen ground beef, with little flavor beyond what was provided by the cheese and red onions. My request for a medium finish was returned far closer to well done. The half order of fries was plentiful, but with starchy texture and no crispness. Just a disappointing effort. \n\nSitting at the bar, I received pleasant attention from the tender, who was kept busy all night pouring shots, drafts and cracking bottle caps. She moved quickly, and was clearly on top of her game. \n\nThe cigarettes forced me to depart soon after finishing my meal and Michelob Ultra. It is unlikely there is enough there to make a return visit.",
    "date": "2019-04-08 16:33:31"
  },
  {
    "review_id": "GtrtGaUbCJfwgYL9k-g_qA",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "f-sxY-bMaYE9WtpbLhzbig",
    "stars": 2.0,
    "useful": 8,
    "funny": 7,
    "cool": 4,
    "text": "If truth in labeling is to have any credibility, then Szechuan East deserves low grades for honesty in the kitchen. While at one time it may have been truly a spicy Chinese hot pot, with red chilies and black peppercorns to adorn their dishes, somewhere along the line it ceased to be that place, and became quite something else.  If I had to guess, I'd surmise it changed ownership a few years ago, with the original Chengdu folks selling out to people from Zhejiang Province (near Shanghai), but continuing the popular name without the intention of maintaining a similar menu.  In truth, there was not a red nor black pepper in the house. Neither was their cumin, or other heat focused spices to impact the other ingredients.  The strongest element in the kitchen was Hunan black bean sauce, which while temperate on the tongue, does not approach the numbness required of a Szechuan wok. \n\nThe chef has his skills, and the platters delivered were okay for the most part, but it was a mighty disappointment when we came desiring a visit with the fire god, but came away with the less satisfying earth and water deities. When you drive 30 minutes to a remote outpost in Northeast Philly, with the expectation of one thing, and end up with something less satisfying, it is hard not to scowl at the misdirection of management. This was only complicated by the further misrepresentation on their website that they had a bar, when in fact, they no longer did.  \n\nStill, we did the best we could.  Lamb Hunan, Chicken & Walnuts, Yeh Yang Shrimp, Veggie Chow Fun and Cold Sesame Noodles.  Each was a large portion, visually appealing, and well made in their own right.  The black bean sauce on the lamb added some mild heat to the tender strips of baabaa.  The Shrimp was mildly crisp on the outside, with an adequate, yet semi-sweet finish. The Chow Fun was well done as it should be coming from a chef that was schooled in such things.  The walnuts were the best part of the chicken dish - nicely crunchy and honey dipped, as expected.  The cold noodles were forgettable, especially when we had been jonzen for DanDan.  \n\nThe room itself is old school attractive with red leatherette booths.  The service was also fine. They seemed apologetic that we could not get what we wanted.  \n\nMaybe it doesn't make a difference to some what is really being cooked within.  It is also possible that in this backwater of western civilization, the milder, sweeter dishes are what is desired, and the house is just catering to the majority of their customers.  Still, a little heads up as to what was actually going on would be refreshingly more honest, and allow us to decide whether we are willing to accept their compromises.   \n\nWe were not.",
    "date": "2016-07-13 18:37:52"
  },
  {
    "review_id": "hypDG7nLsL7oO6b2igjI1Q",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "19d0pK5EqzRL7Iuzh4kXjw",
    "stars": 2.0,
    "useful": 46,
    "funny": 23,
    "cool": 31,
    "text": "This was a first visit to Ponticelli's, and on walking in first impressions were positive. Small dining room a little worn around the edges, but a bucket of charm at the bottom of Haines Road, Levittown, PA. We were taken by the friendly service provided by one of the family of owners/operators, and decided to try their dinners rather than settle for their neon signed pizzas. \n\nThat turned out to be our mistake. \n\nIt began auspiciously with a wonderful bowl of cream of potato soup. It was the final drop, but smooth, chunky, perfectly spiced and as good as grandma used to make. It came along with oven heated buttered Italian roll, and decent side salad with balsamic dressing. Then came the entrees, chicken francaise and veal saltimbuca, both over fettuccine. \n\nThey looked beautiful in their oval platters - nicely pan grilled with white wine lemon reduction glistening and the veal wrapped in prosciutto and sauteed spinach. The skill in the kitchen was obvious and I began to salivate at what we were about to consume. Unfortunately, the kitchen had a very heavy hand with the salt, and our excitement turned to disappointment as the first bite landed on the tongue and recoiled at the harsh taste of excess sodium chloride. \n\nFor the first time in many years we returned the plates to the kitchen hoping it could fix the problem. The same food returned to us minutes later. The pasta had been washed to remove the saline sauce from the noodles. That helped. However, the chicken and veal had not been repaired, and were as inedibly salty as before. We tried a few bites and just couldn't do it. We advised our hostess and she removed the dishes for a second time. When she returned we agreed what we would pay for and what should be removed from the bill. It was fair and I went to the cashier to pay. \n\nI was saddened when the elder gentleman behind the counter attempted to blame us for the problem rather than simple accept the house mistake. Yet, I understood his instinct to defend his people. No point in arguing. I reminded him that we had not raised our voices and stood before him honorably. These things happen. Best just to move on with apologies and reasonable resolution. \n\nStrangely, I still liked the place and the family making it run. We might return for the highly regarded pizza, but anything with a sauce in a pan would remain off limits.",
    "date": "2019-02-23 19:25:26"
  },
  {
    "review_id": "M_K9vE9YggroJPlMFE716Q",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "XqRjTezzO_Z7LD0jdyA7sQ",
    "stars": 2.0,
    "useful": 5,
    "funny": 3,
    "cool": 3,
    "text": "This is now Dragon of Newtown with new owners.",
    "date": "2013-01-10 00:00:21"
  },
  {
    "review_id": "PflPA9OM4Ggv4nQi4e7RSA",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "9pSChgbs1Skp8rRLQb8x9A",
    "stars": 2.0,
    "useful": 38,
    "funny": 14,
    "cool": 18,
    "text": "If this was just about the ice cream, the stars would be shining bright. The maple walnut, butter pecan and especially the apple pie flavors were very good. Left me wishing for more. \n\nAnd, therein lies the problem. The pleasant service person inside the tiny take out window explained that the medium cup held three scoops of ice cream. If it did, I should have asked to see the size of the scoop, because what I received was far less than three standard scoops. Rather, there were at best half scoops of the nutty and quarter scoop of the apple pie. They were in the waxed cup to look like big scoops, but the reality was far less. \n\nFor the $$, there should be no skimping, and if they can't turn a profit without a thumb on the scale, perhaps they need to reevaluate their business model. The slight of hand trick just doesn't make folks want to return no matter how good the creamies are. \n\nReading the other reviews, the price was raised several times as being an obstacle to enjoyment. For me, it wasn't the cost, but the weight that was the issue. Perhaps, those amount to the same thing. \n\nWe work hard for the money, and don't want to be short sheeted regardless of how comfortable the bed may be.",
    "date": "2018-09-15 03:16:02"
  },
  {
    "review_id": "_q26hj-Ry5pGUJ5kUG7M0Q",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "STwdgdVYWm-pBDF1JIpAVA",
    "stars": 2.0,
    "useful": 44,
    "funny": 20,
    "cool": 28,
    "text": "Vic Sushi & Thai Cuisine is a small Asian house on Easton Road, Willow Grove. They have a split schedule with lunch until 2:30, when they close for a few hours to prepare for dinner at 5:30. I stopped in before the afternoon closure for a a plate of Thai noodles. \n\nI asked for lad na with chicken. The dish derives from Laotian/Chinese cultural exchange, with thick rice noodles and heavy brown sauce into which is stir fried carrots, snow peas, onion and egg. It isn't necessarily spicy hot, but can be made that way by adding lemongrass or chili sauce available in Thai kitchens. \n\nI guess the chef hadn't read the recipe, because what was delivered to me was something different. The noodles weren't thick and chewy, but of medium width and thickness. The sauce more a thin gruel than the heavy, clinging, noodle covering reduction it was intended to be. As a result, I was eating a drippy plate of lighter noodles and veggies, without the enjoyable chew and substantial flavor associated with the traditional dish. I had to request a spoon to deal with it. It wasn't awful, but a far cry from what it was supposed to be. \n\nFirst impression of Vic's is that it is really just a sushitorium trying to distinguish itself from the competition by adding a Thai tail to an otherwise Japanese fish. While the sushi may be good, the Bangkok piece really doesn't work well. \n\nOne and done.",
    "date": "2019-04-20 20:08:29"
  },
  {
    "review_id": "EyZ8GJMN1AwKS1Ff01qNIQ",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "iZ9fg8Dm3SsHa5BqXktGtw",
    "stars": 2.0,
    "useful": 40,
    "funny": 30,
    "cool": 30,
    "text": "One door closes and another door opens. \n\nWe were in Mayfair to check out the Italian food at Emma's Cafe on Frankford Avenue, but when we learned it was booked up on Saturday night we decided to roll with it and pop in to the Aja Asian Fusion Restaurant right next door. The mental gear shift wasn't that difficult. \n\nIt had a big dining room and we were led to a booth against the wall in the middle of the room. It looked to be clean in the dim semi romantic light and our server was pleasantly efficient. Their menu made it clear that Aja was primarily a Chinese house with a cross section of sushi related dishes and a very few Thai choices, like pad thai and two curry options. My concern that it was more confusion than fusion was born out when we ordered the shrimp pad thai (only form it came in) and teriyaki salmon bento box with shumai and California rolls, with choice of miso soup or salad with ginger dressing. \n\nThe noodles were far too sweet and bereft of peanuts to have ever been touched by Thai hands, although there was alot of it on the plate. The grilled salmon was a very small steak, but had the right taste and texture. The miso was fine, but the shumai seemed a frozen, cheaply produced variety and the Cali roll was just okay, tasting mostly of avocado and seaweed. From what we saw at the sushi bar they didn't move enough fish to keep it all daily fresh. There was an awful lot being stored in plastic wrap. \n\nUnless you're satisfied with generic sushi rolls that can mask the flavor/freshness of the fish, Aja Asian Fusion is better wokking up Chinese dishes for you. Leave the Japanese and Thai cuisine for more talented kitchens. \n\nOnce was enough. \n\nWill make reservations for Emma's next time.",
    "date": "2020-02-24 17:06:20"
  },
  {
    "review_id": "Cpc-E5Sj7BTsr-FGrg5xDA",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "b5ky9SyX0xm6bNs7r_bQ-w",
    "stars": 2.0,
    "useful": 3,
    "funny": 1,
    "cool": 2,
    "text": "Coming back to Einstein after a hiatus of more than six months, it was shocking to see the changed conditions all around the shop. I never had strong attraction to their bagels, but the convenience and decent coffee was a sufficient draw to get me there sometimes.\n\nThis visit, while the staff was still friendly and helpful, it was impossible not to notice the amount of dirt all around.  The floors, counters, refrigerator, coffee urns, etc., all seemed to have been neglected.  I happened to see the back of a coffee sign sitting on the coffee counter, and it had not been cleaned in a long time. \n\nThese are signs of lax oversight and poor training. Either corrective steps are taken soon, or this EBB will slide into oblivion. \n\nA downgrade is inevitable.  We have all experienced better than this.",
    "date": "2013-10-04 14:11:58"
  },
  {
    "review_id": "3B3x1-u-Xx9ANbZHDEPlyg",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "qusUFFrMRrkGVoOlz3lcYA",
    "stars": 2.0,
    "useful": 13,
    "funny": 4,
    "cool": 4,
    "text": "Two Slices and a Drink review only. \n\nI came in around 3 on Sunday afternoon and asked for their 2 slices and a drink special, which is listed on the board for $4.99.  I requested the plain pizza I saw sitting in the display be served, \"well done,\" so that it was heated enough to remelt the cheese and bring them back to life.  \n\nThe pizza arrived hot enough, but also clearly past its prime.  Although the underside was firm and held its load well, it was approaching staleness. There should be a time limit for how long a pie can sit around before it is disposed of and replaced for the next customer.  Too, I am not fond of having my fingers burned from the hot oil dripping out the back of the slice when I fold it over in order to gain a stronger grasp.  \n\nFinally, I was charged $6 and change for the snack, clearly above the listed price.  Perhaps, I was there too late, or it was not available on weekends.  The sign should have so stated if that was so.  \n\nClean shop. But, I have experienced better pizza by the slice.",
    "date": "2016-02-23 16:59:49"
  },
  {
    "review_id": "ns85UB5QuttlBxk8ZEaIUw",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "UQZ4p6xb_7gY7UXHmBzceg",
    "stars": 2.0,
    "useful": 52,
    "funny": 27,
    "cool": 34,
    "text": "Although called Tom's Dim Sum, only a small portion of its menu deals with the small plate culture of China.  The first page offers the expected dumplings, shumai and a few cold options, but the majority of the kitchen deals with traditional big plate possibilities. Further, everything is ordered from the menu, rather than using carts and old ladies to bring all choices to the table for perusal and selection. The lack of a floor show is somewhat disappointing. \n\nMore importantly, the quality of the food was also less than stellar and consistent. We ordered a hot & sour soup, crystal shrimp shumai, pork buns and crab/pork xiao long bao(soup dumplings).\n\n The soup was fine, with plenty of mushrooms, sprouts and a good vinegar base. The crystals were not. Looked shiny great on the plate, but tasted like they had been boiled in heavily salted water. Hot salty wet shrimp were unpleasant on my tongue, and not what was experienced in other houses. The pork buns were dry as if they had been sitting around for a while, although the ground pork filling was okay. The XLB had a decent broth within, but seemed sweeter than normal. Had to bite their top knots off and drop the table dumpling sauce into it to improve the savory flavor. There are much better soupies available in Chinatown. \n\nService was fine, and the dining room was clean.\n\n Tom's is located on 11th Street under the covered portion created by the shopping mall. As our server explained when we asked, this is not really a dim sum restaurant despite the name. As such, it suffers from an identity crisis inherent in its business model. It offers a glimpse of dim sum without fully committing to the full monty experience.",
    "date": "2019-06-09 18:13:29"
  },
  {
    "review_id": "AvBeu_W30o4AdjvpgnDIFw",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "E_TWqkEwtzwhrRtyDIU2nw",
    "stars": 2.0,
    "useful": 2,
    "funny": 0,
    "cool": 0,
    "text": "This rating is strictly in comparison to other 5 Guys Burgers and Fries I have sampled. \n\nI think this is the 5th or 6th Cinco Hombres for me, and sadly, the worst of the bunch. The shop was practically empty when mi hijo y yo arrived around 6:30 pm on a Monday night.  That seemed peculiar at dinner time.  Nonetheless, we ordered our burgers; son a purist wanting only beef and cheese, and dad a single, no cheese, but with sautéed onions, mushrooms, and jalapeno slices.  We split an order of flies.  \n\nWhen the brown sack arrived it had the traditional oily blotches.  Unwrapping the aluminum foil packaging, I beheld a semi-crushed orphan baby of a burger, pinched and abused and looking for all the world like it required life support.  Whoever birthed this child needed a slap and handcuffs. But, realizing this was only a metaphor, I ate it after lifting its lid to slide ketchup on its head.  I know; I know. I should have done something. \n\nIt wasn't that they tasted that different then the other sliders from this chain, but that they came to us unloved, and unkempt.  Where was the care, poor child?  \n\nI could not figure out if this was standard for this location, or if we had somehow violated an unwritten rule about how much to order.  Perplexing. \n\nApparently, we were not the first to confront this odd phenomenon.  Looking around at all the empty tables clearly articulated that there was a problem.  I had just been too slow to grasp it.\n\nUpdate 2.18.2014  Stopped in after a long night meet at the Crowne Plaza Hotel down Street Road.  First thing I noticed was that the entire kitchen crew was made up of women.  The second thing I noticed was that although they were busy on the grill, one chef shouted over to us to ask if we both wanted doubles, so she could throw them on while standing there, even before taking our official order.  That was a smart and efficient move.  Third thing was that the burger arrived neatly wrapped in aluminum foil, and when opened, the burger was in excellent condition. Forth thing, it tasted great with sautéed onion and jalapeno slices.  \n\nIf something like this happens again, I will have to reevaluate my original impressions and review.  These women had it all over the male crew the first time I was here.  \n\nGentlemen; get your stuff together!",
    "date": "2014-01-21 05:24:26"
  },
  {
    "review_id": "kaNYOwqTCHwK0WMOdCvQKg",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "-AanHawaDlzWHQjrqRRWig",
    "stars": 2.0,
    "useful": 1,
    "funny": 0,
    "cool": 0,
    "text": "I stopped in after visiting the Jefferson Heart Institute and in need of sustenance after a fasting test earlier in the morning. This Au Bon Pain is conveniently at the corner of 10th and Chestnut. \n\nThe first thing I saw in the front window was their display of bakery sweets and bagels, and I didn't look much further.  I asked for a Everything Bagel Breakfast Sandwich and Coffee.  The staff was uber friendly and had no problem allowing me to switch from a plain bagel to an Everything Bagel.  I paid, took my receipt, and found a small table in back to wait for my name to be called.  \n\nThe light crowd was predominantly hospital workers in the scrubs or wearing ID's around their necks.  Most were doing take out, but a few sat and talked with their associates, or fielded text or phone messages.  The flow was efficiently handled.  In about 5 minutes I had my food.  Reasonable wait.\n\nThe sandwich looked good (see photo) and had decent taste.  Its downfall was the texture.  The eggs were microwaved into a soft fluff.  I really prefer them cooked on a grill or in a pan for more flavor and chewability. The bagel while fresh, was likewise without the tougher exterior and softer insides, but was soft through and through.  Obviously, a bagel in name only.  Disappointing.  The meal was adequate, but not engaging.  \n\nI did not try any of their signature French-style breads, but they did look good. The critical piece is always the crustiness and right amount of salt in the dough.  If I find myself near an Au Bon Pain with an urge for bread, I will give them a try.  Otherwise, there are too many other interesting and tasty alternatives to consider ABP a contender for my breakfast short list.",
    "date": "2013-11-01 14:40:33"
  },
  {
    "review_id": "c3YDa8iORV6dPZjS6GpAAg",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "NNZ4Zjir0S101ltpfgaI1w",
    "stars": 2.0,
    "useful": 8,
    "funny": 1,
    "cool": 0,
    "text": "Golden Dawn was a disappointment on several levels. \n\nFirst, sitting at the end of the counter it took overly long for someone to slip me a menu and offer me a cup of coffee.  I understand busy, but there were several staff people just walking around with their heads down.\n\nSecond, the French Toast I ordered, while thick as advertised, had not soaked long enough in the egg mix, and the center of each slice was dry.  This made for a less than enjoyable experience.  Just glad I went with a short stack.  \n\nThird, although I sat at the counter for at least 30 minutes as I waited and ate, no one came by with a pot of coffee and offered to refill my mug.  Again, servers all around trying their best to avoid eye contact with everybody.  They succeeded in making me feel invisible. \n\nAnd, in making me feel an unwanted customer.  \n\nHave it your way. \n\nWithout me.",
    "date": "2015-08-01 00:13:21"
  },
  {
    "review_id": "VTD0AEpUu3TElv8ZwBrgtQ",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "zOeL4-WZEA_zA1XwUume9w",
    "stars": 2.0,
    "useful": 12,
    "funny": 6,
    "cool": 3,
    "text": "Single Slice Review\n\nI stopped into Tony's King of Pizza for a light bite after finishing an errand nearby.  The shop is fairly small, cozy and family run. \n\nI just needed a little something to quell the hunger and get me to dinner a few hours off. A slice of pizza was the way to go, and visiting a new place always excited me. At the counter I saw one regular pie ready for reheating and consumption. I asked for a \"well done\" slice, and sat at a booth to wait. \n\nIt arrived in the hands of the young woman who had taken my order. Shy smile. A sprinkle of crushed chili pepper, and I was in business. It was as requested, with the extra heat remelting the cheese cover and running off onto the paper plate when I picked it up. Burnt fingers. A small puddle of oil. \n\nThe slice was unmanageable with all the leakage. This pizza just had too much cheese and was out of balance with the tomato sauce, which was lost in all the runny goo. \n\nWe're I to go there again, I would try the cheesesteak, or ask for a tomato pie with more tomato and less cheese.",
    "date": "2016-09-13 15:11:36"
  },
  {
    "review_id": "nApq8ii8XHJ2xLvPM4DvIQ",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "Iq4Qrk3jVSei-F9B7qEPMQ",
    "stars": 2.0,
    "useful": 1,
    "funny": 1,
    "cool": 0,
    "text": "I have eaten lunch at Char Koon three times over the past two years, but never been there for dinner.  While the restaurant is family run, pleasantly appointed, and has a diverse menu covering Chinese, Thai and Japanese entries, including Sushi, the impression is that it is really a Chinese American joint that offers the other cuisines, but does not do a good job with them.  It all tastes \"Chinese\" and lacks the distinguishing flavors and uniqueness to be found in places that really understand the national dishes of the countries presented, and employees a kitchen that appreciates how the preparations differ. \n\nI have tried the Pad Thai, General Tsao's  and other Chicken dishes, Soups, and egg rolls.  They are all decent, but can be found in better form elsewhere.  If you find yourself in Langhorne wanting Asian food, there are few alternatives.  You could do worse, but then again, it would probably be better to go across the parking lot to Brothers for pizza, and save your Asian urges for geographic areas with greater Chinese, Thai, Vietnamese, Japanese, or Korean populations. \n\n The prices are very good for lunch ($6.00 - $8.00 for combo lunches including soup, rice and tea), and the quantities are large enough to fill you up.  \n\nIt is difficult to get excited by Char Koon. Perhaps, their dinners are better.",
    "date": "2013-11-12 15:46:16"
  },
  {
    "review_id": "-RnVXi2vnahK8NSMO9qgtA",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "c5_CD_YIdwPk40chA67Uqw",
    "stars": 2.0,
    "useful": 10,
    "funny": 4,
    "cool": 4,
    "text": "Two Slices & and Drink Lunch Review -\n\nWhile the main Carlucci's Italian Restaurant sits around the bend in this shopping center, the primarily take out pizza joint is to the left of Shop Rite.  It is well appointed with nice enough furniture, although our table rocked so much I had to put my foot on its leg to hold it still.  \n\nThe pies are ordered at the cashier/kitchen in the back.  There is a display of many of the pies for inspection.  I am not a fan of this approach as there is not \"Sell By\" time nor date to alert you how long they have been sitting around.  The more pies; the older they tend to be. \n\nWe ordered well done slices of the Cheesesteak Pizza, Old Fashioned Tomato Pie and Plain.  They were only Okay at best.  The Cheesesteak and T.P. were deep dish style, with light and airy crust, that tasted more like bread with toppings, than true pizza.  The Plain slice was more traditional.  It had a satisfactory taste, but had a leaky oil pan and no gasket.  \n\nThis is not a tomato pie house I would return to as the samples tasted were not all that good. Probably better to walk over to the mothership for a full Italian meal.",
    "date": "2016-03-28 17:16:12"
  },
  {
    "review_id": "8H8PO-tko2v9ADB6B_hzSA",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "-PGe8XbKh-vXkr57GKNEAw",
    "stars": 2.0,
    "useful": 30,
    "funny": 12,
    "cool": 25,
    "text": "In a strip center at the bottom of Bristol Road, Bensalem, PA, Taste Café is another of those Chinese/American joints catering to the sweet tooth of the American palette. The place is clean, with six tables for dining in, however, this is primarily a take out operation. Their menu has all the usual suspects from General Tso's to chow mein. My lunch consisted of orange chicken, fried rice and wonton soup. \n\nIn reverse order, the soup was served in a plastic takeout container even though I was eating there. I guess they don't have any bowls, because it seems wasteful and less than hospitable to serve and throw away those containers. Even with recycling, it seems incredibly inefficient. The taste was of a soup that had been in the pot too long, with thick skinned dumplings with little stuffing. \n\nThe main course came on a paper plate with the thinnest white plastic utensils imaginable. They could not cut the chicken without bending to the breaking point, and held little soup. I ended up picking up the soup and drinking it from the container. The chicken had the gloopy sauce thickly covering the deep fried breaded chicken morsels. Not an orange peel in sight, and flavor to match. It also seemed they might have been using old oil, as I developed stomach discomfort minutes after consuming it. The yellow dyed fried rice was okay, but also tasted of aging in the pot. \n\nNot much going for Taste Café, except the average price for the lunch was under $9 with a bottle of water or soda. \n\nNo need to return.",
    "date": "2018-10-04 16:10:08"
  },
  {
    "review_id": "h4EEZSf_LsHUEbgQJtOtOQ",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "72H2mtzrg7A8KZjx7BEZjw",
    "stars": 2.0,
    "useful": 9,
    "funny": 4,
    "cool": 4,
    "text": "Yelp should consider having a check off box for reviews that deal with take out/delivery or eat in experiences.  They are so often vastly different, that this information would be helpful.  \n\n***\n\nWe decided to pick up a pizza from Uncle Charlie's on a Sunday afternoon after shopping in the area.  We walked in, realized that this was strictly a take away kitchen and decided on a regular pie we could bring home to devour.  Everyone behind the counter was pleasant, and it seemed to be a high school operation for local kids. No problem with that.\n\nEverything smelled great all the way home, but after the 15 minute drive the pizza had lost its edge (quite literally).  The underflooring could not hold the topside weight, so every slice we attempted to lift from the box folded and left parts of the cheese behind, which quickly cooled to room temperature and was not enjoyable to eat.  The taste was no doubt impaired by this process, and though we knew it was still pizza, it really lacked much taste from the sauce and remaining cheese.  It just wasn't as good as eating pizza at its source.  \n\nUncle Charlie must be aware of this as all they have it take out or delivery.  It really puts them at a disadvantage over restaurants that can have patrons eating there.  Maybe delivery is better if it is timely, but their vehicle holds the food in an insulated bag in the trunk.  Somehow, that image is not very appealing. \n\nSeem like good folks, but their approach doesn't work for me.",
    "date": "2016-03-14 15:16:06"
  },
  {
    "review_id": "099Csht-GddIbteW4kzQpQ",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "eqHh2Sbw43hWwFNxLWEycg",
    "stars": 2.0,
    "useful": 39,
    "funny": 12,
    "cool": 30,
    "text": "What a difference since my last visit. \n\nI walked in around 2:45, just in time to catch the final few minutes for their lunch specials. I was the only customer. With my first breath inside I thought that the fish had taken over. The atmosphere smelled of piscean excess, like the air filter hadn't been cleaned in forever. Yes. They were a sushi joint and had two large tanks on the premises, but this was ridiculous. Fresh air, please. \n\nI should have turned around and walked out, because it got worse from there. I sat down and ordered the sesame chicken, which came with fried rice and egg roll. \n\nWhereas, last time the food was better than average for a Chinese American house, this time it was far worse. The breading was thicker than the meat within. Primarily cheaper, dark meat chicken was used, and it all was overcooked in deep frying, so that much of the pieces were overly hard, like encased in plaster rather than flour. It stuck in my teeth and tasted of old oil. The fried rice was aging poorly and the eggroll was mostly cabbage and more stale oil. \n\nReally disappointing after a positive first impression several months ago. They must not being doing well, but without better effort and sense of smell, they won't have long to worry about it.",
    "date": "2018-08-08 03:09:45"
  },
  {
    "review_id": "KtUcR4qme8yh3AIrYn1exg",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "qIOQBHxUQYM5hALXW-QWnw",
    "stars": 2.0,
    "useful": 37,
    "funny": 21,
    "cool": 34,
    "text": "Nate's Hot Bagels is the most forlorn shop in an exceedingly decrepit commercial center on Grant Avenue in Northeast Philadelphia. The large towering sign atop the storefront is bigger than the interior customer space, which is merely a small lobby big enough to turn around and to look at the bagel bins behind heavy Plexiglas protection. Lord knows, people up to no good can't get enough of these round dough mounds, and will go to dangerous extremes to get them. Business is conducted through a narrow space between the plexi and the locked door leading to what looks like a small bakery.  Cash only. Smallest order: half dozen for $5. Don't like it? Tough. Find another rounder house. \n\nAfter I got passed the sense of walking into a 19th Century prison, I noticed the bagels looked pale compared to what I was accustomed to. Under baked? Perhaps, but I was there, and I wasn't going to walk out without a score. There was a buzzer button sitting atop the back of the cash register. I pushed it. It croaked out a notice to a man in back, who came up to take care of my wants. He was friendly enough, but didn't look like a baker. No flour in his hair. No poppy seeds stuck to his hands. \n\nI asked for three onion and three everything bagels, and he went ahead and fetched them barehanded into a brown paper sack, and threw in a plastic bag for home storage in a refrigerator. My $20 returned the bag and $15 paper money. No taxes to account for here. \n\nSo, I tried an everything bagel when I got home, and had a toasted onion for breakfast this morning. They are denser than I normally like, but no question about freshness and full flavor. Definitely worth the gamble entering this mysterious shop. \n\nCan't escape the sensation that there are more than bagels going on in Nate's, but as long as their signature products deliver on the promise of a decent bagel (and bialys), I can ignore everything else.",
    "date": "2018-04-09 16:30:08"
  },
  {
    "review_id": "2WWXd5BH25gYT-_o0l4Kiw",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "364nhy8VvBXXEXKXREESyg",
    "stars": 2.0,
    "useful": 48,
    "funny": 22,
    "cool": 34,
    "text": "Pho Kitch'n on Ridge Pike, Eagleville, PA, is an Asian fusion restaurant with Vietnamese cuisine taking the lead and Thai/Chinese following close behind. It is in a free standing A frame building, with plenty of parking and nice size dining room. \n\nI went with the namesake noodle soup with lean round steak and fatty flank. It was a large bowl for $8.95 and the stock was good with interesting and subtle flavors from long simmering, and a large knot of noodles beneath the surface. \n\nSadly, the side plate of accessories to add to the pho was disappointing, with withered Thai basil and dessicated lime wedge visible with a quick glance. Delivering them to the table was an act of disrespect and slovenliness that is impossible to dismiss as an oversight. The woman serving me certainly put the plate together in the kitchen, and just didn't give a damn, or worse.\n\nIronically, the pho itself was pretty good (even without the basil and lime), and would have garnered a higher score but for the passive aggressiveness served with the pho. \n\n2 Stars",
    "date": "2019-01-14 22:23:28"
  },
  {
    "review_id": "67laCGRDwx6mezpoCQ5_Mw",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "oi9pCS83sO9wu9knPiu94Q",
    "stars": 2.0,
    "useful": 36,
    "funny": 22,
    "cool": 25,
    "text": "It has been many years since this joint was the Lemon Leaf (at least since 2014, if not earlier). Now, it is a Chinese takeout, with a menu half Chinese and half Thai, although the operation is totally Chinese. The waiting area has two tables if you prefer to eat your fried rice hot and not reheated. But, coming from a disappointment of a prematurely closed White Elephant a few miles away, I was still in the mood for Thai, and took a chance at the now named Asian Thai & Chinese Cuisine. \n\nIf there was a classification for \"Dive Chinese Takeout,\" this would fit that description. Dirty all around and a kitchen that hadn't seen a clean mop or ounce of elbow grease in many a year (but, plenty of other grease abounded). Hunger drove me to suspend better judgement and plunge in with chicken pad thai.\n\n It arrived in styro packing and thin plastic fork 10 minutes later. Ground peanuts atop a pile of medium width rice noodles, mixed with slivers of a few veggies , slices of white meat bird and light brown sauce. I asked for it spicy, so red chili powder was included, but not any heat from lemongrass. \n\nThe taste was nothing like pad thai, but some Chinese approximation of that dish using Chinese spices as substitutes for the real deal. Edible, but lacking authenticity. Satisfied my hunger, but approaching false advertising. \n\nNo need to return. Just hope White Elephant honors the hours on its door in the future.",
    "date": "2019-11-24 17:01:04"
  },
  {
    "review_id": "AG_wnOsHdlgcjzgCP-ig6g",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "La_geKjZMtLxcbUHwVCldw",
    "stars": 2.0,
    "useful": 4,
    "funny": 3,
    "cool": 2,
    "text": "Pulled up to this Prince Fried Chicken after work one night last week.  The driveway is not on Olden Avenue, but on the side street next to the adjoining liquor store.  Miss that and you will have a job finding your way back here, especially after dark.\n\nThat being said, after trying their breasts and wings I will not likely be going back.  When I arrived home and sat down to eat my purchase, I found the coating to be overcooked and the meat a bit dry.  I had noticed that the chicken was a shade darker than richly golden, but as everything in the bin was the same color, I thought that would not be an issue.  It was, however. \n\nThe pieces were meaty and the prices very inexpensive.  If the chicken itself had been crunchy, spicy and moist, it would have been a big hit. It might have been a bad lot left in the fryer too long, or perhaps suffering freezer burn, but you only get one chance to make a first impression.  \n\nGiven the alternative fried chicken shacks all around the area, I will keep searching for the perfect batch.",
    "date": "2015-02-01 15:00:04"
  },
  {
    "review_id": "wlXGKBEz0wey-2ybI06NbA",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "pfhI5rPULH163H3F0LNXxw",
    "stars": 2.0,
    "useful": 22,
    "funny": 15,
    "cool": 13,
    "text": "It has been a while since my last visit to any Ikea, and after spending two plus hours in their Conshohockon maze, I remember why I stopped shopping there.  Their warehouses are enormous, and there is so much stuff to look at that it can be overwhelming. But, the kicker comes when you have had enough browsing, decided not to purchase anything in order to consider the possibilities, and try to leave the premises. \n\nIt is then you realize that you are lost somewhere on the second floor and don't remember how you got to the office furniture area. The signs say the check-out and exit is \"that way,\" but that just leads you through every other department in the hanger, past the cafeteria, down the only flight of stairs, and through a second maze on the first floor. The maps sparsely displayed look like a game of Candyland or Chutes and Ladders, with little dots meandering through every corner of the building. It was at least 10 minutes before I reached the cashiers and saw the exit doors beyond them. Someone with claustrophobia could easily panic before reaching fresh air. \n\nYes. I did see some desks, bookcases and lighting that might work well in the new office, but not as much as I had hoped. Prices were good, but I had the definite feeling that I would be settling for things based on limited choices, rather than true love of the furniture. And, by the time I made it out of the warehouse, I had little desire to go back in. \n\nMake it easier to escape and I would have no problem going back in smaller doses to explore and find what I want. Absent that, why would anyone voluntarily submit themselves to such torture?",
    "date": "2017-12-12 22:48:35"
  },
  {
    "review_id": "wnxH2lMjfpMJgTvyMjMlAA",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "xU6wDAgz7oYB13hSp93adw",
    "stars": 2.0,
    "useful": 19,
    "funny": 11,
    "cool": 11,
    "text": "VITAMIN/SUPPLEMENT REVIEW ONLY\n\nVisited the Carousel Gardens campus today, thinking Organnons Market might carry the things I needed in their vitamin supplement area. It was my first visit so I looked around the shop. Few customers on a Saturday afternoon, but the produce looked good and the canned goods were limited but interestingly esoteric. Nice selection of coffee, too. \n\nYet, they didn't have any of the three things I needed that are fairly standard in most health food stores. The worker was helpful, and apologized for not being able to help me out. No sweat. Drove down to Big Bear and found what I needed. Plus, they were selling Kicking Horse Coffee for $3 less per bag then Organnons. \n\nGood to have a quality locally focused organic food outlet nearby, but given it's inherent inventory limitations and prices, it won't be a regular stop for our provisions.",
    "date": "2017-07-05 00:26:19"
  },
  {
    "review_id": "n8Vh7bOilpiWCbdURbtmmA",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "4Z3uy62O1fRDiq93b00Y9g",
    "stars": 2.0,
    "useful": 5,
    "funny": 1,
    "cool": 0,
    "text": "It would probably be useful if Yelp separated dining in experiences from those of take out, as the issues are very different.  But, until it does, the combined reviews will continue to skew the results in a negative direction in most circumstances.\n\nSo it is for China Aston, a fairly nice small Chinese resto in Aston, Pa., although there is another unique issue that applies only to how this house is managed.  \n\nWhen we walked in the three of us planned to have one person have dinner because she was hungry before a long drive across the state. The other two of us wanted to sit with her and perhaps have an app or soup because we had eaten before meeting up with her nearby.  We discovered a sign on every table that said their was an $8 minimum to dine in, and a $5 min to take out.  That meant to us that we would not be served unless all of us ordered more than we wanted, or got unnecessary take out to keep them happy.  Inquiring of the owner/manager of our circumstances was met with a blank stare and repetition of the House Rules.  \n\nWe didn't have time to look for another place to eat, and although wooden, we did not want to violate their demands.  So, I ordered some Orange Chicken and Pork Dumplings for Take Away, and one dish of Steamed Veggies and Rice for immediate consumption.  This satisfied the dowager, and we just grinned and bore it.  \n\nTurns out the Veggie dish while fresh and presented in a bamboo steamer, was bland and needed augmentation.  No Sesame Oil here, only some form of Chili Sauce.  When I returned home and went after the Chicken and Dumplings, I found very ordinary fare, with a thickish coating on the meat, and goopy mildly hot sauce at the bottom of the container.  The fried Dumplings were adequate, but not really hot enough to appreciate its apex taste and texture.  Everything was just meh.  \n\nThe final choice of 2 stars comes from the complete absence of customer concern displayed by the house mother.  Rules were rules, and would not be bent or compromised for any reason.  In truth, this restaurant felt more like a school lunch program run by a cold and uncaring matriarch.  \n\nMaybe that's why the place was practically empty on a Monday evening.  \n\nRegardless, my shadow will not touch its door again.",
    "date": "2015-01-21 18:08:18"
  },
  {
    "review_id": "N4nf66kQNBdjj_NUfcySHg",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "SE5OHMl7g2Vq8kX22soSfg",
    "stars": 2.0,
    "useful": 39,
    "funny": 15,
    "cool": 19,
    "text": "This franchise recently expanded into this part of the world, and I finally found a convenient moment to check it out this week.  It is an attractive Chinese house; clean, organized and designed equally for eat in or takeout.  Yet, not an Asian in sight to speak to authenticity.\n\nThe options are set behind glass shielded steam tables, where the workers allow you to select from the number of different dishes offered, and spoon them onto a heavy cardboard plate with a side of white or fried rice.  As everything is prepared beforehand,  unless you arrive soon after wokking, the food cools and congeals to some extent, detracting from its overall taste and enjoyment. I went for orange chicken and Beijing beef with the fried rice.  Both had a good look with different shades of orange and red amber goopy sauce.\n\nThe taste of each was distinct, and I believe that if hot, they would have been a satisfying meal.  Unfortunately, that was not the case. Both were barely above room temperature when I sat down, and although I appreciated the flavor and textural potential, the heat issue really drove down my enjoyment.  I don't know how they can fix this problem. I don't like micro-reheats, and question whether they could successfully throw it back in a wok.  \n\nSo, I give them credit for an interesting idea, and a tidy house, but just don't want past prime hanging around food as part of my diet.",
    "date": "2018-01-26 15:00:45"
  },
  {
    "review_id": "ntykE5c7LGfLCMjwdsVwWQ",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "qA3p4EHr12GnG5-TEr9bZA",
    "stars": 2.0,
    "useful": 38,
    "funny": 19,
    "cool": 30,
    "text": "Standard CVS drug store and food market in Newtown Borough. To my eyes they all look the same and really have little to offer other than prescription drugs. Everything else is predictable and overpriced. \n\nI am surprised to see that the floor has industrial carpeting throughout, as it is difficult to clean. In a place frequented by sick people such flooring is not optimized for a healthy environment. I prefer hard surfaces that can be swept and washed often. Maybe this carpet is removable, but the question remains, how often? \n\nThe answer, not often enough.",
    "date": "2018-08-15 01:36:24"
  },
  {
    "review_id": "_7scYvXjxCwhIdlASSClVQ",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "3MIsXwx5zVmlwzRx9UnuFQ",
    "stars": 2.0,
    "useful": 31,
    "funny": 24,
    "cool": 20,
    "text": "Perhaps it was just this particular Perkins, but it does seem that this franchise is a poor man's version of the ubiquitous IHOP. It was hard not to notice an immediate disappointment moving from the beautiful menu photos to the presentation on our plates. From proud to defeated, boisterously sensational to meekly fallen, the reality fell far from the mark. \n\nNot that the french toast platter and quesadillas were without taste, but that they were not nearly as grand as advertised. The brioche thick slices absorbed the egg/sugar/vanilla mix, but not quite enough to overcome its dry core. The crisp bacon was not so, and the deflated quesadillas were so thinly filled as to believe the promised steak was little more than tender shoe leather. \n\nTrue, the hall was crowded, the prices quite reasonable and the coffee topped off in a thermos pitcher on the table. Kenny's service was friendly, clever and accommodating, but could not overcome the the tools he was working with. \n\nPerkins appeared to be an anchor of this Grant Avenue neighborhood in Northeast Philly. It should do something to assure that it does not contribute further to its distress.",
    "date": "2019-12-24 18:46:05"
  },
  {
    "review_id": "7AHUgIvZe-lNWzohV8X5Ew",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "YZtphZ-zlhiPjzcJjuQc3g",
    "stars": 2.0,
    "useful": 5,
    "funny": 4,
    "cool": 2,
    "text": "Man! \n\nYou guys are so harsh on poor little DD here in Holland. \nThe three of you only gave it 1 Star apiece. \n \nThe coffee is standard for DD; no better, no worse. \nThe staff does seem disorganized and a bit comical how they step over each other and can't remember your order.  \nThe donuts are never really good at any Dunkin, so nothing new there.  \n\nYeah, I've had way better than everything on the board here. But, is it as bad as finding a mouse in your donut?  (Thus, the \"Eek!\") \n\nI think not.",
    "date": "2014-02-12 20:36:25"
  },
  {
    "review_id": "vMH6BVhQTMx7nDaD6OP3gQ",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "BZ0mJ2qhAGwOvjsTbSIuTg",
    "stars": 2.0,
    "useful": 44,
    "funny": 21,
    "cool": 26,
    "text": "Paying the check from breakfast on the way out, the owner/cashier ask why we were putting such a small tip on the credit card payment. After a second's hesitation born out of the discomfort of having to express criticism directly, I had to explain that the service we received at the counter from the server assigned to us was very bad. He wanted to know what I meant.\n\nFirst, I mentioned that the guy sitting next to me was never served his meal and just walked out in hungry frustration. Then, I started on our experience. The milk I requested for my coffee took 20 minutes and a reminder to our waitress after she reappeared from her absence from the floor. Ten more minutes before our Greek Omelets arrived and a few more until she brought me silverware so I could eat. Beyond that, I was never offered a coffee refill, and she got the toast order wrong and had to return to the kitchen to redo it. \n\nAlthough pleasant enough, she seemed not to see what was/was not in front of her, and unable to anticipate the sequence of providing and consuming a meal. For example, her response to our counter mate leaving in disgust was that she thought another server had given him his order and that he had eaten it. Yet, it never occurred to her that although she had taken his order, but not brought it out, that asking him about it would be the courteous thing to do; neither did she ever walk by him and realize that there was never any food in front of him - not even when she finally refilled his coffee.  Really inexplicable, and inexcusable. \n\nIt's not that the breakfast was bad. It was actually quite good, but the neglectfulness of this woman had gotten to us so much that we ate feeling miffed. It put a damper on our enjoyment, too, as we watched her continue with this behavior with other customers. By the time we were finished and ready to go we were again confronted by her being AWOL. When she appeared again several minutes later we asked for the check and a container for leftovers. She returned with the former, but forgot the later. We asked another server for that and she reached under the counter right in front of us and handed it over. \n\nMaybe she was just having a bad day, but she certainly rained on our parade and made breakfast an ordeal. But, at least we ate, which is more than my neighbor could appreciate. \n\nThe owner seemed stunned by the story, and said he would straighten it out. Didn't offer us anything as compensation for our inconvenience, which would have been a good move, but at least he listened and believed.",
    "date": "2019-10-21 02:10:36"
  },
  {
    "review_id": "Bwo3S1mrSj-thjAU-wx7Pw",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "Gn34llSvalq0_RNsZLCsfQ",
    "stars": 2.0,
    "useful": 4,
    "funny": 2,
    "cool": 1,
    "text": "Before getting on the Pa Turnpike early this morning, I made a short detour onto Horizon Boulevard to get some java and a small bite for breakfast.  When Chik-Fil-A was not yet open, I drove through the take out window at Starbucks next door.  \n\nI liked the convenience and time savings of a drive thru, but it seemed like the order taker was also the barista as well as the short order cook.  So, she looked rather busy, and in need of assistance.  Still, she kept her composure and got everything right.  \n\nAs usual, the coffee had a burnt and bitter taste, but the extra milk requested helped to soften the harshness.  I asked for their Sausage, Egg and Cheese Sandwich on a croissant, but was told that all these meals are pre-packaged and microwaved just before sale.  I decided to go with the English Muffin as the only option.  I don't like what microwaves do to eggs and bread, so the meal was at best, average.  Nothing I would want a second time.  \n\nHopefully, CFA will be open next time I find myself in a similar predicament.",
    "date": "2015-11-25 21:08:12"
  },
  {
    "review_id": "oWShsXSig3eXu1hasEbfNw",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "Ony7JxUB_ncfK146S66PPA",
    "stars": 2.0,
    "useful": 19,
    "funny": 11,
    "cool": 14,
    "text": "Metro Diner on Street Road has the look of a cafe more than a traditional diner, with only a short counter with spinners overlooking the open kitchen, and a dining room to the other side. It is in a new building it shares with an as yet unleased commercial space. It is not the roadhouse a diner was designed to be. \n\nStill, the menu looked diner. So, what the heck. I was ready for breakfast, and I was already there, and in the hunt for some good french toast. That they had in abundance, although not just the plain egg bread fried with the hint of vanilla and sugar I was hankering for. But, when I asked the friendly server if it was available, she assured me it was. \n\nThe coffee was strong, hot and free flowing. The main attraction was disappointing. It looked great on the plate, especially after melting some butter and running syrup over it. But, upon cutting and first bite, found its insides to be mushy and cooler than the surface. It wasn't eggy inside as you might expect, but almost watery, like the mix had been diluted to the point where it lacked the hen seed to thicken under heat. It just stayed wet. The flavor was about right, but texture counts, too. \n\nI suppose I could have given it back to them for another try, but wasn't feeling like making that scene. I ate what I could and took my leave. Just glad I hadn't asked for the heavy hitters on the menu, which would have put a bigger dent in my wallet.\n\nIt was probably a mistake that wasn't caught before reaching its final destination, but first impressions were damaging.",
    "date": "2017-02-07 17:23:18"
  },
  {
    "review_id": "dTflZ-D1F7wvwnC_OZq3HA",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "HrEIQSum1FKPJoXlI9UU_w",
    "stars": 2.0,
    "useful": 0,
    "funny": 1,
    "cool": 0,
    "text": "Nice cold morning. Quiet breakfast with my son before camping. Sausage, egg & cheese biscuit quite tasty.\n\nI am not really a fan of Chik Fil A.  I don't get the name, nor the advertising. \nThe chicken sandwiches do not move me.\nThe only things I like are the breakfast sandwiches and the shakes, which are rich and creamy.",
    "date": "2013-04-27 14:24:09"
  },
  {
    "review_id": "dTCvIqpgBphfmWdd6l33qg",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "LOERTipUKUhDq6BayAXqUg",
    "stars": 2.0,
    "useful": 4,
    "funny": 4,
    "cool": 2,
    "text": "Jade Asian is a replacement for an earlier Chinese resto at this location. On approach it attempts to position itself as a \"Fusion\" place offering Chinese, Sushi and Thai cuisine.  While the space is clean and bright with a large HDTV on the wall playing NFL games on Sunday evening, and the servers are friendly and courteous, the reality is that this is primarily a Chinese restaurant that doesn't have a Japanese nor Thai chef to handle that end of the menu spectrum.  \n\nWhile I saw someone working the Sushi Bar who seemed to know what he was doing, it was obvious after ordering Tom Yum Soup (Vegetables) and Pad Se Yo Noodles (Chicken), that they have a ways to go before they should present themselves as offering a real Thai alternative.  \n\nThe Soup was appropriately tart, but the Vegetables seem to have been thrown into the pot at the last minute.  While plentiful, they were large pieces that had not absorbed the flavor of the broth from slow simmering.  It just did not hang together as a true Tom Yum would.  I asked for a heavy spice infusion on my Pad Se Yo, but what I got was not a Thai dish at all.  It was Chinese Chicken Chow Fun, complete with the mild Cantonese brown sauce traditional to that dish.  When I asked for additional hot sauce to bring some of the taste I desired, I received only Sriracha in a small dish, but not any Hot Chili Oil, Sesame Oil or even a Curry Powder shaker to doctor it the right way.  \n\nFor Chow Fun it wasn't bad, but for Pad Se Yo it was a major disappointment.  \n\nJade Asian is really more about ConFusion, than Fusion.  For me, it is not worth a return visit as there are much better Thai places in the area.  While I can't comment on the sushi, I am left to believe it likely suffers from the same inauthenticity.",
    "date": "2014-10-20 16:59:08"
  },
  {
    "review_id": "DWqArI__7fs0Ahl4UvGTPg",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "oEcWJZDKjFbTXcOt4sqE1A",
    "stars": 2.0,
    "useful": 4,
    "funny": 4,
    "cool": 2,
    "text": "I am not a Star$$$ fan. \n\nI love coffee that tastes good at its base and does not require extra processing (read, latte, capp, etc.) to make it palatable.  So, it is always somewhat surprising to see these little coffee caves sprout up in supermarkets and box stores and do moderately well.  I admit to having been a happy stockholder for a while, but that did not change my opinion of the underlying product.  \n\nSo, I was skeptical when I walked into Target a few years ago, and several times since, to see this outpost hanging its shingle within.  It is still there, but seems to be scraping along with only one person running the operation.  Some people like to sip java as they push their shopping carts around the store.  A few actually stop in only for the coffee and depart.  \n\nIt would be great if there were more coffee alternatives around here.  Until then, this place and the competing Dunkin Donuts and diners of the world will duke it out for my coffee dollar.",
    "date": "2014-05-07 13:35:15"
  },
  {
    "review_id": "qgbPSCfKb0op-h581DAE5Q",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "PmJWU6d6_-D61rIOU5IcPg",
    "stars": 2.0,
    "useful": 18,
    "funny": 12,
    "cool": 14,
    "text": "Full disclosure - I am not a Walmart fan, nor do I enter their warehouse-sized stores very often.  Given the alternatives available for discount shopping, the guys from Arkansas are on the bottom of my list. \n\nStill, when I needed to pick up a quick pair of glasses to replace the expensive ones my stepson lost somewhere, Walmart was the place to go, as their vision centers offer inexpensive prescription glasses and relatively fast turn around time.  In fact, we walked in shortly before they were to close their in house nook, and were taken care of promptly by one of the white coat people.  We were able to shop for frames, take eye measurements, and pay for the pair in about 20 minutes.  Lens to be ground and framed within a week.  Under $100, compared to the boutique price the first time around when I was willing to be generous, thinking the glasses would not be misplaced within a month of purchase.  My bad! \n\nWhile in the store we walked over to the electronics department to check out phone chargers (another lost item by stepson), plus another for the office.  Found the prices to be about the same as online, but surprisingly few options for our Apple and Motorola mobiles. There was only one sales associate in the department, and she was helping another customer find something, while a queue formed at her register.  We were not the only customers to decide not to wait.  \n\nI felt a little unclean and hypocritical spending money in Walmart, but this was a semi-emergency.  To be fair, the vision center handled us well, and seemed dedicated to customer service.",
    "date": "2017-05-18 15:48:21"
  },
  {
    "review_id": "0vWEo8eTICpbq5XJ4MQFAA",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "3tfku-srVI4CJDA9BzacSw",
    "stars": 2.0,
    "useful": 15,
    "funny": 2,
    "cool": 6,
    "text": "If you are a Spaetzle lover, Barbara's Hungarian Restaurant is your Nirvana.  Ask for a side of the East European doughy pasta, and it will arrive covering the entire plate. To its credit, it is pretty good, especially with the sour cream mixed into it.  \n\nThe rest of our meals were not up to its signature dish.  We ordered the Mushroom Stew and Breaded Chicken Cutlet (Schnitzel).  The Mushrooms were canned, and the sauce the same weak reddish liquid that was at the bottom of the chicken dish.  Little imagination. Less taste.\n \nCanned mushrooms? Really? \n\nThe Chicken Breast was large, thick and nicely breaded.  It was juicy, and would have been the winner but for the saltiness of the coating.  It was obvious no one had bothered to taste the ingredients and preparations in the kitchen.  \n\nBoth dishes came with Spaetzle overload.  The Mushroom Stew was really canned shrooms and spaetzle, with nothing else to make it a \"stew.\"  The chicken lay naked on another thick bed of the same thing.  Nary a garnish or side dish to break the monotony.  It must have been obvious, because we were offered a Cucumber Salad by Barbara when she saw how forlorn our meals appeared.  That salad was the best part of the meal, although it would have been nice to know we were being charged $5 for that small bowl with sweet vinegar and thin sliced cukes.  \n\nMaybe, they were having a bad night, but based on our experience I wouldn't consider going back.  There are far better East European restaurants in the area where the cuisine really shines.",
    "date": "2016-03-15 19:33:56"
  },
  {
    "review_id": "Wemjn0G_jZ9XAvEekeuBnw",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "qFxq9mcPjKoyeOpWW7X0Ng",
    "stars": 2.0,
    "useful": 8,
    "funny": 5,
    "cool": 6,
    "text": "Two Slices & and Drink Review Only - \n\nThe image in mind from the name was of an Italian shop anchored by the culture and cuisine of the eastern shore of the boot.  Not quite.  In fact, the reference is to the other side of the Adriatic Sea.  \n\nI went in for a quick dinner of their pizza.  The dining room was attractive with marble walls and tile floors.  The counter zone housed the ovens and the shelved display of pizzas already made and waiting for reheating. Wanting to sample the wares, I asked for one regular and another sausage.  They were about the largest slices of pizza I had ever seen, and in truth, one would have been enough.  Eyes bigger than stomach, I retreated to a table to await delivery.  All the while, the phone rang off the hook with take out orders, which were all fielded smoothly by the young woman dealing with this.  She asked good questions, and kept her poise and easy manner.  \n\nThere is always a risk in consuming pie that has been sitting around for a while.  Sometimes, even when requesting \"well done,\" it is not left in the oven long enough to revive the underlying taste of the pizza when first constructed, or they have been out so long that no amount of fire resuscitation will bring them back to life.  Such was the case this night.  The copious cheese topside was hot, but not enough to allow the flavor to come to the fore.  The undercarriage dough was amply scorched, and better than what was supported above.  Just not much life there.  The sausage triangle was similar.  The pellet shaped meat was cooler than the cheese around it, and lacked any real taste at all.  It left me wondering where they found this sausage vendor, because it neither looked, nor tasted, Italian.  \n\nNo doubt Adriatic Pizza is a popular spot for fresh pies and platters judging from the orders calling in, and the other reviews.  It is just not a good place for reheat jobs, even with an incredible price of under $5. for everything.",
    "date": "2016-04-18 19:51:34"
  },
  {
    "review_id": "nR3uuOICjCa_DgRLOuFpRg",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "WzZWZkxqwRlbyveZzRRRhQ",
    "stars": 2.0,
    "useful": 30,
    "funny": 16,
    "cool": 22,
    "text": "Old Friends Pizza, way down on Hulmeville Road, Bensalem, PA, has just enough table space for a few old friends to join you to mange Italiano. Four tables. Four chairs per. If you want to invite more than 16, well, that just can't happen. \n\nYou also need to be sure the air conditioning is working, otherwise the party will be a little uncomfortable dealing with the heat and humidity, as I was. \n\nNot in the mood for pizza, I ordered an eggplant parmijiana sandwich on torpedo roll. I passed on the suggestion to add fries to that. Saw no need for the extra calories. I found a chair in the empty dining room and watched the Thursday afternoon rain through the storefront window. \n\nOne of the kitchen guys served my lunch on ceramic plate. So much better than paper. It was a large production, with thick slices of breaded and browned melanzone, layered with chunky red sauce and overlain with melted provolone by a turn in the oven. It was really too zoftig to pick up by hand and jam into my mouth. So, I asked for knife and fork - the table tools associated with proper dining. In reply, I was handed two thin plastic utensils. \n\nThey both failed the strength test, as they bowed and cracked attempting to cut through the sammy. The knife gave up from the density of the bread, and snapped in half. I decided to eat the eggplant, sauce and cheese with the fork used to pull things apart before spearing. Not the funnest way to go. \n\nThe taste was pretty good, but needed more sauce and less oil. It would also have benefited from thinner slicing and hotter pan to sear the copious coating, rather than the oil being absorbed into it. \n\nThis was not Old Friends finest hour. Pizza would have been a better way to go.",
    "date": "2018-10-13 18:39:48"
  },
  {
    "review_id": "OjLywDgtW2pBBhLM7Fd3tw",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "CJSSTraJzktYE48l8pBADA",
    "stars": 2.0,
    "useful": 5,
    "funny": 4,
    "cool": 4,
    "text": "This site attempts to do too many things. \n\nIn addition to housing a Dunkin' Donuts, it is also a Getty Gas Station, mini-deli, and lottery dispenser.  As a result, the place feels disorganized like it has a bad case of Attention Deficit Disorder.  Parking is limited and a bit dangerous with all the different uses bringing vehicles in from all directions.  \n\nThe DD coffee is average.  The Bagel with Lite Veggie spread was toasted automatically, although I prefer it not, causing a cream cheese melt and a small mess in my car.  The taste was decent for a mass produced bakery product, but these rounders will never be mistaken for quality bagels.  \n\nIt will do when time is very short and an injection of caffeine and a few calories are needed to survive through the first court appearance of the morning. Other than that, this is not a shop I would select for a morning munch nor java stop.",
    "date": "2015-09-09 14:34:56"
  },
  {
    "review_id": "4DfWySAfdka29L08CwsUhQ",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "b11NWU8lAIuYafEpb-pg1Q",
    "stars": 2.0,
    "useful": 6,
    "funny": 8,
    "cool": 3,
    "text": "This was one of the more bizarre shops I have visited in the USA.  Clearly a take out dive with only one table with 5 chairs for those unlucky enough to need to eat in house (Moi), these folks clearly make food as a secondary enterprise to the antique business they run in the same space.  I was able to peruse some attractive Chinese and Western vases and curios while waiting for my meal to reach me in its polystyrene container.  Not an expert, but having spent enough time in China to know how these things are done, most of what I saw were copies of older pieces.  Of course, they insist they are the original Ming Dynasty pots, but no way they would leave them out in the open of a tiny resto if that were so.  The real McCoy's are under lock and key because of their large valuations.  \n\nAnyway, I know they do better with the pottery than the slop served, because the old man drove up in a Hummer full of more ceramics as I walked back to my car.  Which leads me back to the food.  I don't mind that there was no washing of hands between touching old pots and cooking pots.  I didn't mind that the menu I was forced to look at was smeared with sauce and whatever, rather than thrown away before I arrived.  I don't even mind that there was no air conditioning and the door was left wide open to allow me the pleasure of sharing my meal with flies.  \n\nBut, I did mind that the Chicken had been frozen too long and lost its tenderness, and that the Fried Rice was a copper color from being dyed by the bouillon it had been cooked in yesterday.  What surprised me in all this were the actual veggies that found their way into the dish.  Not just Broccoli, but Water Chestnuts, Fresh Mushrooms, Carrots, Snap Peas and even Black Fungus (the good stuff) were all mixed in.  I didn't expect to see that in an otherwise lackluster presentation in styro.   No. Someone around there knew something about cooking, and took the time to get authentic ingredients for this slovenly meal.  The General's sauce was also near amazing, because it actually had the Hot/Sweet balance generally considered the proper taste for this dish.  \n\nWhy they were able to develop the right sauce with the high end veggies, while throwing in old Chicken and rerun rice, is beyond me.  But, in retrospect it was no more unusual than the store itself.  \n\nI don't think I'll be back to Ying Hui unless I am looking for an attractive ersatz vase for a gift for someone I don't care too much about.\n\nPS. Don't be too impressed with that Top 100 Award.  Whether than is legit or not, it certainly wasn't given for this operation.  Those awards are for sale on the internet.",
    "date": "2014-08-26 21:20:13"
  },
  {
    "review_id": "Ln73Cn28iGvl_POF4RmQWg",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "eOumGNkn14oEJxQ_ksAVLA",
    "stars": 2.0,
    "useful": 8,
    "funny": 2,
    "cool": 4,
    "text": "China Chef in the Richboro Shopping Center is an average Chinese/American house that caters mostly to the take away crowd.  There are a half dozen or so tables, but the atmosphere is rather dreary, and not conducive to a comfortable meal.  The management is friendly and helpful.\n\nMy recent experience had me opening my bag of goodies at home for a first look.  My order of Fried Dumplings was not the crisp, browned dough pocket I envisioned, but rather a soggy, fried only on one side, unattractive package.  I had to refry them to bring them back to life. I also remixed the dipping sauce to add more heat as the one that came with the dumplings was mostly vinegar with little taste of ginger or chili pepper.  \n\nThe Egg Foo Young was thick and loaded with veggies, pork and egg, but left too long in the wok.  The surface was too dark brown, but the taste wasn't as bad as the look. The Brown Sauce was good, and there was more than needed to cover the 3 pancakes.  \n\nOrange Chicken was plentiful; enough for at least 3 helpings.  The breading was a bit soggy; again not the crunch I was looking for.  The taste was about right, but the texture was off in the same way the dumplings were.  \n\nOverall, this was an average meal with too many shortcomings to have China Chef join my short list of China joints recommended for a fast meal.  \n\nThe search continues.",
    "date": "2015-04-14 17:15:39"
  },
  {
    "review_id": "qy_1QTEdQkPuCYPGt8yo2w",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "ZNmKlbZ93EKZ77F7Q28wJg",
    "stars": 2.0,
    "useful": 7,
    "funny": 2,
    "cool": 2,
    "text": "Misleading advertising is a turn off. \n\nThis Original Dominick's Pizza joint on W. Trenton Avenue in Morrisville, Pa., has no relationship with the true \"Original Dominick's\" other than they owned/operated this restaurant until a few years ago when it was sold to the current people.  I guess the contract didn't require that the brand be protected, or perhaps the price included continuing the signage.  Regardless, if you click on the website listed here there is a straight up disclaimer that this store is not part of the family.  \n\nAnd, they really should care about their image, as the pizza and tomato pie prepared here are a few steps down from what you can eat at the Richboro and Washington Crossing outlets.  The Brooklyn and Tomato Pie slices I consumed the other evening were okay, but lacked the flavor of quality sauce and cheese.  Even the dough was less appealing.  \n\nSome may think that hanging a sign on the side of the building exclaiming new management is enough to alert the public that everything within had changed, but the name.  But, truth in advertising (even passive signs left over from the old regime) is important, and tells a lot about what is happening now.  \n\nPerhaps, that explains why the house is nearly empty whenever I drive by.  I won't be going back.",
    "date": "2016-02-26 14:45:23"
  },
  {
    "review_id": "XvWKo-IiW7WMXXx6mDQjUw",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "OvEH3jzoSeVv5DxcmP65fg",
    "stars": 2.0,
    "useful": 12,
    "funny": 7,
    "cool": 9,
    "text": "Another variation of the endless fastfood burger joints, this one a Wendy's.  \n\nPlenty of parking around the free standing building, but designed to have the only entrance door right near the drive through line.  Dangerous. Why not have them separated on opposite sides of the building to protect folks going in?  \n\nThe dining room was empty at 2:30 in the afternoon.  Clean.  Plenty of tables, with seats all facing north and south.  I was looking for something easy for a late lunch and opted for the 4 for $4.  Fine print - you get a single sandwich of your choice, and must accept the 4 count chicken tenders, flies and a drink.  Want 2 burgers?  Tough luck. That's not how this deal is played.  Ridiculous!\n\nCan't remember what I ate, other than it was hot and forgettable.  The tenders were average, and the French fries pretty good.  Large lemonade washdown.  Guess that's the point.  When the fries are the best part of the meal, there is a serious creativity problem at Chez Wendy.\n\nHo - hum.",
    "date": "2016-10-18 18:51:44"
  },
  {
    "review_id": "9DeVIArcBPJF7bC4u9XgHQ",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "UrSj-PThC681ei_iIAAwMA",
    "stars": 2.0,
    "useful": 2,
    "funny": 0,
    "cool": 1,
    "text": "Miller's Ale House is a chain out of Florida with outlets from Nevada/Arizona, to right here in River City.  It sits on Rt. 1 (Southbound side) in Langhorne right up against Oxford Valley Mall.  It is easy to miss.  \n\nPerhaps, it should be.  It is basically a sports bar with televisions abounding, large beer offerings (the usual suspects in national brands, plus some better known smaller breweries.  The food is what we have come to expect from similar houses - lots of fried food, burgers, wings, salads, even an occasional lobster has been seen sitting at the bar.  It is all basically okay, but nothing worth going back for a second time, unless you find the bartenders or waitresses to your liking (then you are not going for the food). \n\nGiven a choice, I prefer the genuine local establishments, which in Newtown are The Clubhouse, Isaac's, Friends, and even The Green Parrot for either a comfortable place to drink and smooze, or watch the Olympics.  We all know our favorite dives.  \n\nMiller's is an adequate alternative, but never feels like home.",
    "date": "2014-02-12 18:21:33"
  },
  {
    "review_id": "hSyWMAorkJt7D8pziG2e9Q",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "yT5slfg8C1WijE0FiUiebg",
    "stars": 2.0,
    "useful": 11,
    "funny": 6,
    "cool": 8,
    "text": "When it comes to old line fast food burgers like Wendy's, everything has to be graded on a curve. No one gets an \"A,\" so to make everyone look better, the best of the worst gets the highest grade and all others climb a few steps. Yes. They are better than they used to be. But, no. They are not as good as the weakest of the newer fast casual competitors. \n\nSo, very late from court, and famished, I saw the polkadot dress and drove in.  My Doublestack came preloaded with ketchup, mustard, pickle, red onion and lettuce. When undressed, the bun looked as it had been compressed in wrapping.  The taste was reminiscent of a burger I used to know, but the saltiness detracted from the possibility of true enjoyment. \n\nThe fries were fine. \n\nThis \"4 for 4\" deal comes with mandatory processed chicken pieces (scrappled chicken), that was oily and nearly inedible. One was enough. They must have manufactured a billion of them, and be trying to get rid of them 4 at a time through this marketing gimmick. Bad idea. Better just to throw them away, and make it a \"3 for 3\" special. \n\nThe service was decent. The folks behind the counter were doing their best to keep everyone moving forward. This small store had plenty of seats and parking, so there's that.",
    "date": "2017-05-07 15:56:31"
  },
  {
    "review_id": "TdMh_Vin5oW3ZKjed3Nf5g",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "TJops8nRvZEbFnSQrTr3HQ",
    "stars": 2.0,
    "useful": 16,
    "funny": 7,
    "cool": 6,
    "text": "Kam Buffet sits deep in the heart of Trenton off Clinton Avenue.  It is a fairly large space and seems to have an active lunch trade.  Service is minimal as in most buffets, with the two women in black directing seating and delivering drinks.  They are friendly enough.\n\nThe food spread is a combination of hybrid Chinese American, Latin and variations of fried chicken for everyone.  I sampled a cross section of their offerings, including, General's Chicken, Sesame Chicken, Egg Foo Young, String Beans, Pepper Beef, Boneless BBQ Ribs, and Dumplings.  All were average to below, and some were cool from too much time out of the sun.  Edible fare, but far from inspiring.  \n\nThe biggest problem is price.  When such low quality victuals cost $10, there is something wrong with the proposition.  Even Flaming Grill out on White Horse offers much more for substantially less.  And, they use bigger plates without the notice everywhere that if you leave food on your plate there will be a 15% extra charge for waste. Plus, an extra buck for hot tea!  Not a fan of buffet police. \n\nHard to recommend Kam unless you are in the immediate area without means of getting to another Chez Chinois.  Almost every China shop around here has lunch specials for $6 to $8, where the quality is better, and the portions ample.  \n\nKam Buffet. Once was enough.",
    "date": "2016-10-26 14:12:47"
  },
  {
    "review_id": "P9O-r82NQaksY9i1nTsfXg",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "3C63o6HDQNbIH46XpMn34g",
    "stars": 2.0,
    "useful": 46,
    "funny": 24,
    "cool": 35,
    "text": "City Market on Main Street, Lambertville, NJ, has all the charm of this river city, with a 1910 look and feel. High tin type ceiling, large blackboard menu, wooden counter for eating in back, and a window bar in front for sipping coffee. It is definitely a place you feel comfortable and timeless. \n\nThey are open for breakfast, and I was there to sample it. I asked the friendly server what they were about, and she replied that breakfast sandwiches were one of their claims to fame. Okay. Let's do a sausage, egg and cheese on Kaiser roll, please. I settled in with a mug of joe and waited for delivery. It arrived minutes later on a real plate, cut in half, and meekly smiling at me. \n\nIt wasn't all that good. Frozen sausage patty, single fried egg a little too dry, and melted white American cheese, on a tasteless, industrial strength roll that looked to have been crushed in transport. Not much effort, nor creativity put into it. Average at best. Not at all what I expected from a Lambertville institution, where the city itself is all about surpassing culinary expectations. \n\nWith all that atmosphere, City Market could and should have been so much more than a boring, unimaginative sandwich.",
    "date": "2019-01-10 16:32:57"
  },
  {
    "review_id": "0i243h3GnN3rqGXZYhW93Q",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "HTIfW4eRFGioZlCg38cRTQ",
    "stars": 2.0,
    "useful": 14,
    "funny": 10,
    "cool": 14,
    "text": "BREAKFAST REVIEW ONLY\n\nPeter's Pizza & Deli is on the bottom floor of the corner highrise apartment building at Cooper & Market Streets, Trenton, NJ, right across the streets from the Hughes Justice Complex and the Mercer County Criminal Courts.  As \"Location is Everything,\" these guys should have it made.  In fact, they do a good business for breakfast and lunch during the workweek.  I stopped in for a late brekkie earlier this week.  \n\nThe shop was empty but for me around 11.  It is small with only a few tables.  Ordering is done at the counter, where you return to pick up your meal.  I went with a sausage, egg and cheese sandwich on a Kaiser roll, plus coffee.  I watched as the eggs were cooked in the microwave (don't like what this process does to eggs), and the sausage done the same way. The cheese was added at the end and melted by the heat of the other ingredients.  The roll came out of a plastic bag.\n\nI can't say that I really enjoyed this sandwich.  The roll was soft; without much flavor and little texture.  The eggs were fluffy, but with almost no taste.  The sausage was okay, but would have really come to life if grilled on steel.  The coffee was decent.  \n\nLooking around, the pizzas on display looked better than the sandwich I was eating.  I might return to check out a few slices, but the breakfast sandwich was one and done.",
    "date": "2017-07-02 15:02:16"
  },
  {
    "review_id": "NFDnQswZkqf_iXOc4jLmtQ",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "75HBnWTI2FYM1xErXrU4QA",
    "stars": 2.0,
    "useful": 1,
    "funny": 2,
    "cool": 1,
    "text": "I must confess.  I don't like malls. They seem dinosaurs in the 21st Century. \n\nPerhaps, part of the problem are the anchor tenants; those big department stores that try to be all things to all people, and end up being quite the opposite - offering a sad retail experience that feels lifeless.  So it was when I decided to go to Sears to purchase a replacement for my dearly departed 12 year old Hoover canister. I knew I was risking a bout of depression, but throughout my life Sears was the place where appliances were plentiful.  My grandfather shopped there for refrigerators and washing machines with me in tow, and I would continue the custom with my son. \n\nNot much to report beyond the fact that our saleswoman was knowledgeable and honest enough to point me in the right direction even when the price was lower.  Ended up with a Hoover Whirlwind in light blue. Good price.  \n\nAfter putting it together at home, and running it in the family room and a bedroom, I can candidly say that it sucks.\n\nThat is a good thing.",
    "date": "2014-03-30 16:32:41"
  },
  {
    "review_id": "VJQJJFaLqnVWemGbaIzYfw",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "BmNtCe92XpAS9Q6NbGGU_A",
    "stars": 2.0,
    "useful": 20,
    "funny": 10,
    "cool": 13,
    "text": "Fu Wah (Happy Children) is a small Chinese shop in an old strip center on Olden Avenue Extension, Ewing, NJ. It has the advantage of 8 booths/tables for the eat in crowd, in addition to a brisk take out business. The whole family pitches in during summer. Mom took my order at the front counter. Dad woked it up in the kitchen, and young son served me with a spirited, \"Enjoy your lunch.\"\n\nI would have if the hot and sour soup did not have a large lump of pork fat below the surface, and the sesame chicken wasn't all dark meat with little sauce to stir into the yellow dyed fried rice. \n\nGet the picture? Not the greatest effort by these happy children.",
    "date": "2017-08-17 14:39:23"
  },
  {
    "review_id": "frYaT_ukq7hIY1kzJUd5GA",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "UrWsPqcJFlf5sGVRZzsuYw",
    "stars": 2.0,
    "useful": 41,
    "funny": 20,
    "cool": 29,
    "text": "Was a time Dunkin Donuts was about the best coffee/cake sweets house in the nation because of their consistency. No matter where your caffeine bug bit, there was a DD nearby that could be counted on to offer java and fried dough that was similar from place to place. \n\nMaybe it's because there are so many coffee houses and high quality roast cafes around these days, but it has been a long while since I truly enjoyed a cuppa joe from Dunkin. Could be the quality of water has declined, or that the beans have suffered from lax quality control or increased competition from all the new java outlets, but even the sweet dough lacks the enjoyability of the old days. \n\nHence, I was not surprised when I stopped in to this DD/Baskin Robbins joint to give me a boost the other night, and the small coffee and sour cream rounder were both hopelessly ordinary and lacking in life energy. In a word, they sucked. \n\nSaving grace? The shop was large and had ample seating. The people working there were pleasant and engaged well with customers. \n\nHo Hum.",
    "date": "2018-03-21 18:02:52"
  },
  {
    "review_id": "yKW0yMOzfTOr6uhwBALZ1Q",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "DrjRjaQpZJAVFFR68_xq0g",
    "stars": 2.0,
    "useful": 41,
    "funny": 33,
    "cool": 34,
    "text": "It's one thing to be almost out of donuts late on a Saturday night, quite another to leave the shop like it was hit by a cyclone. \n\nThere were very few choice by the time we arrived around 8:00 p.m., but enough for our limited sweet tooth and caffeine needs. I grabbed the last toasted coconut, and my sidekick the double chocolate. It was difficult to see what was in the bins because the paper liners were pulled out far enough to block the view, but not removed all together. The same was true around the trash receptacle, where many of the used napkins were scattered around, and the thin waxy sheets used to pick up and bag the donuts were crumpled and tossed haphazardly on the floor and counter. \n\nDude in the sloppy outfit and bedraggled white apron seemed to be working alone. Tidiness had gotten away from him, but he did have time to talk on his mobile, and with a bud who was hanging out at a corner hightop. \n\nDunkin or DD, there are certain basic requirements for doing the job correctly, and keeping the joint clean is one of them. He must have skipped that class. Made Steve's Prince of Steaks right next door look like a shining palace by comparison. \n\nOh, yeah... The donuts and coffee were fine.",
    "date": "2020-02-25 15:51:12"
  },
  {
    "review_id": "wjnZjsHYzsW9BDQ1YwCVug",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "bSKXUH3M69T5FWPCP4qb4A",
    "stars": 2.0,
    "useful": 54,
    "funny": 30,
    "cool": 38,
    "text": "Bonnet Lane Family Restaurant is a long standing urban diner on Old York Road, Abington, PA. The space is separated into two rooms; a dining room and another with counter service and a few booths. I chose a spinner at the counter nearest the kitchen swinging door where I could see the work area within when the door opened. Service was provided by a crew of dear ladies who addressed me as, \"Dear,\" throughout my stay. Lovely, efficient and culturally affected. I didn't mind as long as they filled my coffee mug as needed. \n\nTheir menu was most the usual suspects, with daily specials on a separate A-frame in thick plastic on the counter and tables. I went with the Greek Omelette, with the home fries inside the egg shell (That's just the way I like it.) Rye toast finished the platter. \n\nLoved the way all the flavors ran together, with the feta cheese offering the sharpest retort and the potatoes the most texture. The tomato, onion and spinach nicely occupied the middle ground between these two edges, while the crisp rye complimented the eggs with its mild savoriness. \n\nI was in a groove with the meal feeling content and nourished. As I sat finishing my coffee, the kitchen door swung open and I saw two kitchen people prepping food without gloves. I didn't know if this was standard practice or just a solitary slip of their more rigorous cleanliness routine, but in the Age of Coronavirus such oversight is not just unacceptable, it's downright dangerous. \n\nPlease guys, caution and public health requires constant vigilance.\n\nMinus 1 Star for unsanitary conditions.",
    "date": "2020-03-12 15:59:04"
  },
  {
    "review_id": "WgOtdwmYyKF4sKzCxnq22Q",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "9Q_dbzylYiWdF11lH8uaSg",
    "stars": 2.0,
    "useful": 45,
    "funny": 24,
    "cool": 31,
    "text": "Sulimay's Restaurant down on lower Girard Avenue, Philadelphia, is another of the many neighborhood corner luncheonettes that help define the incredible communities they help anchor. Fishtown has plenty of them, full of local charm and generally excellent grub. We have breakfasted at many of them and looked forward to checking out Sulimay's. \n\nWalking in, the space was larger/deeper than expected, with nice counter up front and substantial dining room with booths and tables back to the kitchen and restrooms. It was clean and bright with interesting antiques and curios hanging on the walls. We were escorted to the last booth in back where the crash and din of the busy kitchen was easily and entertainingly heard. Our server promptly brought a carafe of coffee and side of milk for me, more than enough for the entire meal. \n\nI was curious about the PBC (Philadelphia Brewing Company) Kinsinger corned beef hash, which came with 2 eggs, hash browns and toast. What effect did beer have on it? Soon found out. DT had a simple scrambled eggs, house made sausage, hash browns and toast. \n\nThe beer added a touch of savory to the well ground corned beef hash, while the over easy eggs mixed well to moisten the somewhat dry hash. Unfortunately, the potatoes on both plates were on the grill too long and were blackened carbon, although hidden from view by placing it face down at the bottom of the food pile. It was obvious that the cook saw it, as he had to fold them over to show only the unburned side. First bite told the bitter truth. The rest was left uneaten. The sausage was also grilled to excess and not enjoyable to eat. \n\nWe considered returning everything for a second try, but didn't see our server and given how busy it was, and our schedule, we decided to eat what we could and move on for the rest of our day. \n\nHad there been more quality control and perhaps more caring in what was exiting the kitchen these plates would not have gone out the door. They did, and gave us a poor first impression. Too bad, because Sulimay's has alot going for it otherwise.",
    "date": "2019-04-28 16:17:44"
  },
  {
    "review_id": "KHEaH-KnMMjWgBvlRYHLQA",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "nwGp8paKIE7YdsBeFh9NRQ",
    "stars": 2.0,
    "useful": 51,
    "funny": 33,
    "cool": 36,
    "text": "Round sugar cakes.\n\nSweeter than they should be, but fresh baked white cake base is tender and moist at least for a few hours. Many choices for dipped toppings in pretty colors, but all taste more or less the same. Really a confectionery more than a bakery. \n\nTo be avoided if sugar is a health issue for you. Best suited for kids whining for a candy fix, and other folks cheating on their diets. \n\nTheir Covid protocol should be improved a bit, because they allow you to come in to order and then wait outside for a staff person to bring your order out to you in 10 or more minutes. In hot or cold weather it gets a bit uncomfortable. Perhaps, a few folding chairs set up in the shade would alleviate the problem;  outdoor umbrellas, if necessary. \n\nIf you are into Ducks, don't forget your insulin.",
    "date": "2020-08-23 15:33:42"
  },
  {
    "review_id": "eDCuEEe3ZySVDzL-XvGU9g",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "KqXiZ_DvoYVyEn15pc1QUw",
    "stars": 2.0,
    "useful": 51,
    "funny": 30,
    "cool": 37,
    "text": "Well, maybe that's just marketing. \n\nTeddy says that the first ingredient in their recipe for success is quality. If that's the case, then corn syrup is really good for you, because that's the first ingredient in the ersatz breakfast syrup served with pancakes and french toast. We all know that the opposite is true, and that such sweeteners should be eliminated from your diet as much as possible. The same is true for butter. Monosaturated fats should be kept to a minimum, yet Teddy served a paper cup with a soft yellow substance in it, rather than real pats of individually wrapped butter. \n\nYes. I confess I ate my breakfast, although with less spread and sweet liquids, because I didn't want to be that guy, but decided before my first bite that Teddy would be a one time thing. \n\nI ordered a short stack when told the french toast was thick. Turned out that it really wasn't so thick, but I didn't mind putting less of the bad stuff in my body. It doesn't pay to describe the taste and texture of the meal, because it doesn't matter - it was based on artificial ingredients anyway. \n\nThe coffee was okay, and I was given real milk when I requested it. So, there's that. It also may explain why the roadhouse was almost empty when I walked in.",
    "date": "2021-07-07 17:20:27"
  },
  {
    "review_id": "45WXT9EGLBd0gnbNlv10kw",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "lRj_1nDUCdXS3LVSrg9vfQ",
    "stars": 2.0,
    "useful": 44,
    "funny": 21,
    "cool": 35,
    "text": "Maido! has seen better days.\n\nThe \"Marketplace of Japan,\" was our destination after an hour drive from Bucks. We were looking for quality Japanese noodles, ceramic bowls and vinegar unavailable at the Asian supermarket where we normally shop. To our surprise and disappointment there was little of anything on the shelves, and it looked like their inventory had not been replenished in weeks or longer. Same was true of fresh produce, where most bins were bare. What was going on here?!\n\nThey literally had nothing we came for. So, we decided to make lemonade from this sour experience, and went over to their restaurant operation in the same space and ordered a few things at the cashier before sitting on stools at a high eating counter facing onto Lancaster Avenue. The Karaage (fried chicken) and Okonomiyaki (veggie omelet) were prepared in their open kitchen and I picked them up when the buzzer alerted me everything was ready. \n\nThe chicken was deep fried from frozen plastic bag. It was not crisp, nor crunchy, but quite oily. The taste of the Karaage powder was there, but the combo of white and dark pieces left much to be desired. They need to improve the quality of those prefab chicken tenders. The Okonomiyaki was better with cabbage, scallion, pickled ginger, yam, bonito and a decent sauce, but the veggie option had little taste despite the ingredients. We finished about half and took the rest home. Its fate has not been determined. At $28+ with two tea bags and hot water, we expected better. \n\nNot sure what the future holds for Maido!, but its continued presence in Ardmore does not appear assured.",
    "date": "2022-01-14 15:43:08"
  },
  {
    "review_id": "tGylxsXf9MUh6UuOKk_PHg",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "BPlFyGgssymPIrkV1mvyjg",
    "stars": 2.0,
    "useful": 6,
    "funny": 2,
    "cool": 2,
    "text": "I just encountered a relatively unpleasant experience with Town & Country, but as the facts are uncertain, I can only fairly address the circumstances and attitudes confronted by this event.\n\nRecently I had a sports coat's lining repaired there.  When I returned to pick it up, the work was done well, but there was an ink stain on the front of the coat that had not been present when I brought it in.  I brought it back to inquire about it, and of course they denied causing it, and further could not fix it.  So, bye-bye jacket. \n\nIt is possible that there was a pen in a pocket somewhere when I brought it to them, and that the pen leaked while in their possession.  I cannot dispute that.  However, why wasn't this problem pointed out to me when I picked it up and paid the cost of the repair?  It was quite obvious when I finally took it out of the plastic to wear it.  Regardless of the time the leak occurred (before, during  or after the repair), it was certainly there when they finished their work.  \n\nIt would have been more honorable to point this out to me, rather than have me find it once at home.  I am a reasonable guy, and I recognize the ownership of the ink and time of leakage is in doubt.  Still, it was visible to me, and likely visible to them before the transaction was completed.  But, rather than be upfront about it, and explain it was not their fault and only saw the stain at the conclusion of their work, they chose to not inform me, and make me return to them to talk about it.  And, of course, they were defensive and unwilling to see any way they could have handled it differently.  \n\nNot a good business move, as I cannot continue to use their services in good conscience, and I am writing this review to warn off other people who might encounter a problem in the future.  These seem to be nice people, but a bit shortsighted.  All they had to do was deal with me directly, and as if they were sorry this happened even without any admission of responsibility, and I would have been unhappy, but satisfied with their deportment.  As it was, they failed on the human interaction scale, and lost a customer.",
    "date": "2014-05-19 16:43:28"
  },
  {
    "review_id": "lf2GOi8LDr0aviSEFcntsg",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "5iuNneK8vTYvYB9SmRWRnw",
    "stars": 2.0,
    "useful": 4,
    "funny": 0,
    "cool": 0,
    "text": "The price was great, but the bagel was way below average. \n\nThere was no differentiation between the crust and the meat of the bagel.  Just tasted like decent bread, but without any zest from a firm to crunchy crust, nor air pockets within to make the innards light and airy.  Clearly, RJ's has lost the recipe and won't admit it. \n\nI appreciated the extra cheese in the sandwich and the coffee club pricing that brought my breakfast in at a skinny $3.  But, still, if it doesn't provide the bagel experience, what am I paying for?  \n\nNew York Bagel around the corner on Parkway is a much better bagel option.",
    "date": "2014-10-06 21:36:09"
  },
  {
    "review_id": "b7djFjMInUtuhlhgthppqA",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "qvobfs0O6v_cWk5ryBmDNw",
    "stars": 2.0,
    "useful": 2,
    "funny": 3,
    "cool": 0,
    "text": "Like most of us, Crowne Plaza Philadelphia-Bucks County looked better when it was younger.  What was once smooth, soft and supple, becomes lined, cracked and brittle.  This hotel is no different. \n\nWhile it is still capable of putting heads on beds as it did 20 years ago, it no longer looks the part of a beauty queen.  The hair is streaked gray, the laugh lines more pronounced, and the plumbing often in need of repair.  Feel too hot?  Too cold?  \n\nJoin the club.",
    "date": "2014-02-19 20:20:28"
  },
  {
    "review_id": "OqzfDhgQZZwYVIdLSrs5PA",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "BJzgkme_rfJeTgZ773pZsw",
    "stars": 2.0,
    "useful": 1,
    "funny": 1,
    "cool": 2,
    "text": "While the drive thru moved well, the actual meal was not worth the wait. \n\nIt had been a while since I was this hungry and rushed enough to consider a BK stop.  This was one of those rare afternoons where I would eat at my desk. \n\nThe Mushroom Swiss Burger was a tasteless and textureless mush.  No wonder you can get 2 for $5.  They want to get rid of them. And, what about the Strawberry Lemonade?  The medium was about a half gallon of overly sweet, strawberry syruped, lemon wash ice water.  \n\nThe condensation puddle on my desk slowly spread as I wondered what had possessed me to go for this meal.  Hunger makes for some bad choices.",
    "date": "2014-08-09 01:06:53"
  },
  {
    "review_id": "f2MyD2U1_uNqOYJLJHz37g",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "X4mouE_cMiwbfyCPZ_K-FA",
    "stars": 2.0,
    "useful": 37,
    "funny": 21,
    "cool": 28,
    "text": "When you hang a sign touting one of your special offerings, you really have to deliver the goods. When you don't do so it just compounds the failure. \n\nAs we approached Marhaba on foot at the bottom of Mt. Hope Street, Lambertville, NJ, we observed and commented on the smaller sign suspended beneath the painted wooden restaurant scripted plank.\n\n\"Falafel.\"\n\nThe dining room was heavily atmospheric, with exposed red brick, hanging metal/glass lights, and attractive Middle Eastern wall art. The small candles in colorful glass holders added to the flickering ambiance. \n\nWe ordered the falafel/hummus combo plate based on their advertisement outside, and the chicken shawarma platter. Both large plates arrived about 15 minutes later. A hot pillowy pita came along for the ride. \n\nNeedless to say we were disappointed when we attempted to pick up a falafel ball with a fork. The surface was impenetrable and the tines bounced off as if striking a rock. Plan B was picking the sphere up with my fingers and locking down with my bicuspids. My jaw forced the hard shell to collapse, only to find that the ground chickpeas within were chokingly dry and almost tasteless. A hard case disaster. \n\nMade us wonder who was doing quality control in the kitchen? Why would the chef, manager or server who saw what was being served allow them to reach our table? These hardballs should have been trashed. But, it was actually worse than that. \n\nThe kitchen lacked vertical rotisserie grills for the proper preparation of gyros and shawarmas. Thus, the chicken which should have been sliced thin and constantly basted in a complex marinade was instead cut in small chunks and heated on hot steel. It was also far too dry and poorly spiced. If there was a marinade, it was weak or had only a passing acquaintance with the chicken. It was dry, lifeless and barely edible. O for 2.\n\nOn the other hand, the hummus was excellent and eating it with torn pieces of pita, great finger food. A wise person once said that life is short; eat dessert first. The baklava at Marhaba was unbelievably wonderful. Baked in-house, the phylo, honey and pistachio concoction was about the best I'd ever eaten. If that had been all we tried, this would have been a 5 star review, and we would have been very happy campers. \n\nWe only wish that we had followed that sage advice. It would have saved us time, money, dissatisfaction and many questions.",
    "date": "2018-10-22 14:34:24"
  },
  {
    "review_id": "TJQIlNlW9B7x27pEOo3nBg",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "EsQZIf_5Typ-plWtOr0DgA",
    "stars": 2.0,
    "useful": 7,
    "funny": 3,
    "cool": 2,
    "text": "Dessert Review\n\nWe stopped in Adonio's Diner as the last stop after foot massage and Afghani dinner. Just wanted some java and something sweet to finish the night's run. They advertise that they had a bakery, so they had to have some nice stuff. Right?\n\nNot quite. \n\nPerhaps, because it was a long holiday weekend, and they gave the Baker's the day off, but all they had was cheesecake and apple crumb pie, neither of which looked to be made in house.  Ordered the apple slice anyway. I have never seen a smaller excuse for a diner dessert. Where most diners go out of their way to be excessive in these situations, Adonio's fit on a small saucer, practically flat and with little apple.The taste was industrial. The accompanying cuppa joe was also small and not very good.\n\nThe dinner customers were scoring large platters of whatever, and seemed satisfied. So, this was all about apres diner offerings. For unknown reasons, mine sucked. My friend's rice pudding was okay, but also miniscule compared to what most diners provide. \n\nFirst and last impression.",
    "date": "2016-09-07 15:22:27"
  },
  {
    "review_id": "wTmM9LDQhE7xl8qUa_CDdQ",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "i1ubCIxMtPDG1su5PpasEA",
    "stars": 2.0,
    "useful": 13,
    "funny": 4,
    "cool": 5,
    "text": "This Wendy's is freestanding in the parking lot of the shopping plaza that also contains Maryanne's Homestyle Restaurant.  It has not been completely modernized yet, but it is basically clean and ready for the effort Dave Thomas' ghost is making to upgrade their facilities. They do have that super soda dispenser that allows the customer to pour their own from a multitude of options.  \n\nWe ordered the basic Dave's Single and Double, French Fries, and a drink.  Not bad, but both of our burgers were only slightly above room temperature.  They had obviously been cooked at some time before serving, and taken from a warming drawer to make the sandwich without a thought to reheating, or even putting the patty back on the grill for a couple of minutes before laying on the cold lettuce, tomato, cheese and onion.  Thus, while the veggies were cool and fresh, the main attraction suffered greatly by comparison, as the meat needed more heat to make it a full player.  \n\nEdible, but why couldn't they check on the patty and serve it at optimal temperature?  \n\nThe soda machine was fun, though.\n\nWe probably should have gone to Maryanne's.",
    "date": "2016-04-05 19:34:43"
  },
  {
    "review_id": "fSisBJkd4ovMQcb_ZdSuhg",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "hKrDe4ZgqFnizbZIM5APWw",
    "stars": 2.0,
    "useful": 5,
    "funny": 2,
    "cool": 2,
    "text": "Once upon a time, Vince's Pizza in Yardley was a regular stop on the underground pizza railway running from Bristol up to Riegelsville. \n\nIt seems that somewhere along the way Vince's recipe or his touch for making good tomato pie got lost.  Today, my slices were doughy rather than crisp, not well reheated in the oven, and had a slightly bitter taste.  Too, it failed the most crucial pizza test - when lifted off the paper plate the point sagged like an old dog ear and immediately began to drip oil.  This was not the experience I was anticipating when I stopped in to renew acquaintances with one of my old haunts.  \n\nThe price for the slices and small drink was just slightly above 5 bucks, which was great, but I would have gladly paid more for quality pizza. \n\nOh, woe is me.  How the mighty have fallen.",
    "date": "2014-05-10 00:05:58"
  },
  {
    "review_id": "5P3J3uF0Ufu6kBBDtPujvw",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "k8sK59Ft-5QpgFVuyOD0bg",
    "stars": 2.0,
    "useful": 8,
    "funny": 3,
    "cool": 3,
    "text": "For the sake of comparison, I decided to visit the Giant Supermarket in the Flowers Mill Shopping Center, Langhorne, Pa., just to see how it stacked up against my local market in Newtown/Middletown.  \n\nNot very well, I'm afraid. \n\nWhile as large or larger than my local Giant, the layout was inferior, and the space felt dark from poor lighting.  It was difficult to find certain items that were not where they logically belonged (i.e., Bubba Burgers). So, I found myself wandering down aisles thinking that there was something wrong with my vision.  No. It wasn't me.  \n\nService was fine, and the cashier very friendly.  \n\nStill, my neighborhood store retains my loyalty.",
    "date": "2016-08-01 16:53:40"
  },
  {
    "review_id": "RwTu9SwwYhq9yfHuzFKm2w",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "Uyf-8ybHaxe_Enbhcboz_A",
    "stars": 2.0,
    "useful": 31,
    "funny": 13,
    "cool": 17,
    "text": "(We) Miss Philly Grill is a stainless steel façade food emporium on Philmont Avenue in Huntingdon Valley, Montgomery County, PA.  If first impressions are important, this joint needs some help because the parking lot is a minefield of potholes to be avoided before even considering walking inside.  Not worth a tire or rim just to check out their breakfast, but if you are careful, you can make it without damaging your wheels. \n\nOnce inside, the décor and ambiance take you to another time and place somewhere in South Philadelphia in the middle of the last century. The walls are hung with Marilyn, James Dean, Connie Mack Stadium, etc., and the upholstery of the booths is red and white leatherette. Attractive and gitchy. Most of the patrons appear to be regulars from the first-naming going on with the staff. Almost all of them were bilingual and seemed interested in attending to everyone's needs.  The breakfast menu was extensive, with many specials and combo plates for those desiring a thimble of juice and mug of Joe with their egg dishes.  I certainly did.\n\nI went with the french toast, orange juice and java. In reverse order, the coffee was decent, but served with those coffee creamer things. As that is all corn syrup and chemicals, I requested some milk as an alternative. I got it, but it took a while. The main course was okay, but it was presented sloppily, looking like the cook had just tossed it on the plate with no attempt to make it look attractive.  There were even little pieces of eggy bread detached from the slices on the dish.  I had to reorganize it before putting on the butter and syrup.  The \"butter\" was all prepackaged in tiny plastic tubs, and had the consistency of soft margarine.  Syrup? It came out of a label-less plastic squeeze bottle that had been refilled a million time with an industrial strength amber sweet goo. The OJ was poured from a large plastic pitcher of unknown age and origin. \n\nYou get the picture. \n\nEvery corner that could be cut to save a penny, was sliced thin. The result was a breakfast that could not be traced to the source, nor offered with pride of ownership. It wasn't that it was a bad meal, it's just that it lacked care and quality control.  The taste was close to being good, but fell short in various ways.\n\nMiss Philly Grill? It takes more than a chill environment to make me miss it enough to want a return visit with all the potholes inside and out.",
    "date": "2017-12-06 19:26:08"
  },
  {
    "review_id": "GY9fHEN7nRi6Cy-0uwVwaw",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "hprpU8NIM_w7k6Dhc09Tvg",
    "stars": 2.0,
    "useful": 6,
    "funny": 5,
    "cool": 6,
    "text": "There are dive bars.  There are dumpy dive bars.  And, then there are hell holes.  \n\nPenn Tavern sits at the borderline between the last two, as well as on a dark strip of West Bridge Street in Morrisville, Pa.  The evening I was there the crowd was sparse with no more than 6 people on stools around the worn out bar.  The friendly/attractive bartender was just back from surgery and was obviously uncomfortable moving around.  The folks on one side of me were in a conversation laced with F-bombs.  The person on the other side was singing along with the music coming from the jukebox in the basement (I was amazed she could hear it).  \n\nThe floor was in need of reinforcement, as only the underflooring was visible behind the bar.  The draft beer handles were all off to one side at the edge of the bar zone, attached to the freezer where the kegs were housed.  It had been a very long time since I saw a set up like that. All the pulls looked to be domestic.  My Yuengling mug was only $2, and I read elsewhere that a $.75 draft was available.  \n\nI needed a place to spend an hour while waiting for a local class to let out, and Penn Tavern was the next on the list for a visit.  Compared to the other neighborhood drinking halls, this is at the bottom of the (beer) barrel.",
    "date": "2016-01-13 17:09:14"
  },
  {
    "review_id": "iFZNXDUG8azTR0VC9eY2Jw",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "pDOmFcUzaCzh2ETvx6z4BQ",
    "stars": 2.0,
    "useful": 21,
    "funny": 11,
    "cool": 9,
    "text": "MUFFIN & COFFEE BREAKFAST REVIEW ONLY\n\nStopped in the Vincentown Diner after court in Mt. Holly this morning for a late light breakfast. It has been at least a decade since my last visit, and aside from the new sign out front, the inside looked basically the same with two main dining areas, a long counter with spinners, and servers in black.  It also has signs referring to local sourced foods, craft beer, and french press coffee.  The lighting seemed a bit dim which felt more somber than comforting. \n\nI sat at the counter and was promptly approached by a woman in black offering a menu and asking if I wanted something to drink.  Coffee, please.  It arrived in a larger cup, about twice the size of the normal diner serving.  Nice touch. Felt generous. \n\nI inquired about muffins, and was advised they had corn and blueberry.  A toasted corn muffin was exactly what I wanted.  The menu called them, \"The Real Deal!\"  It arrived cut in thirds and well grilled on top and bottom.  I small cup of butter and two jelly containers came along for the ride. I spread some butter on the heated surfaces, but pushed the sweets aside.  \n\nFirst bite was a small surprise.  Rather than having that expected corn muffin flavor, the mix included Lemon Zest, making the taste more a lemon corn muffin, than the traditional rich corn flavor and texture.  Disappointing, but certainly an acceptable variant if notified beforehand.  That was not the case here.  \n\nAll the above would have resulted in a three star review, but for the heartburn I have been suffering since leaving the diner.  Whether the coffee or the muffin were the \"Real Deal,\" or not, that was an aftertaste I could live without.",
    "date": "2017-03-16 16:44:07"
  },
  {
    "review_id": "3eXGuGUd3mO6TQjLjsC37A",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "6kX0lZkpfQQmNWaIjpcsKw",
    "stars": 2.0,
    "useful": 42,
    "funny": 21,
    "cool": 26,
    "text": "While Peace Valley Park is a beautiful oasis of field, forest and water, when I visited last weekend there was nary a parking space. People were packed in on the trails and along the waterfront with little concern for social distancing, nor masks. It looked so unsafe to be there despite the perfect weather, that we decided not to search for parking, but to leave the park for another less overcrowded day. \n\nWe are all feeling rammy about the too long quarantine and have chronic cabin fever, but to ignore the advice of health experts that precautions remain essential to avoid infection, is to not only risk my own life, but the lives of those I love. \n\nThe North Branch of Neshaminy Creek and the reservoir from its damming (Lake Galena) will still be there when it is safer to explore.",
    "date": "2020-06-18 16:18:59"
  },
  {
    "review_id": "MX6Y8LmDuFQoILMZd2om3A",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "29OSyDLAiX1nxP1SEaSWtg",
    "stars": 2.0,
    "useful": 49,
    "funny": 32,
    "cool": 39,
    "text": "These new fangled Wawa stores are a great improvement over the last generation small box iteration with too small parking areas, and limited prepared food options. The 21st Century variation are at least 2,500 square feet, with gas pumps outside and elaborate food kitchen and computer aided ordering system able to please even the most picky pallette. The coffee hasn't changed much, but then again, it was darn good back in the day, and remains so. \n\nBut, despite the impressive modernization, these roadside way stations are far from perfect, and actually create some problems that didn't exist before. This facility on Parkway Avenue in Ewing, NJ, offers obvious examples of this evolution. \n\nAccess is only through a side street and a too narrow long driveway off to the side in front. At a significant intersection, it makes for challenging traffic entering from Parkway or exiting from the rear of the property. Too, there isn't enough parking around the building to accommodate all the folks going inside for food and drink. Two things therefore happen; first, people are encouraged to leave their vehicles at the gas pumps while they shop within, and second, others park illegally wherever they can, hoping not to cause a park rage incident. I've seen one such confrontation, and it wasn't pretty. \n\nThis friction point is exacerbated within by understaffed kitchen help causing back up in food prep and lots of people milling about with receipts waiting for their numbers to be called. It's a beautiful industrial kitchen, but whenever I am there, several food stations are without preparers, while one or two areas over backed up to the max. So, people wait, while many cars are interfering with traffic flow outside, and people can't get gasoline because abandoned looking vehicles clog the gas islands.\n\nBottom line, the store is too big for the lot it occupies, leaving too few parking spots. Greedy developers clearly oversold their prowess as designers of business flow, and the undermanned planning commissions approved the plan without adequate analysis. The internals should work, but if management fails to adapt to reality, there will never be enough workers on site to handle the crush inhouse caused by poor planning on the outside and shift manpower shortages. \n\nThis is how old problems reemerge in the new world. Poor planning and management is timeless, and in some cases, inevitable.\n\nPS. The chicken salad on wheat torpedo was quite good.",
    "date": "2021-05-26 17:42:05"
  },
  {
    "review_id": "XDrEn_95olyu-tWZtsG37A",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "NO6tZEjT8B9JB9CNbdy3uQ",
    "stars": 2.0,
    "useful": 35,
    "funny": 19,
    "cool": 23,
    "text": "Found a nail embedded in the edge of the tread in a Run Flat Michelin. Drove over to Mavis on Route 1 across from Oxford Valley Mall because I had had a good experience at a different one of their tire havens in Richboro, PA. This one was closer to home. \n\nThe place was moderately busy with four bays with cars in varying degrees of repair or tire changes. Good sign I thought. Walking in, a manager approached to ask if I had an appointment. Didn't know I needed one, but he was cool about it. A few minutes later we went to look at my tire problem, saw the nail sticking out, advised me it had to be replaced due to where it was, and returned to the front desk to see if it was in stock. \n\nIt wasn't. But, he would order it and have it by Saturday sometime. He said he would call me when it came in and we would switch out the bad for the new. Sounded like a reasonable plan. I left there satisfied. What was one day?\n\nThe call never came and I ended up visiting a different tire center that also had to call for the Run Flat to be delivered to them the same day, for a few bucks less. They did call on arrival and the swap out was accomplished later the same afternoon. \n\nReally appreciated their effort and friendly professionalism, even if their name wasn't Mavis.",
    "date": "2020-07-13 11:38:57"
  },
  {
    "review_id": "BbRE93K2RF7b6J---b9ccw",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "Ju387TbKcIby6dPCULEiBg",
    "stars": 2.0,
    "useful": 7,
    "funny": 5,
    "cool": 2,
    "text": "This review reflects only the lunch buffet and service surrounding it. \n\nIn a sequence of odd/violative behavior from the moment we walked in:\n\n ~ Although the place was almost empty, the greeter walked us to a booth right next to the only other occupants of the restaurant.  We relocated ourselves so all of us could have some privacy, but new customers were continually brought to the same area and seated too close to each other. The remainder of the floor remained unoccupied. I realize this is a Chinese custom, but here it is not cool.  VIOLATION.\n\n~ The buffet looks great, yet although we were making our choices shortly after 12, everything placed on my plate was at best warm, and at worst, room temperature. Nothing I tried was heated to the right temperature range. VIOLATION\n\n~ One of the managers came out of the kitchen to check what was needed. She was not dressed for kitchen work, nor did she wear gloves as she handled the food and utensils, pushing the contents of the chaffing dishes around to make room for more.  VIOLATION\n\n~ As we were eating our first round of food, and long before we were finished, a wait person dropped off the bill in the plastic billfold.  Not only was it \"served\" way too early, but it was placed right next to our plates full of food.  The table was otherwise empty, and there was plenty of space for it to be laid an appropriate distance from our plates. Not a word was said, and the male server seemed almost hostile.  We relocated it to the opposite corner of the table away from us.  VIOLATION\n\n I hesitate to consider what goes on with the sushi. \n\nNo seconds today, thanks.",
    "date": "2013-08-02 21:26:12"
  }
]