[
  {
    "review_id": "AOzoPJHUx77smdu9q0cpnQ",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "ka-GZEjFKl8lmDXlZPftoQ",
    "stars": 1.0,
    "useful": 1,
    "funny": 0,
    "cool": 0,
    "text": "Unfortunately, Agabiti's Cafe has closed its doors at this location. \nWord is they are looking for another place to open shop in the area.\nGood luck to them.",
    "date": "2013-01-25 14:37:18"
  },
  {
    "review_id": "Ao9WSnfYwAnWk9Tz3Xdd0g",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "ri1v4DsR33yeH9SK4Jz4gA",
    "stars": 1.0,
    "useful": 0,
    "funny": 0,
    "cool": 0,
    "text": "Sarcone's Deli is gone forever.  \nRIP\nPrimo's has now taken its place.\nGood luck to Primo and its customers.",
    "date": "2013-01-24 15:22:55"
  },
  {
    "review_id": "5bwbpfKQmNbhXQGtqx14uA",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "zQPHrply2yeB1EGNnoS66A",
    "stars": 1.0,
    "useful": 32,
    "funny": 22,
    "cool": 25,
    "text": "\"Andale,\" means \"Let's go,\" or \"Hurry Up,\" en Espanol. \n\nAll I can say after my visit there earlier this week is, \"Andale out of here!\" \nThis local Chipotle wannabe seems to have lost some of its magic described in earlier reviews. What I discovered was a small make it as you like it shop in need of a thorough cleaning and responsible guiding hand. \n\nJust standing at the order section of the assembly line it was easy to see that the kitchen was not regularly nor professionally cleaned daily. With so many open chaffing dishes in a warm room, the opportunity for bacterial surprises were everywhere. I considered leaving without eating, but I wasn't feeling hostile - just concerned that there was some risk eating there. \n\nI decided to accept the risk, because the folks working there were pleasant and I wanted to avoid a scene in front of the other customers. Went with a chicken quesadilla to remove all those leafy choices from the meal.  Yelp had a check in bonus of a free soft drink with the solid options.  Those whistle wetters were from Jones Soda, the all natural sugar people. I had a choice of bright colors - Blue, Green, Red, Pink, etc. I selected the blue one that said it was blueberry lemonade soda. Neon blue. 100% sugar. Totally undrinkable for anyone who values their health. Left it at the trash deposit. \nThe quesadilla was okay, although the little chicken chunks had a mildly weird flavor from their marinade.  Sour cream? I don't know what that thin watery white liquid was, but it is doubtful it was dairy. Again, too fearful to indulge. Thanks to the Cholula Hot Sauce, I evoked some spicy taste from the grilled cheese and chick. \n\nThis is a once only experience. With so many really good Mexican or quasi-Mexican joints sprouting up in the area, Andale will likely be departing at the end of their lease. \n\nJust not good, and far too dirty to avoid the health department for long. \n\nAndale, Andale!",
    "date": "2018-04-26 19:13:41"
  },
  {
    "review_id": "61GbCZVxFZF4JMecqffdGA",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "hYXUmvr48ucxDtxk2K6k7Q",
    "stars": 1.0,
    "useful": 51,
    "funny": 26,
    "cool": 34,
    "text": "Below average wings at best. Ours were cooked to order, but overstayed their welcome in the deep fryer making them dry and way more chewy than should be. More like chicken jerky. Too, the fries were limp and dying by the time the styro packaging was opened. At least the Fanta Orange was as expected. \n\nDefinitely a one and done experience. There are just too many quality wings available in almost every restaurant in  the country to be satisfied with such a poor effort.",
    "date": "2019-03-30 15:10:38"
  },
  {
    "review_id": "lonN1giKi-aGGayOHZG9Ww",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "xTpaOKONNfagG3uISme8lw",
    "stars": 1.0,
    "useful": 9,
    "funny": 1,
    "cool": 1,
    "text": "This one is difficult. \n\nJoey G runs this deli near my home.  My young son likes to ride his bike down the road to get a snack there.  He enjoys the sense of independence this engenders.  It is the only place within a safe distance.  Yet, when I went in for lunch or to pick up milk or eggs for home use, I became wary of the sanitation standards.  The milk was sold after the \"sell by\" date. There was deli food outside the refrigeration unit when not in use.  The floor behind the counter was not always clean.  Then, I read the Bucks County Department of Health Inspection Report from 11/13, and saw that there were other significant problems, like no hand washing sink, mouse droppings, old fly paper, open doors without screens, and no soap for washing. \n\nThese were all signs of failing quality control and lack of supervision.  Still, the food prepared there was decent to good.  And, Joe does a good job with his catering.  I have had many experiences with his victuals at business lunches, and never had any real issues with it.  In fact, his crab cakes are excellent.\n\nThe website informs that there are now 3 locations for Joey G.  I applaud his success, but suspect that he has not caught up with the extra personnel and training needed to manage a larger operation.  As Joe is a well known chef, it may behoove him to hire an experienced manager to run these shops, rather than attempt to handle everything himself or in family.  \n\nNo one likes to see a promising food outlet struggle to maintain high standards.  It is too easy to lose customers who won't give it a second chance.  But, more importantly, no one should have to run the risks that attend to dirty facilities.  Because this deli is in our home court, we will no doubt return and check out the improvements.  If they straighten out, we will remain customers (and raise the rating).  If not, most will migrate out of Joey G's orbit and find more acceptable places to buy our meals, snacks and drinks.",
    "date": "2014-01-15 15:26:26"
  },
  {
    "review_id": "600FHuj-6pwCZwZT7xhvqA",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "MqhQlbkYd9dShIEcPbmS_g",
    "stars": 1.0,
    "useful": 23,
    "funny": 6,
    "cool": 9,
    "text": "Heard good things about Pho & Beyond in Willow Grove, and was happy to have the chance to try it out.  \n\nIt is on the first floor of a newish commercial strip off Davisville Road.  Entry from front and rear.  The décor is simple/comfortable Asian.  The menu is fairly complete for Vietnamese cuisine, with everything from pho to com, banh mi, and even bun bo hue.  Service was friendly, if a little lagging.  \n\nWhile I admit to enjoying my Pho Ga (Chicken Noodle Soup), the taste of the Pho Tai (Beef Noodle Soup with Ribeye Steak), and the Bahn Mi  Mem Nurong with BBQ Pork patty, the entire experience was blown up by the realization that some part of my meal had been doused with MSG, leaving me with an allergic reaction that felt like a mild hangover, without the alcohol.  \n\nTrue. MSG is a traditional part of Vietnamese and other kitchens, used to cover up stale meats and \"enhance\" flavor.  I guess that is what they mean when they talk about, \"...authentic Vietnamese cuisine based on family secret recipes, techniques, and skills...\" on their website. \n\nSorry to say, one of your secret techniques is out.  You really should find a better way that doesn't make customers ill, or at least warn customers that MSG is used in the kitchen.\n\nClean bathrooms.",
    "date": "2016-05-24 15:39:09"
  },
  {
    "review_id": "3TpZa2OpmJ1Vdh1vhY81uA",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "VmlEHM1h7dUdEzFRtPYA7A",
    "stars": 1.0,
    "useful": 42,
    "funny": 29,
    "cool": 31,
    "text": "Maybe it was because I came in around 3 in the afternoon, but my experience at Indigrill in Ewing, NJ, was pretty lousy. Let me count the ways.\n\n1. Although nearly empty of customers, there was trash on some tables, the floor and the shelves near the soda machine and trash receptacle.\n\n2. The Bollywood dance music videos played extra loud and on a nonstop loop from the TV high on the dining room wall. \n\n3. The food counterman was pleasant, but the choices he had to work with were fairly limited, with only chicken, lamb and beef and three sauces available. \n\n4. When I sat at one of their high table stools and began to eat from the biodegradable bowl and plastic spork, I found the meats room temperature at best, the chicken stringy and the lamb low quality with fat and hard spit outs.\n\n5. The sauces were likewise cool, although they did have the right taste. \n\n6. Ultimately, there was more brown rice in the bottom of the bowl than all the other ingredients combined. \n\n7. What? No naan?! \n\nIt just wasn't very good and not worth the calories ingested, nor the more than $10 price with the sugary drinks. \n\nI am not a fan of Chipotle Mexican Grill for its lack of authenticity and the comparison to the multitude of excellent Latin American restaurant with high quality offerings that abound in Central Jersey. The same is true for assembly line Indian cuisine. With all the wonderful South Asian houses within a 10 mile radius of here, why would anyone choose this poor copy of that bountiful and varied colorfully spiced deeply curried food? \n\nThe answer to that eternal question? No one with a working pallette and taste buds would, unless they were on a student budget that allows them to be abused by this low end excuse for fast food. \n\nThis place is atrocious.",
    "date": "2020-02-19 23:12:43"
  },
  {
    "review_id": "Dbae84n4JFS3MAv3m5iGNw",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "KdvvcPL7xxl6Xmy1OpDczA",
    "stars": 1.0,
    "useful": 3,
    "funny": 3,
    "cool": 2,
    "text": "Located in a rundown small strip commercial center where New York Camera is located on Bridgetown Pike, Happy Star Restaurant is at its root a take out joint with a couple of tables with ripped/torn chairs for the unfortunate few who opt to eat there.  I belong in that group, as I was returning from a meeting and wanted to have lunch before arriving at my office.  \n\nI ordered the General Tso's Chicken, as I often do the first time I dine at a Chinese shop.  Everything arrived quickly on a styro plate and with a plastic fork. Lovely.  Clearly they had no interest in making a dine in meal an even minimally pleasant experience.  At this they succeeded beyond measure.  The broken A/C on this hot afternoon just added to the overall ambiance of careless indifference.  \n\nThe meal itself was pedestrian.  Chicken in a thick fried coating, but with a decent sauce with enough spice to know it was not just the same sweet sauce used on other dishes.  The fried rice was yellow from the dyed chicken broth the rice was cooked in. One sprig of broccoli for contrasting color.  These folks had perfected the art of the cheap combo lunch.  No extra charge for churl.  Oh, and a can of soda - but extra for tea. \n\nSo,  there is no reason to return other than if I had masochistic tendencies.  As I do not, this place will soon be forgotten.  Written off on this site as unworthy of time, appetite, nor money.",
    "date": "2014-05-17 15:46:17"
  },
  {
    "review_id": "fHjZmZIaIdP7aBWB6yJgHg",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "hLRyFYj2InENi2xhVJfPZQ",
    "stars": 1.0,
    "useful": 47,
    "funny": 20,
    "cool": 26,
    "text": "The bagels were denser than I like, but otherwise Redhouse Bagels is a busy place on a rainy Saturday morning. Bakery in back, plenty of friendlies working the front of the house, and around ten tables for a sit down quick bite breakfast. My Onion Bagel, butter and Swiss sandwich was tasty with lots of baked onion flakes falling off with each bite. It was fine.\n\nNo, the turnoff came all at once when I took a visit to the men's room. There was a leak in the sink faucet that was causing black mold to grow at the base of the spigot and on the strainer over the drain. It looked like the condition had been active for a while. Given how toxic black mold is to some people it was shocking that it was allowed to remain without active professional intervention. \n\nPlease take care of this before someone becomes ill from it. If the Department of Health sees it, the shop will be shut down until it is returned to a safe condition.",
    "date": "2020-01-26 02:27:02"
  },
  {
    "review_id": "Ffnxgt9jwYBQdvLBbJ8zfQ",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "I_wP6Zz_LMJXqiqTFo2eig",
    "stars": 1.0,
    "useful": 6,
    "funny": 4,
    "cool": 5,
    "text": "I think maybe I have grown tired of Five Guys Burgers & Fries.  This kind of experience used to be fun and unusual; a decent alternative to the traditional fast food slider & taters.  Not so much now.\n\nThe shtick is that you have a limited choice between a single or double (regular) burger, hot dog, and flies.  You can put almost anything you want on them from the list above the cashier.  That's cool, but when you have to repeat yourself three times to the order taker, and it still comes out wrong, it is a bit frustrating.  Then, there is the meal itself.\n\nI asked for a regular (2 puck) burger with ketchup, fried onions and jalapenos, and a side of fries to share.  What I received was a crushed limp sesame sprinkled bun that could barely hold its load.  It managed to do so for the first bite, but the second clenching was too much torque and the burgers were expelled from the bun on a running river of ketchup and slick onions.  Looked like red mudslide.  \n\nOkay. So I finished the meat off with a fork and knife, as the bread had now expired.  I was surprised how lame the burger texture and taste were without the bun support. \n\nDid I mention the fries were not in the bag?  Guess the cashier didn't hear that either, but by this time I was happy for the small favor of not having to pay more than the $27 shelled out for these disappointments of a bun.",
    "date": "2016-04-21 16:24:09"
  },
  {
    "review_id": "WlVEO7x2l1cXsodx6jRdnw",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "nqQNnIAAfRa1dla5N3UiuA",
    "stars": 1.0,
    "useful": 4,
    "funny": 0,
    "cool": 0,
    "text": "Lotus Garden is no more.\nDrove by today and the sign was down and the shop was closed with a sign on the door.",
    "date": "2014-03-28 01:24:43"
  },
  {
    "review_id": "rNsAIYR31vLNIFBp4cFx_g",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "4lVR4qfWaX-wn1v4EakF8A",
    "stars": 1.0,
    "useful": 34,
    "funny": 23,
    "cool": 22,
    "text": "Barcelona Pizza is really a takeout shop with three booths for those foolish enough to prefer eating their food hot, like us. Folks are nice, but not very skilled in table service. The delivery people hang out behind the counter between packing their heat bags to make a drive. They weren't accustomed to having customers actually eating there, and we sort of felt in the way. \n\nThe food itself was average at best. My son ate his large chicken parm sandwich, but admitted to having had better. It was overly cheesed, out of balance with the red sauce and chicken pieces. The veggie calzone was enormous, and enough for four people. The crust was great, but there were far too many chunky greens and not enough tomato sauce to countervail. Too, we picked out several thick stalks of broccoli without any buds on them. Difficult to eat.\n\n Finally, I ordered the Italian Sausage, Pepper & Onion Parm torpedo, but requested that the cheese be left off, and the sauce to be on the side. Apparently, this was a major challenge in the kitchen, because rather than a  nice length of sweet sausage, I received coin sized slices of the meat no doubt designed for pizza toppings long before the sandwich was created. It was mixed with the sauce in the roll despite my instructions. So, the sausage was dry and there was too much sauce for my taste. I guess the parmesan melted over everything would hide the ingredients, but when deconstructed, it just came out poor looking and a hodgepodge of other purposed food thrown together without the understanding of what an Italian sausage, pepper and onion sandwich was supposed to be. \n\nNot even close.\n\nApparently, there wasn't an Italian in the house who could direct the kitchen staff, and the result was a poor imitation of what is basic cooking in a casa Italiano. \n\nCome on, people!",
    "date": "2019-11-23 16:53:59"
  },
  {
    "review_id": "bHTc-HIyu1x5GXMMEAG-gw",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "wWZexHCkuRXFhaapSgzeow",
    "stars": 1.0,
    "useful": 58,
    "funny": 31,
    "cool": 36,
    "text": "Sometimes the condition of the shop tells the true story. No matter how good the food is, it is impossible to dismiss what is seen on the floor, in the corners or on the back of shelves around the retail space. So it was with Wicked Bagelz in Westampton, NJ.\n\nThis is the third iteration of a bagel breakfast/lunch joint at this location since I have been regularly attending court in nearby Mt. Holly (although all court business is now done online due to Covid-19). The predecessors had a problem maintaining operations, although each had reasonably decent round bread. I was sorry to see them close. \n\nWicked Bs has a cool name and a witchy Halloween decor. Manmade spiderwebs were draped over furniture, etc. The women working were friendly, and the bagels looked good in the bins behind the counter. I arrived late for breakfast and most of the choices were gone. I snagged an Everything Bagel with Veggie Spread. It was thick, round and boil/baked with a darker flour that added a rich flavor to the dough. It was very good.\n\nBut, as I waited I began to look around at all the decorations. My vision eventually reached the floor. I noticed it was dirtier than expected, like it hadn't been swept in days or longer*. I then saw that there was black crud along the molding at the base of the display cases, coffee station and tables. Plastic bottles of soft drink lay on the floor near their cooler, and hadn't been put into the fridge. It was obvious that no one was seriously cleaning the front of the house. I didn't want to see the situation behind the counter, nor the grill area. \n\nI became more grossed out by the total slovenliness as I thought about it. No matter how tasty the bagel, the lack of concern for the health of their customers was offensive. With Covid-19 everywhere, such filth was just unacceptable and way beyond the pale. \n\nOne and done!\n\n*Management sent me a message denying these conditions exist. Unfortunately, my observations were accurate. The black streaked moldy baseboards were a sad fact and hadn't been touched in a long time. There was no spill to report, and would have been if it existed.  Regardless, I understand defending your business, and I will visit again as suggested. If conditions have improved, I will amend the review, and thank you for being a responsible owner.",
    "date": "2021-01-16 21:46:29"
  },
  {
    "review_id": "sZ8oel5k4DIxdmCW-8eIcA",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "s7xAR7fFHh2a28E62B7tVQ",
    "stars": 1.0,
    "useful": 26,
    "funny": 16,
    "cool": 16,
    "text": "Place One on Bristol Pike, Bensalem, PA, is one of those \"fusion\" houses, offering their take on Chinese and Thai cuisine. I love both styles of cooking, but seldom find them in the same place. Most are in reality operated by Chinese trying to broaden their appeal by imitating their neighbors in South East Asia.  Usually, these efforts fail due to the inability to deeply understand the roots of the secondary culture, or the unwillingness to stock the kitchen with the expensive spices required to do the dishes right.  The result is more often confusion, than fusion.  So it is with Place One.\n \nOne look around the semi-crowded dining room was a hint to what was to come.  The only Chinese, let alone Asian customers, were at our table.  We were looking for quality Chinese food that would save us the trip to Philly, and were willing to explore something off the Thai menu.  There were plenty of options on the list, all somewhat descriptive; with little red peppers indicating what was spicy.  We ordered an app of Thai calamari with dipping sauce, and entrees of their Double Wonder (beef & chicken in the chef's special sauce), Pineapple Shrimp Curry, and Coconut Shrimp Special. The first and third dishes had those little red peppers or the word, \"spicy\" attached to them.  \n\nThe calamari wasn't bad. Tender chunks of squid, a bit too heavily breaded, and deep fried.  Decent dipping sauce. No real complaints. It was downhill from there. \n\nThe Double Wonder had a meager amount of beef sliced small, and more chicken, in a mildly spicy brown sauce.  Green and red pepper slices, good variety of mushrooms, but not enough flavor, and certainly not a wonder. Still, it was the best of the three.  The coconut shrimp had about a half dozen large shrimp, the same green and red peppers, pineapple chunks and not the faintest taste of coconut.  It was just uber sweet, with hints of mango and pineapple.  Can't believe they used canned pineapple on a white board special.  How hard is it to buy and cut up a few real ones?  The word, \"spicy\" was next to the name of the dish, yet there was nothing hot about it. No sign of chili pepper. It was just unabashedly sugary.  Finally, the pineapple shrimp curry was a Thai noodle dish.  It was awful. The noodles were mush, there was no curry taste, and then there were those canned pineapples, green and red peppers again. \n\nDoesn't anyone in the kitchen do quality control? No coconut in a coconut dish. No curry in a curry plate. No spice in a spicy platter.  Canned pineapple in a pineapple dish.  Red and green peppers everywhere. \n\nWhat a disappointment.\n\nPlace One. Star One.",
    "date": "2017-12-29 16:19:11"
  },
  {
    "review_id": "daJTCaM1WbI6pD2RxXVvMw",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "RSojqmaMUcX49Ta42H0WGg",
    "stars": 1.0,
    "useful": 20,
    "funny": 6,
    "cool": 11,
    "text": "Viet Kitchen is operated by the same folks who had the earlier International Smokeless BBQ. The new place looks about the same. Now, they offer all day breakfast, pho and com dishes, as well as tabletop grilling for later in the day. \n\nOur disappointment stemmed from the pho ga (chicken noodle soup). Although there was plenty of bird in the pot, the underlying broth was weak. It lacked body and flavor, and clearly had not been allowed to simmer and mature over time. Worse, about 20 minutes after first slurps, I began to feel symptoms of MSG poisoning. Difficulty breathing, heaviness in the chest and mild headache. Their attempt at a flavor shortcut was an utter fail. \n\nThe fried chicken (thigh and partial breast) was okay, but not worth the struggle with the pho.",
    "date": "2017-12-18 02:40:46"
  },
  {
    "review_id": "bAhIvEQdg4oF0YrA3GDQpA",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "sbEs9aLKIpF31VsH7DY1gA",
    "stars": 1.0,
    "useful": 2,
    "funny": 0,
    "cool": 0,
    "text": "Maybe the large \"For Rent\" sign next door was a symbol of what was to come, but I did not think of that on the way in.  I came down to Levittown to try Zhou's House based on Yelp reviews, and the fact that I eat Chinese food as often as I can and am always looking for alternative shops to try. \n\nThe space itself is nice.  It is bright, clean and comfortable.  The family operation is friendly enough and they take pride in maintaining a pleasant environment.  I stopped in for lunch around 2:00 and was the only customer.  As is my habit, the first time I visit a resto I order something standard off the menu that is available at every Chinese shop in the West for easy comparison.  This day it was General's Chicken, Fried Rice and an Egg Roll for $6.95.\n\nAll looked good when the large plate arrived at my table.  The colors, shapes and textures seemed right.  The aroma was nice.  Sadly, the positives ended with the atmospheric effects.  The Chicken was wrapped in a thick bready coating that hardened like a shell around a too small core of meat.  Not only could I not taste the chicken, but I could not even feel it in my mouth while chewing.  It was all bun/no beef.  The sauce was a thick goo, lacking in finesse and any heat quotient. All corn starch, little spice.  The Egg Roll tasted of stale cooking oil, and the Fried Rice was bland. Clearly, this was an empty dish designed to provide a full plate without substance at a lunch specials price. Feh!\n\nIt could be that the dinners at Zhou's are far better than the lunch menu, but I will never know.  Any restaurant willing to dish out the slop given me for lunch, is not one I would chance for dinner.",
    "date": "2014-04-03 14:17:17"
  },
  {
    "review_id": "OIw8aflOhbEEFvTtOD3X7Q",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "Tv70RauFKrwtmnFHLOP9yA",
    "stars": 1.0,
    "useful": 5,
    "funny": 4,
    "cool": 3,
    "text": "Sorry folks.\n\nThis strictly take out joint on S. Broad Street, Trenton, is just not very good.  The family running it is nice, but the food leaves a lot to be desired.  I guess if you can't make the trip to a reasonably authentic or even a decent Americanized Chinois place, then this is what is left.  It's a shame because there are several good places not too far away. \n\nThe dishes were plentiful with abundant fried rice and a large pile of Sesame Chicken, but the quality just was not there.  The taste was generic sweet gloop on top of too long frozen chicken, and fried rice that was made either last night or early in the morning with a large dose of brown dyed beef bouillon.  I watched as a Bento Box was prepared for someone.  The fish came out of baggies and sat on the hot prep table as it was put together.  I was glad I was not the one who was going to eat it.  I could practically see the bacteria multiplying.  \n\nThere are some relatively decent Chinese Take Out places in the area, but My Kitchen is not one of them.",
    "date": "2014-08-01 21:17:41"
  },
  {
    "review_id": "tGX1kLhRv3L4reNhthXI9w",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "JWwNOeEbf3Hy--URO6td2A",
    "stars": 1.0,
    "useful": 4,
    "funny": 1,
    "cool": 2,
    "text": "When you walk into a pizza joint for lunch at 2:30 and the chef is gone and nothing can be prepared, the first impression cannot be good.  \n\nSo it was today when I dropped by BellItalia of Trenton (not Bella Italia according to the sign and menu), a shoe box take out dive that had absolutely nothing to offer but its menu and the advice that I could order in the future and they would deliver.  \n\n'Fraid not, gentlemen.  \n\nThere is nothing \"Bella\", nor even \"Italia\" about this place.  So many better options in town it would be a shame to waste even one meal on this outfit.",
    "date": "2015-03-16 20:10:52"
  },
  {
    "review_id": "7CoOFwXGNdBlYegld4NXxA",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "P6oOsmPvKgGX8CJQYJLoLw",
    "stars": 1.0,
    "useful": 38,
    "funny": 24,
    "cool": 27,
    "text": "I stopped in this Ruby Tuesday's restaurant last night in the mood for a burger and beer. I sat at the small square bar, ordered a Sam's Winter Lager, but allowed myself to be distracted by the specials menu. So, rather than a burger I went with the Shepherd's Pie @ $11.99. \n\nBig mistake.\n\nWhile it included a reasonable salad bar, the \"pie\" itself was smaller than its photograph on the menu. It came in a cast iron skillet, perhaps 6\" in diameter at the top, and smaller at the base. It was primarily instant mashed potatoes above a ground beef gruel. I counted 5 peas. There was little beef and mostly a gravy-like substance beneath the top layer. Pathetic. \n\nI made the best of it, and did not request a better meal. I don't like being that guy. Still, it showed that Tuby Ruesday was willing to sell overpriced garbage dishes without qualms for quality nor their reputation. \n\nIf they don't care what they offer their customers, neither will we care to find out what comes next. In this business, one strike is all you get.\n\nComplete ripoff.",
    "date": "2018-12-15 19:50:43"
  },
  {
    "review_id": "HuoS8_l6RVGb8wDf0wHtAA",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "gra622l-9n_WSDUrPl9Oqg",
    "stars": 1.0,
    "useful": 64,
    "funny": 46,
    "cool": 45,
    "text": "I just checked the Village Bagel website to confirm what I had read before; \"...You will not be disappointed...Stop by...\"\n\nWell, when I arrived at their shop after a 30 minute drive from home to sample their product, I followed the directions posted on their windows to call in an order. No problem. Happy to comply. \n\nUnfortunately, the friendly sounding woman on the line advised me that they were not conducting any retail business for the day, but only filling orders for Christmas. I could not walk in, nor order a breakfast bagel (onion w garden veggie & coffee), but would have to leave empty handed. Not even explaining my long drive, nor the absence of any notice on their website, let alone, Yelp, nor sign on their front door, could persuade her to extend a humanitarian exception and slice/smear a bagel for me. \n\nNope. I would have to drive away without satisfaction. \n\nHo hum...\n\nMerry Christmas to you, too! \n\nThere wasn't any room at the inn, either. At least I am in good company.",
    "date": "2020-12-24 19:02:43"
  },
  {
    "review_id": "voSp4ERf9dTDX-veHkdx-Q",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "HR5uGiVT0LXV5SnLgqPmbw",
    "stars": 1.0,
    "useful": 4,
    "funny": 1,
    "cool": 1,
    "text": "Shumai Wok is a new entry to the \"Asian Fusion\" takeout wars in Penndel, Pa. It is one of those places that really only does \"to go\" food, although there is a solitary table sitting there for those like me who want to eat before returning to the office.  It is also one of those pseudo-fusion joints that offers Chinese, Japanese, and Thai dishes on their menu, but are really just a low budget Chinese house that makes cheap inauthentic versions of Japanese and Thai food, and does a sushi business in an attempt to be all things to all people.  \n\nWhile I cannot speak to the sushi, I did recently have a dish of Pad Thai with Chicken, which as a lunch special came with a choice of Soup and Rice.  As Thai soups were not offered, I accepted Wonton and Pork Fried Rice as the complements to the meal. Strange combo.  \n\nOf course, although I was eating there, everything came to the table in take out containers.  Okay. I can deal with that.  The Wonton Soup was overly salty (MSG?), and the wontons themselves, thick and without much filling.  The Fried Rice was dyed yellow from the chicken broth it was cook in that morning, was al dente and not worth the calories.  Finally, the Pad Thai used the wrong thin noodles, and a sauce that tasted like the topping for General Tso's Chicken, not the traditional gravy that a Thai kitchen would produce.  The weird orange color gave it away.  \n\nThis was a one time only visit.  Although the people who work there (owners) are friendly and the prices are low, the food was a major downer, and it seems impossible for it to get to neutral ground where it would be tolerable.",
    "date": "2014-05-29 14:37:50"
  },
  {
    "review_id": "iD0ez25iw-bJECEs6KC8SA",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "RPAJ8Hsb2qPLcBy1G2uPOA",
    "stars": 1.0,
    "useful": 14,
    "funny": 2,
    "cool": 0,
    "text": "Sad to say, the other reviewers are correct. \nThis is an example of how a bad business can continue to thrive in the absence of competition.  It is obvious the workers reflect the attitude of the management.  They make half hearted attempts to do the job, although they appear to be swarming over the car with sprays and rags.  There is always something left undone, and nary a smile or \"thank you for coming.\"",
    "date": "2013-01-27 17:52:13"
  },
  {
    "review_id": "yhMQxUWV2DXzMVLJUPEbug",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "iiXZBcgyd0cfvZLoeYmpVA",
    "stars": 1.0,
    "useful": 46,
    "funny": 27,
    "cool": 30,
    "text": "Mallu Cafe on Verree just off Bustleton in far Northeast Philly is really a take out Indian joint, with a few tables for those who don't mind the run down decor or aren't aware of the business model employed (like me). Their website was interesting, and showed nice photos of many of their Kerala dishes. Perhaps, I should have been deterred by the sketchy dudes hanging by the front door (even more of them when we left), but they smiled when we approached and invited us in. \n\nStrange, but no big deal.\n\nWe ordered Chicken 65 (spicy chili fried), Avial (mixed veggie coconut curry) and Appam (rice flour fry bread). They arrived in take out containers with plastic forks (?!). The chicken had been deep fried to a very dark brown and delivered without any sauce. Obviously, overcooked by someone who didn't know their own recipe, or hadn't looked at their website, as I had. I returned it to the kitchen. I wanted it done the right way, but that wasn't offered. Rather, they wanted to give us Kerala Chicken Curry. \n\nOkay. Whatever.\n\nWhile we waited we sampled the veggie dish. It was cool on top and hot at the base. Microwaved, and no one bothered to see if it was fully recooked. Nope. Further, it didn't look like the pics on the website, either. Rather than having distinct veggies, it was all mashed together. Didn't change the decent taste, but the presentation was lacking. \n\nWhen the replacement curry arrived we quickly saw that it was bone in small pieces. Hard to deal with only a plastic fork. The flavor was fine, but with the morsels to contend with it was not worth the effort. It was hard to understand why they would give us the bones, when boneless was only a buck more. Besides, they never asked which we would prefer. No. My sense was they were annoyed about their earlier mistake with the 65, knew they could not charge us for that, and decided to throw some shade at us by literally boning us. \n\nWe surrendered, asked for the check, and definitely did not want to take anything home. \n\nWhen we left there were more dudes just hanging around outside. Maybe they were waiting for us to leave so they could start their pinochle game. \n\nMallu Cafe just didn't seem to be a restaurant anymore. There are plenty of good Indian houses in this part of the city. This place just isn't one of them. \n\n1 Star - Avoid",
    "date": "2019-05-27 07:00:33"
  },
  {
    "review_id": "7dH0LBSVVvx3oZRlLX6kFQ",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "1ZafwEsM1pyE4z63SW81hw",
    "stars": 1.0,
    "useful": 18,
    "funny": 14,
    "cool": 15,
    "text": "The old saying, \"You can't eat the atmosphere,\" is turned on its head at Po-Po No 1 Chinese Restaurant just off the intersection of East State Street and North Broad Street in Trenton, NJ.  At Po-Po, the atmosphere can eat you! \n\nI walked in around 2 for lunch today, after easing my way around the throng of folks hanging on the corner waiting for the bus or other transaction.  Once inside, I walked to the counter to order a lunch size General Tso's Chicken for consuming on the premises.  Some of those nice people outside seemed to follow me in, and sat/stood around the dining area in various conversations laced with cursing and undisguised hostility toward the world.  Not one to give in to the anxiety I began to feel, I sat at the table waiting for my meal to be ready, and then returning to the counter to pick it up.  \n\nThe food was about average for a cheap Chinese fast food lunch.  A pile of chicken chunks, breaded, fried and covered in goop, on top of yellow dyed fried rice with almost no veggies or meat in the load.  The taste of the bird was okay, but the rice was nothing more than filler on the plate. No effort to give it any real taste.  \n\nNo. I won't return, nor would I recommend anyone that wants to dine in relative comfort and security do so.  This joint is just too close to a bad street scene that uses this place as part of its sordid sorrowful reality.",
    "date": "2017-03-22 13:52:10"
  },
  {
    "review_id": "3hEzrdqv-zCjL9tLv81ybw",
    "user_id": "-G7Zkl1wIWBBmD0KRy_sCw",
    "business_id": "zPr2qvrUaHaHLnOuqQQF9Q",
    "stars": 1.0,
    "useful": 16,
    "funny": 9,
    "cool": 7,
    "text": "The concept is a good one. Visit any Costco and you will see it done extremely well. Warehouse size store and warehouse prices. At this Aldi's on Woodbourne Road in Langhorne, Pa., they get the pricing part right, but the size and functionality of the space totally wrong. \n\nThis is a shop about the size of a large Wawa, but designed in the 1990's with completely inefficient layout, and snail paced cashier check outs.  The products are stacked onto shelves in their original boxes, with the discount prices listed above or below.  If you see something you need/want, it is easy enough to grab it and put it in the broken down supermarket carts that cost a quarter to unshackle out front. They are rusty and in need of maintenance. \n\nThe fresh produce is hit or miss. The bakery items limited.  There are plenty of canned and boxed goods, mostly from labels I never heard of.  Plenty of cold cereals. The check out line is long and slow, made worse by the absence of bags.  You have to bring your own or use the boxes in the store. That's okay, but the people loading them on the shelf beyond the two cashiers make for more congestion and confusion.  \n\nThe shop has seen better days.  It is disheveled like a permanent bad hair day. It looks like it hasn't been thoroughly cleaned nor painted in the past decade.  \n\nFor me, it is not worth the small savings to experience the depression I feel walking around the store.  \n\nThis Aldi's needs an extreme makeover in the worst way.  It is the sister of one of my favorite stores, Trader Joe's. How they can be siblings is beyond me.  It sure needs more love and attention.",
    "date": "2017-06-12 20:07:01"
  }
]